{
    "C_course-v1:McGillX+ATOC185x+2015_T1": "地球上没有一处地方不发生自然灾害。当我们以科学的眼光看待这些自然灾害的原因和本质时，我们可以更好地减轻灾难的后果。然而，随着世界人口持续增长，越来越多的人受到灾害的威胁。本门课程将探索不同类型自然灾害背后的科学原理，以及人类在控制、预测这些灾害方面的可为与不可为。学完课程后，学生可以深入理解自然灾害，而不仅仅是停留在新闻标题的了解。同时，还将学到减小自然灾害影响的方式。每一个人都应该理解自然灾害发生的科学原理。城市规划者需要知道房屋建造的合适位置。政治家需要做出科学合理的决策。紧急管理官员需要知道潜在灾难的本质，以及预防灾难的方式。记者则需要科学准确地进行报导。你将学到： 探讨人类与自然之间的矛盾 探讨自然灾害对全球的影响和它们之间的联系 探讨自然灾害发生的科学原理",
    "C_course-v1:TsinghuaX+THESIS2015X+2015_T1": "学位论文答辩环节是研究生培养的重要环节，为了充分发挥该环节的育人作用，搭建学术交流的平台，进一步保障和提高研究生培养质量，清华大学研究生院从2014年开始，从申请学位的博士、硕士研究生中选取了部分具有代表性的学位论文答辩进行录像，并首次将答辩视频上传学堂在线，获得了社会各界的认可和积极反响。2015年，清华大学将继续这一形式，遴选不同专业的博士、硕士研究生的学位论文答辩视频，继续以MOOC形式共享呈现给大家，以使更多的人能够分享这些资源，搭建更为广阔的学术交流平台。如果这些视频能对您的学术研究有所帮助和启发，则是我们十分期待并愿意看到的事。",
    "C_course-v1:TsinghuaX+THESIS2014_1X_tv+_2014_": "学位论文答辩环节是研究生培养的重要环节，为了充分发挥该环节的育人作用，搭建学术交流的平台，进一步保障和提高研究生培养质量，清华大学研究生院从2014年春季学期申请学位的博士、硕士研究生中选取了部分具有代表性的学位论文答辩进行录像，并首次将答辩视频上传学堂在线，以使更多的人能够分享这些资源，搭建更为广阔的学术交流平台。本学期将会有来自经管学院、五道口金融学院、化学系、马克思主义学院、建筑学院、人文学院、交叉信息研究院、航天航空学院、计算机系、工程物理系、自动化系、物理系、新闻学院等不同院系的二十余名博士、硕士研究生的学位论文答辩视频，涵盖十余个学科。如果这些视频能对您的学术研究有所帮助和启发，则是我们十分期待并愿意看到的事。",
    "C_course-v1:TsinghuaX+THESIS2015X_tv+2015_T1": "学位论文答辩环节是研究生培养的重要环节，为了充分发挥该环节的育人作用，搭建学术交流的平台，进一步保障和提高研究生培养质量，清华大学研究生院从2014年开始，从申请学位的博士、硕士研究生中选取了部分具有代表性的学位论文答辩进行录像，并首次将答辩视频上传学堂在线，获得了社会各界的认可和积极反响。2015年，清华大学将继续这一形式，遴选不同专业的博士、硕士研究生的学位论文答辩视频，继续以MOOC形式共享呈现给大家，以使更多的人能够分享这些资源，搭建更为广阔的学术交流平台。如果这些视频能对您的学术研究有所帮助和启发，则是我们十分期待并愿意看到的事。",
    "C_course-v1:TsinghuaX+00690242+sp": "中国考古学是以往100年中发展最为迅速的领域之一，大批珍贵文物的出土，不断刷新人们对文化中国的认识。本课程以4-6件（组）精品文物作引子，将学术界探索中华文明的过程作为线索，介绍古代中国在造船、玉器等诸多领域的杰出成就，其中不乏学术前沿的考古发现与研究成果，内容精彩纷呈，雅俗共赏，学生可以藉此获得对文化中国全方位的、直观而深入的认识。",
    "C_course-v1:HNU+HNU001+sp": "现代社会离不开人际交往，人际交往离不开现代礼仪。湖南大学袁涤非副教授向你精彩讲授《现代礼仪》课程。课程分为“绪论”“个人形象礼仪”“生活礼仪”“言谈礼仪”“职场礼仪”“社交礼仪”“餐饮礼仪”“涉外礼仪”八章，融理论性、指导性、实践性、艺术性和趣味性为一体，可操作性强，使用范围广，助你成为有修养、有品位、有风度、有气质，懂得爱己爱人的现代人。课程共讲授8章内容，以12周为一个学习周期，每周约50分钟左右的视频，每章约10道习题或讨论题。课程设两个学分，期终考试为一篇3000字以上的小论文或学习心得。最终成绩按平时作业和讨论60﹪+期终论文40﹪评定。",
    "C_course-v1:TsinghuaX+00720091X+sp": "足球运动是世界上开展最广泛、最受人们喜爱的体育运动项目之一，被称为世界第一运动。现代足球运动的科技含量、文化价值和社会影响与日俱增。足球的影响已经超越了运动的范围，融入政治、经济、教育、文化等各个领域。本课程通过网络学堂，结合教师的讲解、比赛视频画面分析及动画等手段将足球运动的基本知识和所蕴含的科学理论详尽的展示给同学们。使学生从全新的视角学习、理解、掌握足球运动的基本知识和科学规律，感受足球运动的独特魅力，激发学生热爱足球运动，积极参与足球运动的热情、增强体质，陶冶情操，促进学生的身心和谐发展。授课内容如下：第一章：足球运动简介及历史；足球技术；足球运动的物理规律第二章：足球战术；足球运动的统计学；教练员第三章：足球运动中的体能（机能、身体素质、身体形态）；足球运动中的生理学；足球运动中的对抗及运动损伤与预防第四章：足球的社会意义和人文价值；足球运动中的体育精神；足球运动中的心理学第五章：足球竞赛规则及裁判；场地设备；足球运动的设计第六章: 现代足球运动的技术、战术的发展趋势",
    "C_course-v1:TsinghuaX+00612642X+sp": "《资治通鉴》是北宋司马光主持编纂的著名编年体史书、传统史籍“通鉴体”门类的开山之作。该书以政治、军事为记述主线，上起公元前403年，下迄公元959年，以294卷、300多万字的篇幅，系统展现一千三百多年间华夏大地波澜壮阔的历史画卷。该书问世以来，不但以其不可替代的史料价值为历代学者所重视，更以其资政育人、总结历代治乱兴衰之道的根本动机与高卓史识为后世所称道，呈现出超越时空的巨大生命力。然而《资治通鉴》篇幅浩瀚、内容复杂，加以历史文献自身的时代特点，非文史专业出身的广大青年学生难以通读并领会其要旨。“《资治通鉴》导读”课程作为一门人文通识课程，目的即在于消除专业壁垒，引导同学直接感受这部中国伟大史学著作的魅力。课程主讲张国刚教授潜心研读《资治通鉴》数十年，通过精心选取其中的经典人物言行与历史场景，钩沉发覆、条分缕析，以现代思维总结文化精髓，以生动语言阐发历史智慧，尤其侧重其中修身、齐家、治国的现实意义。通过“《资治通鉴》导读”课程的学习，同学们不但可对战国至五代之间中国历史发展演化的基本脉络产生较为全面的把握，还可领悟到如何从传统文化汲取现实营养的基本方法，为终身学习国学经典开辟道路。",
    "C_course-v1:TsinghuaX+00691153X+sp": "本课程在艺术史、美学理论、思想史和文化史的交叉融合的基础上，通过对经典艺术作品的比较和分析，帮助学生系统了解中西艺术史的发展和特点，梳理中西艺术的艺术观点和美学理论。在课程安排上，抓住重点，以点带面，尤其注重处理中国和西方、传统与现代的对比，力求使学生不同艺术形态的转换有完整的认识。其目的最终落于教学的出发点，即提高学生的审美判断力、欣赏力，涵养艺术趣味，培养具有人文情怀的专业人才。课程主要内容教学：第一讲艺术概说：问题与方法第二讲偶像的黎明：无名大师的杰作第三讲美的神化创作：从荷马到菲迪亚斯第四讲威严与神明：从青铜器到汉画第五讲深情与风流：王羲之和顾恺之第六讲豪放与超逸：张旭和吴道子第七讲神圣与肉身：乔托和扬·凡·艾克第八讲肉身的神圣：从达芬奇到提香第九讲自然与人性：鲁本斯、普桑和伦勃朗第十讲气韵与品格：从王维到倪瓒第十一讲狂者与戏谑：狂人徐渭第十二讲古典的转进：从大卫到库尔贝第十三讲激情的旷野：康斯坦布尔和透纳第十四讲体验与关照：梵高和塞尚第十五讲无边的艺术：从杜尚到沃霍尔",
    "C_course-v1:UQx+Think101x+sp": "我们将对日常思考进行研究：为何人们会相信奇怪的事物，我们如何形成并改变我们的观点，为何我们的期望会偏离我们的判断，以及我们如何做出更好的决策。我们将对医疗诊断、超常现象、安慰剂、奇迹等话题进行研究和讨论。你将学习如何评价要求、理解证据，并了解我们为何常会做出非理性抉择。你将开始依赖费时费力、慎重逻辑分析的思考方式，而不是草率、自动、本能情绪化和程式化的思考模式。本课程会提供若干工具帮你如何独立思考，如何有所怀疑，如果根据个人经验衡量数据的价值。我们将研究人们使用和误用的心理捷径、经验法则，并将这些知识 运用于日常情景中，帮助我们做出更好的决策。Think101小组不远万里，拍摄到与部分非常天姿颇高的人们的谈话，其中包括：曾获诺贝尔经济学奖的 Daniel Kahneman，对虚假记忆进行前沿研究的 Elizabeth Loftus，甚至还有《流言终结者》节目中对说法的测试和对事实与虚构的区分。我们会见了世界各地21位著名思想者，整理了数百小时的谈话内容、示范说明、评价评估，做成短片，帮助了解如何评价要求，学习更好地记忆信息，并改善日常思维。",
    "C_course-v1:TsinghuaX+JWWCD001+2015_T2": "2014年10月17日，清华大学发布了《清华大学关于全面深化教育教学改革的若干意见》（简称“意见”）。“意见”要求推动教育教学主体从“以教为主”向“以学为主”转变；要转变教育方式，在本科人才培养中积极推进通识教育，促进通专融合；要丰富培养方向和评价标准，提升学生多样化成长的自主性、自信心和开放性。这些改革举措概括起来就是：三位一体，以学为主，通专融合，多样成长。为落实这次会议的成果，推进教育教学改革，清华大学教务处整理了若干有关清华大学在课程教学方面的核心概念、基本界定和要求，并以微课资源形式放置在学堂在线，以供广大教师参考。课程概述：本系列微课旨在为高校一线教师（尤其是为清华大学青年教师）提供的一门有关课程与教学基本知识的课程，以便教师了解课程计划、课程教学大纲、教学方法、作业类型及布置技巧、测评方法等方面的基本知识。课程目标：本系列微课的总体目标是在有限的时间内，最大限度地提供优秀高校教师所需要的有用的、操作性较强的课程与教学方面的知识。学完本系列微课，学员应该能够做到：① 正确界定有关概念。例如：教学大纲、学分、案例教学、过程性评估等等；② 明了目前教学领域的具有广泛影响的思潮及发展趋势；③ 能够较为清晰地解释课程是如何设计、如何实施教学、学生成绩如何评定；④ 能够提出目前个人教学中存在的问题，并找到相应的解决办法。教材和阅读材料：教材和阅读材料以大学图书馆、网站已有资源为主，会在学堂在线公布。",
    "C_course-v1:TsinghuaX+70660542X+2015_T2": "该课程由清华法学院各学科知名教授为研究生新生做的具有代表性的首场讲座编辑构成。涵盖宪法、法理、法制史、民商、经济法、行政法、国际法等领域，较为全面呈现法学体系中各分支学科的精髓，深入阐释法律学科研究方法，进一步启发法律思维，带领同学们进入法律学习的殿堂。",
    "C_course-v1:TsinghuaX+70120073X+sp": "有限元方法(finite element method)：基于数学力学原理，采用计算机信息化分析手段，完整获取复杂工程问题及科学研究中的定量化结果，也被称为一种基于计算机信息化处理的“虚拟实验”，在数学上它是求取复杂微分方程近似解的有效工具，是现代仿真技术的重要基础原理。有限元分析的力学基础是弹性力学，方程求解的数学原理是加权残值法和泛函极值原理，实现的方法是数值化离散技术，最终的载体是有限元分析软件。有限元方法已成为机械、航空航天、土木、力学等专业学生的必备知识。这门课程的主要内容包括：基本变量和力学方程、数学求解原理、离散结构和连续体的有限元分析实现、各种应用领域、有限元分析的软件平台和建模技巧等。在强调有限元理论的工程背景和物理概念的同时，通过一些典型的实例来深入浅出地系统阐述有限元分析的基本原理。此外，课程基于MATLAB演示基于有限元原理的编程方法，通过ANSYS来展示应用有限元方法的具体建模过程。",
    "C_course-v1:PekingX+Peking001x+_": "2015年5月，李晓明老师应邀在国家教育行政学院录制了关于慕课的13段讲课视频。这里就是以那些视频、讲稿为主要内容，辅以若干进一步思考的问题，对慕课进行深入解析和探讨的一门课程。视频和讲稿集中体现了李晓明老师作为慕课的学习者、开设者、组织者和研究者对这种新兴的互联网教学模式的实践、研究和思索，帮助你解惑常见慕课问题。在原有视频的基础上，课程做了进一步的设计，增删了部分内容。现在呈现给学习者的是3+1周内容，前3周偏理念层面，以帮助理解为主，最后1周重点介绍一种慕课视频制作的简便方法，消除对制作视频望而生畏的顾虑，如果你用这种方法实践一次，会发现视频制作原来很容易上手。课程中设计了四种类型的参与活动，一是课堂讨论，希望学员充分表达自己的思考，在观点的碰撞中加深认识；二是同伴互评，会在课堂讨论题中选取两题做同伴互评；三是客观题作业，希望学员理清基本概念；四是一次讲课视频制作实践任务，希望学员真正动手尝试。如果你是一名关心慕课的教师，想了解关于慕课的方方面面，初步试水；如果你是一名教学管理人员，想在众说纷纭的慕课浪潮下认清形势，把握方向，那么这门课程就能够帮助你。本课程适合关心慕课与在线教育的广大教师、教学管理工作者与政策制定者学习。",
    "C_course-v1:UST+UST001+sp": "《网络技术与应用》课程基于TCP/IP体系结构组织教学内容，全面反映当前主流网络技术，在实际的网络环境下讨论各种协议的工作流程、各种网络技术的工作机制及它们之间的相互作用过程，完整系统地介绍计算机网络领域中的基本概念、基本知识和基本原理。注重能力培养和互联网思维培养。涵盖新版全国计算机等级考试三级——网络技术、CCNA路由和交换认证的考试要求。教学过程中引入软件实验平台Cisco Packet Tracer，直观演示IP分组端到端传输过程中交换机、路由器等网络设备处理IP分组的每一个步骤、各层PDU的细节和变换过程。演示用Cisco网络设备设计、配置和调试各种规模的网络的过程。采用案例牵引的教学方法，每一讲内容融入案例中，通过案例的实现过程，逐步展示运用各个知识点解决问题的方法和过程，及知识点之间的相互关系。通过课程学习，使学生掌握通过全国计算机等级考试三级——网络技术、CCNA路由和交换认证考试的知识基础，同时具备以下能力：1、用无线局域网、交换式以太网技术设计类似校园网这样的互连网络的能力；2、用ADSL或以太网解决Internet接入的能力；3、设计一般互连网的能力；4、用路由器的分组过滤功能或防火墙解决一般的网络安全问题的能力；5、配置应用服务器的能力；6、计算思维能力。",
    "C_course-v1:SDUx+00931800X+sp": "本课程主要讨论有限维线性空间的线性理论与方法，具有较强的逻辑性、抽象性与广泛的实用性，尤其在计算机日益普及的今天，解大型线性方程组、求矩阵的特征值等已经成为技术人员经常遇到的课题。因此，本课程所介绍的方法广泛地应用于各个学科。通过本课程的学习，使学习者获得应用科学中常用的矩阵方法，线性方程组、二次型等理论及其有关的基础知识，并具有熟练的矩阵运算能力和用矩阵方法解决一些实际问题的能力，从而为学习后继课程及进一步扩大数学知识面、提高数学素养奠定必要的基础。为方便广大学习者，MOOC线性代数课程将更注重学习过程的引导和学习兴趣的培养，我们将传统意义的线性代数课程分成六个部分，共51讲。主要内容包括：行列式、矩阵、n维向量、线性方程组、相似对角形、二次型。内容以较小的颗粒形式呈现，力求更突出其精华，一次讲解1-2个知识点，使学习者更易于接受，更感兴趣；同时穿插思考题或测试题，引导学习者设疑提问，共同学习与解决问题。",
    "C_course-v1:TsinghuaX+00690212X+sp": "中国是传承千年的礼仪之邦，声教播于海外。相传在3000多年前的殷周之际，周公制礼作乐，就提出了礼治的纲领。其后经过孔子和七十子后学，以及孟子、荀子等人的提倡和完善，礼乐文明成为儒家文化的核心。西汉以后，作为礼乐文化的理论形态和上古礼制的渊薮，《仪礼》、《周礼》、《礼记》先后被列入学官，不仅成为古代文人必读的经典，而且成为历代王朝制礼的基础，对于中国文化和历史的影响之深远，自不待言。随着东亚儒家文化圈的形成，礼乐文化自然成为了东方文明的重要特色。毋庸置疑，要了解中国传统文化，就必须了解中国礼仪文化。本课程讲通过大量的文献材料，深入浅出地讲授中国古代礼仪文明的基本框架，建立中华传统礼仪观念的过程，培养学生人文素养，建立良好操守，并引导其在生活中践行中华传统礼仪。",
    "C_course-v1:TsinghuaX+00680082X+sp": "第一章：《人类审美意识的萌芽》1、美的本质及其规定。2、巫术崇拜和图腾崇拜的文化内涵？第二章：《奴隶社会的时代精神》从古埃及建筑、古代中国青铜器和古希腊雕塑、古罗马建筑艺术，探索奴隶制社会时代精神的确立及其向自身对立面的转化的客观规律。第三章：《封建社会的时代精神》从中国水墨线描艺术的审美特征探索封建社会时代精神的确立及其向自身向对立面的转化的客观规律。第四章：《资本主义社会的时代精神》1、从意大利文艺复兴到法兰西启蒙运动探索资本主义时代精神的确立。2、从批判现实主义到写实主义再到印象派艺术和现代文艺思潮，揭示资本主义时代精神向对立面转化的客观规律。第五章：《社会主义的时代精神》社会主义时代精神的形成和发展。",
    "C_course-v1:TsinghuaX+30260112X+sp": "微纳加工广泛应用于物理、化学、材料、电子、机械、生物等各种学科。本课程的目的是使学生掌握各种微纳加工的基本原理，为未来的研究打下很好的器件制备基础。本课程的特点是制作较多的动画，让同学理解工艺过程不再是一件难事。同时本课程将会针对各个工艺过程中的设备进行拍摄和介绍，让同学结合设备视频和课堂讲授，深度掌握加工工艺，以后给导师制备一个新型器件不再是难事。本课程将会讲授氧化，低压化学气相沉积，等离子加强化学气相沉积，热蒸发，外延，电子束蒸发，3D打印，离子扩散，接触式光刻，电子束光刻，湿法刻蚀，干法刻蚀等各种工艺手段；同时也会介绍介绍常用的工艺检测方法和MEMS加工技术、集成电路工艺集成技术和工艺技术的发展趋势等问题。通过本课程的学习，学生不仅可以掌握器件制造的基本工艺和原理，同时也可以了解到当前工业界以及研究领域最新的工艺趋势。",
    "C_course-v1:TsinghuaX+00310222X+sp": "课程包括三部分内容：（1）主讲者参与拍摄的《走进科学》《原来如此》等栏目，介绍其中的道具设计和实验过程；（2）展示趣味科学游戏的设计及现象；（3）教授AutoCAD基础设计，利用激光切割机设计制作有趣的小装置（10个原创的装置，从简单到复杂）。",
    "C_course-v1:BIT+PHY1701702+sp": "电磁学是物理学的一个重要分支，它研究的对象是电磁运动及其所引起的各种现象最基本的规律。电磁学的发展不仅与人们的日常生活和生产技术有着十分密切的关系，而且也是电工学、无线电电子学、电子计算机技术以及其他新科学、新技术发展的基础。这里我们着重从场的观点阐述静电场和稳恒磁场的基本概念、基本规律和基本定理，揭示电磁感应现象的物理本质，最后介绍电磁场理论的初步知识。通过课程学习，学生掌握电场、磁场、电磁感应的基本规律和基本现象，特别是电磁场的基本定律定理，包括库仑定律、静电场的高斯定理、静电场的环路定理、安培定律、磁场的高斯定理及安培环路定理、电磁感应定律等，并利用这些定理定律分析和解决电磁学中的一些问题。",
    "C_course-v1:BIT+PHY1701701+sp": "量子力学和相对论统称为近代物理学，是20世纪物理学最伟大的发现，没有它们就不会有今天的计算机、激光、核能、纳米、宇宙探索等各种各样的高新技术。本课程在相对论部分着重阐明狭义相对论的基本原理及其在物理学中的重要意义。关于洛仑兹变换、时空观和时空几何的讨论，如同时性的相对性和动钟变慢和长度缩短及动力学方面的内容如相对论质量和动量、相对论能量的学习，都有助于大家加深对狭义相对论的理解。在量子物理部分我们将大至顺着人类对微观粒子本性认识的发展历史，通过黑体辐射规律、光电效应现象、康普顿效应、粒子的波动性等这些对经典物理而言是不可思议的怪事。着重引入普朗克、爱因斯坦、德布罗意、玻恩、海森伯等相继提出的量子物理中一些基本概念、规律和方法，使同学们从中体会和欣赏微观世界的和谐与优美。主要包括相对论和量子物理两部分内容，其中相对论部分着重介绍狭义相对论的基本原理、洛伦兹变换、相对论的时空效应以及动力学方面的内容，还简要介绍广义相对论的基本原理和时空观；量子物理部分着重介绍微观粒子的波粒二象性、薛定谔方程及其应用、固定物理基础等。给学生创新思维和探究精神的启迪。",
    "C_course-v1:TsinghuaX+80515522X+sp": "课程将以透析房地产业的各级产业链和房地产的各物业类型为双向维度展开，深入剖析房地产业在国民经济中的地位以及房地产业和房地产市场长期持续稳定发展所面临的挑战。本课程是清华大学的学分课程，共计32课时、2学分。课程大纲由协会学术委员会制定，课程开发和授课全部由协会理事承担。评价方式包括随章练习50%，期末客观题考查50%。课程依托校友资源，由杨斌副校长和聂梅生会长共同发起，清华大学研究生院与清华校友房地产协会联合设计和策划、共同组织安排，经管学院承办、土木水利学院和建筑学院协办。",
    "C_course-v1:TsinghuaX+34000888X+sp": "医学，从诞生之日起，就因为浓郁的宗教背景而被蒙上了一层神秘的色彩。但是，人们对医学的探究却从未因此而停止。怀着对健康的渴望以及对永生的向往，人类把一切的聪明才智和科技成果都运用到了医学领域。当你用鼠标点开《走进医学》这门课程，我们将带你进入一个全新的世界，他是那样的广袤无垠，却又妙到豪巅。我们的课程将带你探寻从宏观的环境与健康的关系，到微观的疾病发生的分子学原理。如果你是一名有一定医学教育背景的医学生，或者是一名对医学感兴趣的大学生，那么欢迎你进入到我们的课堂。我们的老师既有从事医学基础研究的教授，也有战斗在临床一线的专家，我们将以独特的视角向您展示疾病的发生、发展以及人类与疾病斗智斗勇的抗争过程。开设这门课程，主旨是希望学习者通过这扇门，来了解什么是健康、如何做到健康、疾病是怎样发生的以及如何战胜疾病，使大家在学习之后能够对医学产生一定的兴趣，并掌握一定的医学知识，树立健康的生活方式，在周围人群需要健康指导的时候能够施以援手，贡献自己的一份力量。",
    "C_course-v1:TsinghuaX+00690092X+sp": "“逻辑”一词很常用，但作为一门学科和课程，“逻辑学”涉及的内容范围，比“逻辑”一词日常的用法范围要小得多。它的研究对象是推理，更准确地说，是“有效推理形式”。什么样的是有效推理形式？怎样判定？怎样生成？逻辑学中要给出基本的方法。   作为面向非逻辑学专业学生的逻辑学概论课，本课程的着眼点不仅仅在于讲授逻辑学中的具体内容，而更致力于使学生了解逻辑学的基本思路、准则和方法。能否和如何运用于实践，则有待于我们的共同努力。主要内容包括：中外逻辑发展简史，复合命题的推理，命题演算，性质命题的推理，关系命题的推理，谓词演算概要，归纳推理简介，非经典（非标准）逻辑初步等。",
    "C_course-v1:TsinghuaX+00690342X+sp": "本课程面向各专业本科生，通过课堂讲授与课外阅读讨论的方法，把握古希腊罗马哲学家丰富的思想，探讨哲学精神的起源，揭示古希腊民族的精神取向，阐明古希腊民族思维方式的特征，帮助学生把握哲学的基本精神，养成理论思维的能力，培养高尚的情操，提高人文素质。第1讲，导论一：哲学、宗教与文化，1.1:哲学，1.2：宗教，1.3：文化，第2讲，导论二：希腊哲学概览，2.1；希腊哲学的生存环境，2.2：希腊哲学的发展阶段，2.3：分期、流派与著述，第3讲，求是——理性精神的萌发，3.1：“是”的基本内涵，3.2：向理性思维过渡，3.3：对古代思想家思维方式的分析，第4讲，求本——本体论、形而上学，4.1：相关词语解释，4.2：寻求本原，4.3：柏拉图寻求本性，4.3：亚里士多德寻求本体，第5讲，求知——古代知识论，5.1：相关词语释义，5.2：柏拉图论知识，5.3：西塞罗论知识，5.4：奥古斯丁论知识，第6讲，求真——方法论、逻辑学，6.1：相关语词释义，6.2：柏拉图的辩证法，6.3：亚里士多德的逻辑学，第7讲，求实——科学精神，7.1：相关词语释义，7.2：科学的起源和发展，7.3：科学的实用化与技术化，第8讲，求美——爱的礼赞，8.1：相关词语解释，第9讲，求善——伦理思想，第10讲，求仁——人文主义，第11讲，求义——正义论，第12讲，求礼——国家与法制，第13讲，求福——宗教的寻求，第14讲，求圣——与神合一，第15讲，总结：希腊哲学的基本精神",
    "C_course-v1:TsinghuaX+20350033X+sp": "“工程材料”课程是高等院校机械类/制造类专业的一门十分重要的技术基础课。涉及专业领域包括机械、能源动力、车辆、仪器、航空航天、材料工程等。课程任务是从机械工程应用的角度出发，阐明工程材料的基本理论，了解材料的成分、加工工艺、组织、结构与性能之间的关系；掌握常用工程材料及其应用等基本知识。课程内容包括工程材料的成分、结构、组织、性能及其影响因素等基本理论和基本规律；介绍金属材料、高分子材料、陶瓷材料、复合材料、功能材料及新材料等常用工程材料以及其应用等基本知识；机械零件的失效分析与选材原则、常用机械零部件选材与实例分析等内容。课程目的是使学生通过学习，在掌握工程材料的基本理论及基本知识的基础上，具备根据机械零件使用条件和性能要求，对结构零件进行合理选材及制订零件工艺路线的初步能力。能源、材料和信息是现代社会和现代科学技术的三大支柱，学习并掌握工程材料的基本知识，对于工科院校机械类专业的学生是十分必要的。",
    "C_course-v1:TsinghuaX+00740043X_2015_T2+sp": "C++是从C语言发展演变而来的一种面向对象的程序设计语言。面向对象的程序设计方法将数据及对数据的操作方法封装在一起，作为一个相互依存、不可分离的整体——对象。对同类型对象抽象出其共性，形成类。类通过外部接口，与外界发生关系，对象与对象之间通过消息进行通讯。这样，程序模块间的关系简单，程序模块的独立性、数据的安全性具有良好的保障，通过继承与多态性，使程序具有很高的可重用性，使得软件的开发和维护都更为方便。由于面向对象方法的突出优点，目前它已经成为开发大型软件时所采用的主要方法。而C++语言是应用最广泛的面向对象的程序设计语言之一。本课程是一门面向广大初学者的入门课程，自1999年开始在清华大学开设，本课程的教材已经在清华大学等一百多所学校的不同专业中使用，取得了良好的教学效果。本课程将C++语言作为大学生的计算机编程入门语言，不仅详细介绍语言本身，而且介绍常用的数据结构和算法、面向对象的设计思想和编程方法。课程以面向对象的程序设计方法贯穿始终，每一章都是首先阐述面向对象的程序设计思想和方法，由实际问题入手，然后引出必要的语法知识，在讲解语法时着重从程序设计方法学的角度讲述其意义和用途。本课程是清华校内同名课程的完整版，内容全面，难度适中，包括了ISO第三版C++标准（C++11）的新内容。课程分《C++语言程序设计基础》和 《C++语言程序设计进阶》，各8周。《C++语言程序设计基础》无先修课程要求，内容包括程序设计基础知识、数据的表示和基本运算、函数与重载、类与对象、数据的共享与保护、数组、指针、字符串。教材：《C++语言程序设计》（第4版）1-6章，《C++语言程序设计（第4版）学生用书》1-6章。《C++语言程序设计进阶》要求必须先修《C++语言程序设计基础》或者阅读《C++语言程序设计》（第4版）1-6章。内容包括继承与多态、运算符重载、模板与泛型程序设计、文件I/O、异常处理。教材：《C++语言程序设计》（第4版）7-12章，《C++语言程序设计（第4版）学生用书》7-12章。",
    "C_course-v1:TsinghuaX+00740043_2x_2015_T2+sp": "C++是从C语言发展演变而来的一种面向对象的程序设计语言。面向对象的程序设计方法将数据及对数据的操作方法封装在一起，作为一个相互依存、不可分离的整体——对象。对同类型对象抽象出其共性，形成类。类通过外部接口，与外界发生关系，对象与对象之间通过消息进行通讯。这样，程序模块间的关系简单，程序模块的独立性、数据的安全性具有良好的保障，通过继承与多态性，使程序具有很高的可重用性，使得软件的开发和维护都更为方便。由于面向对象方法的突出优点，目前它已经成为开发大型软件时所采用的主要方法。而C++语言是应用最广泛的面向对象的程序设计语言之一。本课程是一门面向广大初学者的入门课程，自1999年开始在清华大学开设，本课程的教材已经在清华大学等一百多所学校的不同专业中使用，取得了良好的教学效果。本课程将C++语言作为大学生的计算机编程入门语言，不仅详细介绍语言本身，而且介绍常用的数据结构和算法、面向对象的设计思想和编程方法。课程以面向对象的程序设计方法贯穿始终，每一章都是首先阐述面向对象的程序设计思想和方法，由实际问题入手，然后引出必要的语法知识，在讲解语法时着重从程序设计方法学的角度讲述其意义和用途。本课程是清华校内同名课程的完整版，内容全面，难度适中，包括了ISO第三版C++标准（C++11）的新内容。",
    "C_course-v1:TsinghuaX+10610193X+sp": "本课程以高校思想政治理论课教材“《中国近现代史纲要》”一书为基础，讲授1840年以来中国人民抵御外来侵略、探索国家出路、争取民族独立、实现人民解放、建立新中国、建设社会主义现代化的伟大历程。本课程以在线教学讲授为主，结合大量视频和文字材料，同时辅以小组讨论等形式，力求关注研究前沿，融时代性、科学性和学术性于一体，培养学生所应具备的历史意识和时代意识，帮助学生更为深入地了解国史、国情，更为深入地了解历史和人民是怎样选择了马克思主义，选择了中国共产党，选择了社会主义道路，选择了改革开放。",
    "C_course-v1:Tsinghuax+30130123X+sp": "控制工程基础课程是机械学院本科生的一门专业基础课。控制工程基础课程的主要内容包括：机电系统建模、系统时域瞬态响应分析、频域分析、系统稳定性及误差分析、控制器的设计。清华大学控制工程基础课程的教学主要针对闭环控制系统的分析与校正，为学生提供了扎实的基础和丰富的应用。",
    "C_course-v1:TsinghuaX+40050444X+sp": "《大气污染控制工程》是环境工程、环境科学等相关专业的主干专业课。本课程旨在向学生全面讲授大气污染的来源影响、传输扩散和控制技术，重点介绍大气污染控制的基本原理、主要大气污染物的控制工艺和特点、典型工艺的基本计算方法和应用范围、以及相关技术的国内外最新研究进展。近年来，大气污染日益突出，严重威胁公众健康，成为人类面临的共同挑战。《大气污染控制工程》的授课内容紧密结合大气污染控制工程实践和学科发展前沿，重点培养学生分析和解决大气污染控制工程问题的能力，为大家进行大气污染控制工程设计、科研及技术管理打下必要的基础。该课程是清华大学第一批校级精品课程。2004年，该课程成为全国首门“大气污染控制工程”国家级精品课程。2013年，该课程成为中国大学精品资源共享课。目前该课程由清华大学环境学院王书肖教授、郝吉明教授共同讲授，教学团队包括吴烨教授、段雷教授、段凤魁博士以及5位助教。我们课程组将竭力为同学们服务！欢迎所有对大气污染控制感兴趣的同学加入我们的课堂。让我们一起学习《大气污染控制工程》，了解并掌握大气污染控制的原理和方法，共同为环保事业奉献自己的一份力量！",
    "C_course-v1:TsinghuaX+30320174X+sp": "核辐射物理及探测学是核工程与核技术专业的基础课，内容涵盖了核辐射物理及辐射探测学两部分，构成了从辐射产生、辐射性质到辐射探测的完整体系。课程在包含核物理的基本内容的同时，加强了对核衰变、核反应等核过程发生的条件与概率的论述，加强核衰变规律、辐射与物质相互作用等外部表征的论述，强化对核素衰变纲图等核数据的理解和应用的能力的训练。辐射探测讲述了气体、闪烁和半导体等三种最常用的辐射探测器，重点放在论述信号形成的物理过程、探测器的工作状态与输出回路参数的关系、统计涨落对探测器性能的影响等共性问题上。通过本课程的学习，可以掌握核物理的基本内容，掌握核的变化规律及其探测原理和探测方法。",
    "C_course-v1:TsinghuaX+00460032X+sp": "本课程从中国的角度介绍全球气候变化。了解中国对气候变化的科学认知，认识气候变化对中国的挑战以及区域气候变化的影响，学习适应与减缓气候变化的措施。介绍中国应对气候变化的政策与行动，对中国国家自主贡献（INDC）进行解读，阐述中国有雄心的气候变化行动与能源安全、环境保护以及可持续发展之间的协同效益。     特别说明：本课程将在《联合国气候变化框架公约》第21次缔约方大会（COP21），即2015年巴黎气候大会期间开设。",
    "C_course-v1:BIT+PHY1701601+sp": "课程内容覆盖了经典物理学的两个重要分支：力学和热学，在航天、机械、化学、材料、生命科学等领域有着重要的应用。本课程讲授力学和热学的基本研究方法、机械运动和热运动遵从的基本规律和理论、以及力学和热学的应用。通过此课程的学习，帮助学生掌握物理学最基本的知识和最具有普适性的研究方法。• 掌握研究机械运动和热运动的基本方法，包括描述系统所用的参量和方法，系统所遵循的基本方程及其应用等。• 掌握力学、热学的基本观点和基本规律，如能量的观点、熵的观点以及守恒定律。熟悉典型的运动，如刚体的定轴转动、气体的等值过程等，能够对具体的运动或系统进行合理地分析与判断，并熟练地运用微积分和矢量运算解决力学和热学中的基本问题。• 受到科学方法的训练，提高解决问题的能力，学会用力学和热学的知识，分析解释生活和自然界中的相关现象。",
    "C_course-v1:MicrosoftX+Microsoft101+sp": "计算机科学正在前所未有的影响着我们的生活，它令我们的生活更加简单方便、更为丰富充实。依托于计算机科学的大数据研究，则完美的展现了数量、速度和多样性等概念，也越来越成为计算机学界普遍关注的领域。2014年秋季，清华大学交叉信息研究院和微软亚洲研究院合作开设了《大数据基础与应用》研究生专业课。微软公司资深副总裁，微软亚太研发集团主席兼微软亚洲研究院院长洪小文博士等8名资深研究员和清华大学3位教授共同完成了18周的教学任务。该联合课程自开设以来受到学术界的关注和好评，纷纷建议微软亚洲研究院将相关内容以在线课程的方式与更多的高校师生分享。有鉴于此，经过长达半年的精心准备，《微软亚洲研究院大数据讲座系列》在线课程终于与大家见面了，课程用英文讲解，配有英文字幕，共6讲，合计约9个小时。*学习“微软亚洲研究院大数据系列讲座”在线课程，有机会获得参观微软亚洲研究院，与授课研究员面对面交流的机会。优秀学员更有机会成功申请微软亚洲研究院实习生计划。This will absolutely change your life!” —— 姚期智院士（图灵奖得主、清华大学教授）",
    "C_course-v1:BIT+PHY17016+sp": "振动和波动是很普遍的运动，是物理学研究的基本运动形式之一。波动理论是研究机械波、电磁波、光波、物质波等波动的基础，在工程技术和医学等领域有着广泛地应用。光学是物理学的一个重要分支，尽管它很古老，但目前该领域的研究仍然十分活跃，是物理学的前沿领域。本模块中主要讲授波动光学部分的知识。通过课程学习，学生掌握振动、波动的基本特点和研究方法，掌握波动光学的基础理论。包括描述振动和波动所用的基本参量、基本方程、振动与波动的叠加方法、光的本质、光的干涉与衍射以及偏振现象的实验与理论解释。能够熟练地研究典型的振动和波动，如简谐振动、简谐振动的叠加、简谐波、驻波等。熟练地分析典型的干涉和衍射现象，如杨氏双缝干涉、等厚干涉、单缝衍射、光栅衍射等。此模块注重培养学生理论联系实际的能力，训练学生应用所学的知识解释一些生活和自然界中的相关现象。",
    "C_course-v1:TsinghuaX+MOOC101_2015_2+sp": "教育部在线教育研究中心将本课程列为官方培训课程，获得通过后，将获得由教育部在线教育研究中心颁发的培训证书。眼下慕课（MOOC，大规模开放在线课程）成为一个教育行业的关键词，海内外众多高校都在尝试通过发展慕课向社会分享知识与智慧，为高等教育探索发展新路。慕课的出现也对当前的教学模式提出了新的方向和挑战。如何充分利用慕课的优势和特性，制作并教好一门出色的在线课程，切实提升教学质量，是摆在教育工作者面前的一道难题。2013年10月，清华大学在线教育办公室发布慕课《MOOCs制作与运营》，得到了广大教师和学习者的欢迎和认可。一年来，中国慕课迅速发展，课程类型和学习者规模都在日益增多，在实践过程中也遇到了诸多问题，收获了更多的经验。因此，本课程可视为《MOOCs制作与运营》的升级版，我们将试图还原慕课中教与学的方方面面，为你成为e时代的“大佬师”而保驾护航。本课分为六讲，主题分别为：认识 MOOC、设计MOOC、制作MOOC（流程与视频）、制作MOOC（视频之外）、运营MOOC、实战MOOC。",
    "C_course-v1:TsinghuaX+70250023X_2015_2+sp": "线性系统理论是控制科学与工程学科的一门最为基本的理论性课程，也是进一步学习控制理论其它系列课程必备的基础。本课程强调严格的逻辑训练与培养学生创新思维并重。具体内容为：第1部分为绪论，介绍采用系统理论阶解决工程问题的一般步骤，明确建模、分析、综合在解决实际问题中的作用。并重点介绍线性系统模型的特征和分析方法。第2部分为线性系统的时间域理论，介绍系统的状态空间描述，基于状态空间方法的分析和系统的结构特征和结构的规范分解以及状态反馈及其性质。还涉及线性系统典型反馈控制问题的时域综合。第3部分为线性系统的频域理论。首先引入有关的必要数学基础。然后介绍传递函数矩阵的矩阵分式描述、线性定常系统的多项式矩阵描述。",
    "C_course-v1:TsinghuaX+10430484X_2015_2+sp": "大学物理的课程归纳了物理学的经典内容，是前辈物理学家的发现和总结，是智慧的结晶。大学物理中的很多思想方法都带有普适性，对其它科学和技术的发展都有无可估量的重要意义。大学物理课程分两个学期开",
    "C_course-v1:TsinghuaX+10430494X_2015_2+sp": "大学物理2（电磁学、波动光学和量子物理基础）是大学物理1(力学、热学)的续篇,有一定关联性。比如，光学要用到振动和波动章节中的知识。其它内容也会涉及力学的概念，或者热学的概念，所以最好是学了大学物理1后再学大学物理2比较合适。如果过去学过一些力学和热学的概念和知识，也可以直接学大学物理2。大学物理2中电磁学部分涵盖了电磁学的基本内容，但因为学时限制只涉及最基本的概念和知识。光学部分主要讲干涉、衍射和偏振内容。量子物理部分其实只是量子物理的初步入门，介绍量子物理的最基本概念。学习量子物理时，我们会发现前面学过的有些经典概念可能是错的，这种情况可能还不少。这不是说前面学的白学了，经典物理概念有它适用的一面，也有其局限的一面。后面还简单介绍原子、固体以及原子核，主要用量子物理的概念，了解和认识它们的结构以及特性。同大学物理1一样，我们把内容分成：基本内容（不带星号），单星号内容以及双星号内容。清华以外的同学只要求基本内容，当然如果本人愿意，也可以与清华同学一样要求，即，除了这些基本内容外，还要求掌握单星号内容。双星号内容则是额外内容。",
    "C_course-v1:TsinghuaX+20220053X_2015_T2+sp": "“电工技术”是针对高等学校非电类专业本科学生的技术基础课，课程的主要目的是根据学生本专业对电气工程知识的需求，介绍电气工程的基本原理及应用。内容包括：电路的基本理论和分析方法、电路仿真工具（Spice和Multisim）、电动机的原理及应用、继电器-接触器控制和可编程控制器（PLC）等。特别鸣谢南京工程学院工业中心电工电子实验中心主任许其清副教授对本课程的支持。",
    "C_course-v1:TsinghuaX+30150153X+sp": "课程由两部分构成，第一部分是从整机和宏观的角度，阐述发动机的动力输出即动力性和能量转化效率即燃油经济性，包括发动机性能指标与影响因素，燃料、工质与热化学，工作循环与能量利用，换气过程与进气充量，运行特性与整车匹配等。第二部分是从局部和微观的角度，阐述发动机的燃烧过程与排放特性，包括燃烧的基础知识，柴油机和汽油机的混合气形成与燃烧，有害物生成机理与控制，新燃烧方式与替代燃料发动机等。课程讲授过程中，始终贯穿汽油机与柴油机的对比分析，以便于同学们更好地理解发动机的工作原理。",
    "C_course-v1:TsinghuaX+10421075X_2015_2+sp": "微积分学既是近代数学发展的基石，也是现代自然科学、社会科学、管理科学的重要基础。微积分是大学各专业的重要公共基础课，是学习后续课程的必要条件。微积分（B）主要面向清华大学理工科专业的学生，每学期授课学生超过1100人。微积分B(1)课程的主要内容包括：实数与函数、极限理论、一元函数微分学、一元函数积分学。极限理论部分对闭区间列紧性和实数完备性的介绍值得期待。微分学部分介绍了连续、导数、微分、导数应用等基本内容。积分学部分介绍了不定积分和定积分的内容，重点强调了定积分的思想和基本积分法。",
    "C_course-v1:TsinghuaX+10421084X_2015_2+sp": "微积分学既是近代数学发展的基石，也是现代自然科学、社会科学、管理科学的重要基础。微积分是大学各专业的重要公共基础课，是学习后续课程的必要条件。微积分（B）主要面向清华大学理工科专业的学生，每学期授课学生超过1100人。微积分B(2)课程的主要内容包括：多元函数微分学、多元函数微分学的应用、重积分及其简单应用、曲线积分与曲面积分、常微分方程。本门课程在制作过程中得到了Google公司的资助，特此鸣谢。",
    "C_course-v1:TsinghuaX+20330334X_2015_2+sp": "理论力学既是一门基础学科，又是一门技术学科。它一方面是众多工科课程的基础，同时又能独立处理很多工程问题。理论力学课程内容按研究方法分类，包括以牛顿定律为基础的矢量力学（几何力学）；以变分原理为基础分析力学。按研究内容分类，分为运动学：研究运动的描述；动力学：研究运动的力与运动的关系；静力学：研究力与平衡的关系。教学安排：绪论第I篇运动学第1章点的运动学第2章刚体运动学第3章复合运动第II篇静力学第4章几何静力学第5章分析静力学第III篇动力学第6章质点动力学第7章质点系动力学第8章分析动力学第IV篇动力学专题第9章刚体动力学第10章变质量系统动力学第11章机械振动基础前三篇是教学主要内容，第四篇可以根据情况选择部分内容讲解。在教学过程中，除了常规的授课、习题讲解外，还有大量生动有趣的与课程内容相关的小讲座、电视节目片段、趣味力学游戏穿插在其中。此外还会公布一些比赛的内容，进行线下的比赛。",
    "C_course-v1:TsinghuaX+0350161X_2015_T2+sp": " 本课程是材料学科的专业概论课。目的是使学生全面概括的了解材料科学。课程的覆盖面较宽，主要介绍各类材料体系的结构与性能，生产制备，科研和应用的概况以及材料的发展历史，目前状况和发展趋势等。各章节除介绍有关材料的基本知识外，还将反映该领域的新成果、新发展及其在新技术中的应用，用必要的例子生动地描述出该领域的基本情况、动态和趋势。这不是传统的导论课，而是一种照顾到学生现有水平的材料科学与工程的系列纵横谈，同时又是材料科学的学生刚跨入这一领域时的一次具体、深入的专业介绍。通过该课程的学习，同学们能够了解这一领域的版图和前景，掌握材料科学研究的若干方法。  本课程以《材料学概论》和《创新材料学》作为主要教材，系统鸟瞰学科概况。横向讨论绪论、元素周期表、金属、粉体、玻璃、陶瓷、聚合物、磁性材料、薄膜材料等相关内容，说明每一类材料从原料到成品的全过程、相关性能及应用。纵横交叉，旁及上下左右，共涉及百余个重要知识点，全面且简明扼要地介绍各类材料的新进展、新性能、新应用，力求深入浅出，通俗易懂。千方百计使知识新起来、动起来、活起来，做到有声有色，栩栩如生。力图以快捷、形象的方式把读者领入材料学知识的浩瀚海洋。",
    "C_course-v1:TsinghuaX+10421102x_2015_T2+sp": "线性代数是现代数学的基础之一，在物理、计算机图形学、工程、经济学等自然科学和社会科学各领域具有广泛和深刻的应用，同时线性代数是高等学校理工科各专业的一门重要基础课。本课程做为清华大学非数学理工科各专业学生重要的必修课程，介绍求解线性方程组、矩阵理论、向量空间和线性变换等线性代数的基本概念和基本理论，强调线性代数的理论与应用的结合。作为线性代数(1)的后继课程，线性代数（2）继续结合应用介绍正定矩阵、相似矩阵（若当标准形）、奇异值分解、线性变换、广义逆、复矩阵以及线性代数在工程、几何、经济问题中的应用等。通过本课程的学习，培养学生的数学逻辑思维和抽象思维能力，使学生具备线性代数的基本理论知识，熟练掌握求解线性方程组和矩阵运算、矩阵分解的基本方法，为后继的学习和提高奠定数学基础。",
    "C_course-v1:TsinghuaX+20430064X+sp": "量子力学是近代和现代物理学的理论基础，也是许多现代高新技术的科学基础。现代物理学的众多分支学科，例如原子和分子物理、原子核和粒子物理、凝聚态物理、材料物理、化学物理、生物物理、天体物理、量子信息和量子计算等等，都离不开量子力学。近年来，随着实验技术和探测手段的不断进步，出现了一系列宏观尺度上的新奇量子现象，例如超导、超流、量子霍尔效应、高温超导、玻色-爱因斯坦凝聚、拓扑绝缘体等，大大拓宽了量子力学的应用范围，也加深了人们对于量子力学的认识。同时，对“基本”粒子世界的研究、对量子信息学的研究、对量子纠缠的本质的研究等等，也给量子力学提出了许多有待回答的新问题。所以，量子力学是一门仍然在不断地发展，与时俱进的科学。《量子力学》MOOC课程分两个学期开设，一般在秋季学期开《量子力学（上）》，春季学期开《量子力学（下）》。主要是在分析实验现象的基础上，利用推理论证和解析推导的方法，阐释量子力学的基本原理和基本概念，发展量子力学处理实际物理问题的基本方法，以求正确地认识和描写微观世界。这个MOOC课程将把《量子力学》的内容分解成以20分钟左右的视频为单元的一系列片段，每个片段包含一个或两个基本知识点。在学习过程中，请注意各个知识点之间的相互联系。考虑到选课同学的基础和目标不同，这个MOOC课程的内容分为两类：基本内容（不带星号）和提高拓展内容（用星号表示）。物理专业的同学要求掌握全部的内容，物理专业以外的同学可以只学基本内容。当然，非物理专业的学生学一点提高拓展的内容，也是有益无害的事情。",
    "C_course-v1:TsinghuaX+20250103X+sp": "本课程是电子技术基础的两大分支之一，属于入门性质的技术基础课。课程的主要内容为电子器件、电子电路的基本原理、数字电路的分析和设计方法，以及在实际中的典型应用等。清华大学“数字电子技术基础”课程的知识点包括逻辑代数基础、门电路、组合逻辑电路、时序逻辑电路、脉冲波形的产生与整形、半导体存储器、可编程逻辑器件，以及数/模和模/数间的转换电路等。课程的基本要求是熟练掌握电子技术方面的基本理论、基本知识和基本技能，培养具有分析问题和解决问题的能力，为深入学习电子技术及其在专业领域中的应用打好基础。",
    "C_course-v1:TsinghuaX+60240202X+sp": "面向信息科学技术类研究生或高年级本科生，主要由业界一线研发人员讲授大数据平台涉及到的分布式系统构架、分布式编程、分布式流处理、分布式数据存储管理、内存计算支持等内容，通过实践，力图覆盖大数据处理平台的主要核心技术，帮助学生了解分布式大数据平台设计中的关键挑战，提出实际的解决方案，为研究生未来研究方向提供参考。课程重点讲解设计原理，突出技术深度和实战性。【参考资料】李妹芳，《ODPS权威指南》。本书是学习和掌握ODPS的权威指南，作者来自阿里ODPS团队。全书共13章，主要内容包括：ODPS入门、整体架构、数据通道、MapReduce编程、SQL查询分析、安全，以及基于真实数据的各种场景分析实战。本书基于很多范例解析，通过在各种应用场景下的示例来说明如何通过ODPS完成各种需求，以期引导读者从零开始轻松掌握和使用ODPS。同时，本书不局限于示例分析，也致力于提供更多关于大数据处理的编程思想和经验分享。书中所有示例代码都可以在作者提供的网站上免费下载。这本书对平台架构介绍不多，偏应用方面，但对了解阿里的大数据平台能够做什么可能有些帮助。",
    "C_course-v1:TsinghuaX+10421094X_2015_2+sp": "线性代数是现代数学的基础之一，在物理、计算机图形学、工程、经济学等自然科学和社会科学各领域具有广泛和深刻的应用，同时线性代数是高等学校理工科各专业的一门重要基础课。本课程做为清华大学非数学理工科各专业学生重要的必修课程，介绍求解线性方程组、矩阵理论、向量空间和线性变换等线性代数的基本概念和基本理论，强调线性代数的理论与应用的结合。线性代数（1）围绕求解线性方程组，介绍高斯消元法、矩阵的性质运算和分解、向量空间、正交投影与最小二乘法、行列式的性质与计算、特征值特征向量与矩阵对角化、实对称矩阵的性质等基本知识点及其应用。通过本课程的学习，培养学生的数学逻辑思维和抽象思维能力，使学生具备线性代数的基本理论知识，熟练掌握求解线性方程组和矩阵运算、矩阵分解的基本方法，掌握英文数学术语和表达规范，为后继的学习和提高奠定数学基础。",
    "C_course-v1:TsinghuaX+80150193X+sp": "汽车碰撞安全性设计和分析是汽车工程设计中的一个重要部分。汽车产品具有良好的碰撞安全性能，不仅是法规和市场准入的基本要求，也是竞争市场的重要途径。减少道路交通事故伤亡具有重要的社会和经济意义。汽车碰撞安全技术是核心技术，具有综合性和挑战性。本课程系统介绍汽车碰撞安全的基本原理、设计理念和方法以及相关的前沿技术。本课程的英文版获得“清华大学精品课程”称号，并入选教育部来华留学英语授课品牌课程。课程主要内容包括：第一单元 碰撞响应及碰撞性能评价第1讲：绪论 – 汽车碰撞安全的基本面第2讲：汽车前碰撞结构响应与乘员乘降 – 汽车碰撞安全最基础的理论知识第3讲：汽车碰撞事故中的人体碰撞响应与损伤 – 碰撞保护设计的出发点第4讲：汽车碰撞安全性评价方法 – 汽车碰撞安全性能的考卷第二单元 乘员约束系统第5讲：汽车座椅安全带与气囊 – 有效的碰撞安全保护装置第6讲：作为碰撞保护装置的汽车座椅 – 碰撞保护的支撑基础置第7讲：儿童乘员碰撞保护 – 不难理解的特殊性第8讲：自适应乘员约束系统 – 针对个体和碰撞工况差异性的保护第三单元 汽车结构与乘员载荷高度关联的工况第9讲：汽车侧面碰撞保护 – 有限空间和时间内的资源优化第10讲：乘员头碰撞保护 – 基于力学模型和分析的设计创新案例第11讲：行人碰撞保护 –  协调造型、总布置和车身结构的设计第四单元 冲击载荷下结构和材料的设计与分析第12讲：汽车结构件的碰撞力学设计和分析 – 比拼力学功底第13讲：汽车材料的冲击力学行为表征和仿真– 保证仿真结果可靠性的基础第14讲：汽车轻量化和小型化与碰撞安全性 – 个体和整体的博弈与平衡第15讲：小型电动车与电池的碰撞安全研究 –研究案例",
    "C_course-v1:TsinghuaX+30670043X+sp": "传播学是一门探索和揭示人类传播的本质和规律的科学。也是传播研究者在最近几十年对人类传播现象和传播研究成果进行系统分析和有机整合而发展成的知识体系。它包括对传播活动的描述、对传播关系的分析、对传播行为的约定、对传播难题的探讨。与社会学、心理学、政治学等相比较，传播学是一门位于诸多学科交叉地带的具有一定应用性的新兴独立学科。",
    "C_course-v1:TsinghuaX+30150303X+sp": "汽车造型设计是一门日趋成熟的学科，想要做好汽车造型设计需要的不单单是良好的美感和丰富的想象力，更重要的是系统的学习和刻苦的训练——其中二维表达是每个设计师最基础也最重要的基本技能。本课程将从汽车的基本比例讲起，通过透视、光影与材质、画法的讲解与训练，让你从零开始快速掌握汽车手绘——当然要想画的出色还需要课下更加刻苦的训练。",
    "C_course-v1:AdelaideX+Wine101x+sp": "回想一下您最喜爱的葡萄酒。想象那呈现于杯中的光亮色泽，散发于鼻间的成熟果香，萦绕于上腭的淡淡烤木和回味无穷的单宁。也许您钟意某一款葡萄酒，却道不出其中的原由。专业的葡萄栽培师和酿酒师缔造了那些令人愉悦的美酒品质，他们以科学为指引——确切的说，是以葡萄栽培学和葡萄酿造学为基础，在葡萄园和酿酒厂精心栽培、潜心酿造。细节之处需要多年才能学习掌握，而在几周之内，本课程可以让您大致了解葡萄栽培和葡萄酒酿造的原理与操作方法，及其对于葡萄酒外观、香气、风味和口感产生的影响。同时，您也将进一步了解尖端研究是如何帮助确保未来全球葡萄酒业的可持续性发展。无论您是一位葡萄酒新手还是经验丰富的葡萄酒行家——只要您热爱葡萄酒，喜欢品尝葡萄酒，这门课都是专属于您的。您将学习如何栽培葡萄以及如何酿造葡萄酒。您甚至可以酿造自己的葡萄酒（实际最低目标）！你将学到什么： 运用专业性描述语言评价交流葡萄酒的各种感官品质。 解释葡萄树的结构和生长发育过程，以及各种葡萄园管理实践的目标。 比较在生产不同品种的葡萄酒过程中采用的不同酿酒技术。",
    "C_course-v1:WellesleyX+HIST229x+sp": "亚历山大大帝征服了古希腊人所知的大部分世界，将他的帝国中的东西地区，不同种族的人民都融为一体，像神一般——这一切都在他33岁之前。本课程将介绍他的生活、领导力和这位勇士史诗般的传奇经历。这位最受争议的领袖、难以捉摸的天才的故事，不仅可以帮我们以及了解战争的历史，还能帮助我们了解人类性学、东西方关系的历史，以及古老的多神教徒和现代一神教宗教理念的不同观点。",
    "C_course-v1:MITx+6_00_1x+sp": "本课程是两部分课程的上半部分：即 计算机科学和 Python 编程导论及计算思维和数据科学导论。两部分课程旨在帮助以前从未接触过计算机科学或编程的人们学会计算思维、编写程序解决问题。学习了两部分课程的部分学生会将其作为进修高级计算机科学课程的基础，但是大部分是将其作为第一门也是最后一门计算机科学课程。 因为这些课程对很多学生而言，可能是其唯一的正式计算机科学课程，我们更关注的是知识的宽度而不是深度。目标是帮助学生简要了解更多内容，以便他们在以后事业发展过程中需要考虑如何用计算法完成某些目标时，能有些许概念。也就是说，这并非是一门“精深计算法”课程。这些具有挑战性且严格的课程内容是要求学生们花费大量时间和精力学会让计算机按照自己的意愿工作。 计算机科学导论和Python 编程导论包括计算概念、Python 编程语言、部分简单算法、测试和调试、算法复杂性、部分简单算法和数据结构的非正式导论。",
    "C_course-v1:MITx+15_390_2x+sp": "不要在意你的客户能为你做什么——而是要关注你能为你的客户做些什么。在《创业101》中，我们已经学会站在客户的立场去观察这个世界——这是一个非常棒的视角！但我们的课程远未结束。目的地就在眼前，虽然近在咫尺，但我们还要继续学习。创造出一个能满足客户需求的伟大产品和找到目标客户同样重要。然而客户如何获得你的产品呢？产品又是如何满足客户需求的呢？你的产品将为客户带来哪些价值？你的秘诀又是什么？面的市场竞争你会如何积累优势？在中小企业市场营销、城市设计、语言教育、医疗以及企业支持服务这些形态各异的领域中，我们将利用深度的案例研究来探讨它们是如何构建产品概念、满足客户需求、树立明确的价值定位并从中提炼出商业秘诀，理解它们之间的竞争。课程还要继续。你准备好了吗？客户在等我们呢。",
    "C_course-v1:WUT+WUT2016003+2016_T2": "这门课通过三个案例的比较研究，发掘出设计学内在而普遍的结构和机制，作为学习者展开设计研究与实践的基础和依据。借助于本课程总结出的设计系统的一般结构与机制，学习者可以清楚的区分设计系统中一般结构的基本要素、总结出更多的设计规律和原理、制定行之有效且多元化的研究和实践方案。这门课程虽然是一门研究生课程，但是学习者不需要具备特殊的设计理论基础，相反由于它是一门人文学科原理的研究，课程所采用的研究方法和最终总结能够为学习者研究出其它原理提供帮助。 ",
    "C_course-v1:TsinghuaX+THESIS2016X_tv+2016_T1": "学位论文答辩环节是研究生培养的重要环节，为了充分发挥该环节的育人作用，搭建学术交流的平台，进一步保障和提高研究生培养质量，清华大学研究生院从2014年开始，从申请学位的博士、硕士研究生中选取了部分具有代表性的学位论文答辩进行录像，并首次将答辩视频上传学堂在线，获得了社会各界的认可和积极反响。2015年，清华大学将继续这一形式，遴选不同专业的博士、硕士研究生的学位论文答辩视频，继续以MOOC形式共享呈现给大家，以使更多的人能够分享这些资源，搭建更为广阔的学术交流平台。如果这些视频能对您的学术研究有所帮助和启发，则是我们十分期待并愿意看到的事。",
    "C_course-v1:TsinghuaX+30140393X+sp": "许多工程领域的学生对于燃烧和燃烧应用有着浓厚的兴趣。本课程提供一个学期的学习内容，共分十二讲，除第一讲引言外，其余课程分为二个大的部分：第一部分介绍燃烧所涉及的各种科学基础，包含6讲；第二部分介绍各种典型燃烧火焰的建模和实际应用的燃烧装置，包含5讲。第一讲定义了燃烧和火焰的种类，同时特别介绍了燃烧学的研究方法，引入了各种燃烧现象。燃烧学习所需的热化学知识在第二讲中引入。第三讲引入了燃烧过程最重要的传质现象，浓度梯度引起的表面蒸发和相变引起的斯蒂芬流现象的分析。第四、第五讲主要是提供化学动力学方面的内容，其中第四讲中引入最基本的概念，第五讲中引入燃烧中最重要的化学动力学反应。第六讲主要讲解如何将化学动力学与热力学进行融合，引入了定压、定容、均匀搅拌和塞状流四种典型的燃烧反应器模型。第七讲是反应流的简化守恒方程，这构成了后半部分的研究基础。第八讲到第十二讲介绍各种实际火焰的建模与分析处理方法。第八讲引入层流预混火焰，第九讲引入层流非预混火焰，这两章提供了分析所有火焰现象的基础。第十讲专门介绍液滴蒸发与燃烧的分析方法。第十一讲中引入了固体燃料的燃烧，其中最基础的是碳的燃烧。第十二讲简单介绍湍流燃烧的基本知识。",
    "C_course-v1:TsinghuaX+30240184+sp": "数据结构是计算机科学的关键内容，也是构建高效算法的必要基础。其中涉及的知识，在相关专业的课程系统中始终处于核心位置。本课程旨在围绕各类数据结构的设计与实现，揭示其中的规律原理与方法技巧；同时针对算法设计及其性能分析，使学生了解并掌握主要的套路与手段。讲授的主题从基础的数据结构，一直延伸至新近的研究成果。",
    "C_course-v1:TsinghuaX+70167012X+sp": "生活中各式各样的产品与服务给我们带来了丰富多彩的用户体验，也蕴含着有趣的社会文化规律。优秀的用户体验设计需要以人为中心，全面考虑人的需求、能力以及文化背景等因素。以用户为中心的设计方法不仅是对设计师的要求，也是产品管理、开发人员必需的专业素养，本课程希望帮助产品开发或设计人员建立独立的评判视角和分析思路。人因学的理论知识是“以用户为中心的设计和评估”方法的基础，本课程将围绕这个中心，从具体的设计案例开始讲授，逐步深入至最新的科研成果，引导学生由浅入深地学习用户研究，任务分析，交互界面评估，跨文化设计，用户体验设计，人与机器人交互设计，以及前沿的医疗与人因研究专题等内容。",
    "C_course-v1:BJUT+2140074001x+sp": "“高级数据库技术”是计算机科学与技术专业研究生专业选修课，本课程的目的是向研究生介绍数据库管理系统（DBMS）在实现时采用的基础理论和基本技术，包括数据的组织与存储方法，数据的检索方法，数据的并发控制，数据库系统的恢复技术以及分布式数据库系统的相关技术。通过课堂教学与实践，让学生理解传统关系型数据库管理数据的技术本质，并培养其面对数据库领域的新发展而进行分析问题和解决问题的能力，从而为其进行数据库管理领域的深入研究、或从事数据领域的高级管理工作奠定基础。",
    "C_course-v1:TsinghuaX+30240184_2X+sp": "数据结构是计算机科学的关键内容，也是构建高效算法的必要基础。其中涉及的知识，在相关专业的课程系统中始终处于核心位置。本课程旨在围绕各类数据结构的设计与实现，揭示其中的规律原理与方法技巧；同时针对算法设计及其性能分析，使学生了解并掌握主要的套路与手段。讲授的主题从基础的数据结构，一直延伸至新近的研究成果。",
    "C_course-v1:TsinghuaX+30240243X+sp": "操作系统是计算机系统中负责管理各种软硬件资源的核心系统软件，为应用软件运行提供良好的环境。掌握操作系统的基本原理及其核心技术是研究型大学计算机专业本科毕业生的基本要求。本课程是计算机专业核心课，以主流操作系统为实例，以教学操作系统ucore为实验环境，讲授操作系统的概念、基本原理和实现技术，为学生从事操作系统软件研究和开发，以及充分利用操作系统功能进行应用软件研究和开发打下扎实的基础。",
    "C_course-v1:TsinghuaX+80000822X+sp": "我国老年人口正以每年递增1000万的速度飞快增长，居住空间与环境的适老化、精细化设计不仅仅是规划建筑专业人员的必备技能，更是老龄社会中每个人应当了解的基本知识。课程将从以下这些问题切入，深入浅出地讲解适老居住空间与环境营造的方方面面：我国人口老龄化现状与养老居住政策是怎样的？养老产业与养老地产的发展现状及趋势是什么？国外在积极应对老龄化问题上有哪些先进经验？该怎样通过规划、建筑设计手段建造人性化的老年设施及社区环境 。如何改造、装修老年住宅为身边逐渐老去的Ta营造一个舒适安心的家？无论你是设计师、养老行业工作者、还是家有老人的普通人，相信通过本门课程的学习，你都将对老龄化问题有更深的认识，掌握营造适老居住空间与环境的原理和方法，学会为自己家中的老人营造更加美好的居住空间，从而领悟“源于生活、高于生活”的居住学问。",
    "C_course-v1:BSU+BSU001+sp": "本课程将全面系统地展示冬季奥林匹克运动从历史渊源直至现代发展的优美画卷，从中感受到冬奥会的丰富内涵和独特魅力。",
    "C_course-v1:TsinghuaX+40050455X+sp": "《水处理工程》是环境工程、环境科学、市政工程等相关专业的主干专业课。本课程旨在向学生全面讲授水和废水处理中主要的生物处理技术单元的基本原理和特点、工艺的基本计算方法和应用范围、主要构筑物的构成和运行特点、典型的水与废水处理工艺以及相关技术的国内外最新研究进展。主要讲述废水的好氧和厌氧生物处理工艺、生物脱氮除磷工艺、废水的天然处理工艺以及污泥的处理与处置。",
    "C_course-v1:MITx+6_002x+sp": "The course introduces engineering in the context of the lumped circuit abstraction. Topics covered include: resistive elements and networks; independent and dependent sources; switches and MOS transistors; digital abstraction; amplifiers; energy storage elements; dynamics of first- and second-order networks; design in the time and frequency domains; and analog and digital circuits and applications. Design and lab exercises are also significant components of the course. The course is organized by weeks. To keep pace with the clas",
    "C_course-v1:TsinghuaX+60240013X+sp": "组合数学是计算机出现以后迅速发展起来的一门数学分支,主要研究离散对象的存在、计数以及构造等方面问题。由于计算机软件的促进和需求，组合数学已成为一门既广博又深奥的学科，其发展奠定了本世纪的计算机革命的基础，并且改变了传统数学中分析和代数占统治地位的局面。本课程从排列组合的基本概念出发，系统介绍了有关组合计数的理论和方法，主要内容包括计数的基本法则、母函数与递推关系、鸽巢原理和容斥原理、波利亚计数定理。这虽然是一门研究生课程，但是学习者只需要具备初等的数理知识就可以开始学习。我们将从基础的排列组合开始，逐步深入了解计数问题的不同解决思路，通过对现实生活中计数问题的演绎和学生们共同体会组合计数问题不断抽象深入的挖掘过程，引导学生共同感受数学知识的精妙，从而深入理解组合数学对计算机理论发展的推动作用。",
    "C_course-v1:TsinghuaX+00740113_2X+sp": "本课程应用Visual C++环境，介绍面向对象与可视化程序设计的基本思想与方法。课程中对每一部分的知识点、概念、难点，都力求以较精炼的语言进行讲解，同时，对每一个知识点都配以必要的应用实例，并配以较为详细的代码，以案例驱动的方式帮助读者较好地掌握“面向对象与可视化程序设计”的思路和开发技巧，重点掌握“事件驱动消息响应”的机制。本课程内容主要包括Windows编程基础和MFC编程基础。其中Windows编程包括几何图形绘制、文本输入/输出、键盘与鼠标的应用以及资源的应用等基础知识；MFC可视化编程部分主要包括MFC库的基本知识、各种类在编程中的应用、各种控件的应用、利用Visual C++的资源编辑器编写资源文件及其应用以及单文档与多文档的操作等知识点，此外还介绍了数据库编程等实用技术。",
    "C_course-v1:UC_BerkeleyX+CS_184_1x+sp": "CS184.1x 教授计算机图形学基础。学生通过本课程将学会制作实时和离线光线追踪3D场景的图像。本课程为期8周，共分为4个部分，每个部分都包括一个需要个人独立完成的编程作业：综述和基础数学 (作业 0：总成绩的 10%)变换 (作业1：总成绩的 20%)OpenGL 和照明 (作业 2：总成绩的 35%)光线追踪 (作业 3：总成绩的 35%)本学期获得总成绩 50% 及以上的同学就可以通过该课程。",
    "C_course-v1:TsinghuaX+TsinghuaMandarin01+sp": "本课程包含汉语入门（英文授课）部分和汉语教学设计（中文授课）部分，适合汉语初学者及对汉语教学感兴趣的学习者。你也可以利用课程的英文内容来提高自己的英语水平。课程从一个外国男生Peter的故事开始，30年前，他的爸爸来到中国，在清华大学学习中国建筑；30年后，Peter也来到中国，决定学习汉语。让我们跟随Peter的视角，来了解外国人是怎么样学汉语的？汉语教学真的很简单吗？怎么样教外国人拼音？怎么样解释“又”和“再”的区别？如何自己设计一门汉语入门课程？来自清华大学对外汉语文化教学中心的几位教授会给你答案。这门课也同时在全球最知名的MOOC网站之一edX上线，欢迎推荐给你的外国朋友、老师或者学生！",
    "C_course-v1:TsinghuaX+80590952X+sp": "本课程2004年起就在清华大学开设，主要面向清华研究生及本科生教学。课程将充分利用现代教学手段，让多学科背景的学习者能初步系统了解和共同研究公共危机的特点、形态、成因和后果及发生发展机理，并深入研究以政府为主的现代公共组织应对危机的有关理念、制度、干预战略策略和方式方法等。特别是通过学习，能增强危机与风险意识、熟练运用风险分析、快速决策、危机沟通与组织协调等方面的专业知识与技能来有效分析、预防与应对各类危机，从而切实提高公共危机管理的研究能力与实践能力，推动公共组织与整个社会健康有序发展。主要内容：第一讲：中国危机形态分析；第二讲：危机与危机管理要义；第三讲：中国危机管理演化；第四讲：风险评估与危机治理；第五讲：社会冲突与危机谈判；第六讲：危机决策与领导力；第七讲：危机协调与组织学习；第八讲：危机沟通与新媒体；第九讲：传统文化与危机管理；第十讲：中国城市危机管理。",
    "C_course-v1:TsinghuaX+00740113_1X+sp": "本课程应用Visual C++环境，介绍面向对象与可视化程序设计的基本思想与方法。课程中对每一部分的知识点、概念、难点，都力求以较精炼的语言进行讲解，同时，对每一个知识点都配以必要的应用实例，并配以较为详细的代码，以案例驱动的方式帮助读者较好地掌握“面向对象与可视化程序设计”的思路和开发技巧，重点掌握“事件驱动消息响应”的机制。本课程内容主要包括Windows编程基础和MFC编程基础。其中Windows编程包括几何图形绘制、文本输入/输出、键盘与鼠标的应用以及资源的应用等基础知识；MFC可视化编程部分主要包括MFC库的基本知识、各种类在编程中的应用、各种控件的应用、利用Visual C++的资源编辑器编写资源文件及其应用以及单文档与多文档的操作等知识点，此外还介绍了数据库编程等实用技术。",
    "C_course-v1:UQx+BIOIMG101x+sp": "在发达经济体中，成像技术占据了健康预算中的相当大的比例；对大部分人而言，高级成像技术是有生之年中不可或缺的。但是，我们很多情况下都是受到电视剧的误导，它们要么夸大其优点，要么过度突出其风险。本课程对生物医学成像及现代成像技术进行介绍。本课程也涵盖每种技术背后的基本科学原理，介绍关键应用场景，从神经系统疾病到癌症都有涉及。本课程包括特别为普通大众设计的模块，也有针对健康、工程和IT专业人士的高级模块。",
    "C_course-v1:UQx+TROPIC101x+sp": "你是否想要学习保护热带海岸线生态系统的相关技能和知识？这些栖息地为数以亿计的人们提供了产品和服务，可是人类的活动却导致它们在全球范围内的衰落。TROPIC101x 课程将向你介绍组成这些独特生态系统的动植物，还将探究这些生态系统所面临的挑战——过度捕捞、沿岸污染、海洋变暖和酸化。课程将由世界顶级专家讲授。你将有机会成为民间高手，并参加虚拟生态项目。课程内容由昆士兰大学苍鹭岛研究工作站特别开发制作。请加入这次精彩之旅，你将会在这次新颖别致、引人入胜的课程中学习新的知识和技能！",
    "C_course-v1:TsinghuaX+20120143X+sp": "工程制图是清华大学的核心技术基础课，在工程学科人才培养体系中占有重要地位，具有优良传统和深厚积淀。课程以现代工程应用为背景，旨在使学生掌握工程设计表达的基础知识和基本技能，是学习工程科学与技术的入门课程，也是培养空间想象能力和创新思维能力的重要载体，是学生认识工程、走进工程的桥梁。课程内容包括：点、线、面、基本体的投影规律及作图方法，轴测图及计算机辅助二维绘图和三维建模，复杂形体（截切体、相贯体、组合体）的构建及三视图，工程制图相关的国家标准，工程中常用的表达方法（多视图、剖视图、断面图、尺寸标注），标准件、常用件、零件图、装配图的绘制及相关技术要求。在投影理论的基础上，将二维视图、轴测草图、三维实体模型等典型构思及表达方法有机地结合在一起，将徒手绘图、仪器绘图与计算机绘图结合在一起，以图形表达为核心、形象思维为主线，培养学生工程设计表达的基本能力和基本素质。",
    "C_course-v1:TsinghuaX+70150023X+sp": "汽车理论课程是车辆工程和汽车工程专业同学的必修课，也可以为汽车行业人员深入了解汽车提供必备的知识。汽车理论采用动力学的方法探讨汽车性能如何评价，建立汽车性能与汽车结构参数的关系并且研究如何提高汽车动力学性能。汽车理论MOOC课程包括六章的内容：第一章，汽车的动力性；第二章，汽车的燃油经济性；第三章，汽车动力装置参数的选定；第四章，汽车的制动性；第五章，汽车的操纵稳定性；第六章，汽车的平顺性。每一章基本上都从该性能如何评价开始，之后建立性能评价指标与汽车结构参数的关系，探讨影响性能指标的主要因素和改善性能的方法。我们相信，这门课程将引导你对汽车从感性认识上升到理性认识。",
    "C_course-v1:RiceX+AdvENVSCI_1x+sp": "备考AP环境科学考试需要深入了解有关环境科学的众多话题，同时还需熟悉AP考试的题目类型。本课程为AP环境科学考试备考系列课程的第一部分。在第一部分中，你将学习有关生物界的知识，课程主要分为六周进行授课，第一周和第二周学习关于环境科学的简介，包括环境问题、环境历史和、物质和能量；第三周、第四周、第五周将学习生物界的相关内容，包括生态系统、进化论与生物多样性、生物群落与气候、水生态系统，此外，每周有一次实验；第六周则是对期末考试的考前复习。课程包含AP环境科学考试专家的授课视频，类似AP考试的选择题和主观题，以及详细的问题解决指导视频。课程结束后，你就可以准备好参加AP考试了！",
    "C_course-v1:TsinghuaX+34100325_X+sp": "本课程从软件生命周期的角度讲解软件工程的基本概念、基本原理和基本方法，内容涉及开发管理、需求建模、设计实现和测试维护等四大部分的相关基础知识，强调软件工程的根本性和永久性原则，诸如可测试性、软件体系结构、模块化和可复用性等，关注软件系统的复杂性问题以及迭代式的开发方法，重视分析问题与解决问题的能力以及软件工程实践训练，培养学生良好的工程化开发习惯。经过本课程的学习，学生能够掌握软件工程的基础知识，从工程学角度认识软件在大型复杂系统中的设计和应用，具备作为软件工程师从事软件开发所需的专业能力。",
    "C_course-v1:TsinghuaX+40050455_2X+sp": "《水处理工程》是清华大学为环境工程、环境科学、市政工程等相关专业学生开设的主干专业课，包括物化处理技术和生化处理技术两大部分。《水处理工程-物化技术》旨在向学生全面讲授水和废水处理中主要的物化处理技术单元的基本原理和特点、工艺的基本计算方法和应用范围、主要构筑物的构成和运行特点、典型的水与废水处理工艺以及相关技术的国内外最新研究进展。本课程介绍的主要物化技术单元包括：混凝、沉淀与澄清、气浮、过滤、消毒、离子交换、膜分离、氧化还原和吸附。",
    "C_course-v1:RiceX+BIOC372_1x+sp": "当你生病的时候，你可能会感到奇怪，“为什么是我呢？”，但是真正的问题应该是“为什么我不会一直生病呢？”，你可能还会问“为什么我的身体会发烧，降烧是否是一个好办法呢？”本课程研究的是免疫学，也就是人体如何抵制来自寄生虫和致病菌的持续攻击。本课程将介绍先天性和适应性免疫力，重点介绍细胞和器官间的功能互动。我们将涉及信号传导、致病菌识别和髓细胞、淋巴细胞和支持细胞的分工。主旨是向卫生健康专业人员和生物医学研究人员介绍基础术语和概念，以便理解临床新闻稿和重要文献。课程资料也对其他免疫学指导教师提供支持，使用类比和模型，用创造性的方式呈现难点概念。本课程一共有两部分，这是第Ⅰ部分。",
    "C_course-v1:RiceX+BIOC372_2x+sp": "这是两部分课程的第二部分。在第一部分课程中，我们学到了先天性免疫力和B细胞功能。第二部分课程包括T细胞功能和免疫反应的协调。当你生病的时候，你可能会感到奇怪，“为什么是我呢？”，但是真正的问题应该是“为什么我不会一直生病呢？”，你可能还会问“为什么我的身体会发烧，降烧是否是个好办法呢？”本课程研究的是免疫学，也就是人体如何抵制来自寄生虫和致病菌的持续攻击。本课程经介绍先天性和适应性免疫力，重点介绍细胞和器官间的功能互动。我们将涉及信号传导、致病菌识别和髓细胞、淋巴细胞和支持细胞的分工。主旨是向卫生健康专业人员和生物医学研究人员介绍基础术语和概念，以便理解临床新闻稿和重要文献。课程资料也对其他免疫学指导教师提供支持，使用类比和模型，用创造性的方式呈现难点概念。",
    "C_course-v1:RiceX+AdvBIO_1x+sp": "备考AP生物学考试需要深入了解有关生物学的相关话题，同时还需熟悉AP考试的题目类型。本课程为备考AP生物学考试系列课程的第一部分。第一部分中，你将学习有关细胞的知识，包括它的结构和功能。你还将学习驱动每日细胞生化反应的化学物质。课程包含AP生物学考试专家的授课视频，类似AP考试的选择题和主观题，以及详细的问题解决指导视频。课程结束后，你就可以准备好参加AP考试了！",
    "C_course-v1:RiceX+AdvBIO_2x+sp": "备考AP生物学考试需要深入了解有关生物学的相关话题，同时还需熟悉AP考试的题目类型。本课程为备考AP生物学考试系列课程的第二部分。第二部分中，你将从分子水平及生物水平探索世代之间遗传信息传递的机制，并学习DNA控制生命的原理。课程包含AP生物学考试专家的授课视频，类似AP考试的选择题和主观题，以及详细的问题解决指导视频。课程结束后，你就可以准备参加AP考试了！",
    "C_course-v1:TsinghuaX+30040323X+sp": "《水力学》是水利、土木、环境、建筑和工程物理等相关专业的技术基础课，它以水为主要对象研究流体运动的规律以及流体与边界的相互作用。本课程的主要任务是培养学生在三个方面的知识与能力：(1) 掌握水力学基本概念和基本理论；(2) 培养创新意识和科学素养；(3) 培养分析和解决工程实际中水力学问题的能力和实验技能。课程内容包括：基础部分、专题部分和实验部分。基础部分：1.流体的物理力学性质；2.静力学；3.运动学；4.动力学基础；5.量纲分析和相似理论；6.流动阻力和能量损失。专题部分：1.有旋流动和有势流动；2.边界层理论基础与绕流运动；3.孔口、管嘴出流有压管流。实验部分：包括常规教学实验和设计型（创新）实验。",
    "C_course-v1:RiceX+AdvBIO_3x+sp": "备考AP生物学考试需要深入了解有关生物学的相关话题，同时还需熟悉AP考试的题目类型。本课程为备考AP生物学考试系列课程的第一部分。在第三部分的学习中，你会发现进化过程驱动着生命的多样性和统一性。你将了解，一直以来，基因如何促成人口的变化，以及这些变化如何进化并创造多样性。课程包含AP生物学考试专家的授课视频，类似AP考试的选择题和主观题，以及详细的问题解决指导视频。课程结束后，你就可以准备好参加AP考试了！你能学到什么： 对美国大学先修课程生物学考试的备考 了解进化，知道它对人口意味着什么，以及其它如何造成我们所看到的地球上生物的多样性 了解进化过程驱动生物多样性 了解生态系统的相互作用 参与研究性实验的调查和讨论",
    "C_course-v1:edX+BlendedX+sp": "我们不断探索，以求将教育科技融入传统课堂，力图优化教学效果。教师以及热衷于建立混合式学习体验的教育带头人，edX是你们的不二之选。教育科技正在迅猛发展，为教育工作者提供了一个去重新思考教育并优化教学实践的机会。混合式学习的概念为教育工作者提供了一个框架，帮助他们将在线教育技术有针对性地融入面对面的传统课堂中。事实证明若运用得当，混合式教育会成为提高学生参与度，优化学习效果的有力措施。在本课程中，你将了解混合式学习的原则和实践方法。课程将介绍创建混合式学习体验的优势及挑战，讨论如何设计并运营一门出色的混合式课程，并针对edX内容在课堂中的运用，提供具体的策略及实例。课程会向大家展示有关混合式学习的丰富事例，列举一些使用混合式学习的机构组织，分享世界范围内的教职人员与混合式学习的故事。此外，本课还引用了有关混合式学习模式的调查以及其影响作为参考。",
    "C_course-v1:RiceX+AdvBIO_4x+sp": "备考AP生物学考试需要深入了解有关生物学的相关话题，同时还需熟悉AP考试的题目类型。本课程为备考AP生物学考试系列课程的第一部分。第四部分中，你将学习生态学知识、生物之间的依赖和互动方式、生物和环境的互动关系和竞争关系。课程包含AP生物学考试专家的授课视频，类似AP考试的选择题和主观题，以及详细的问题解决指导视频。课程结束后，你就可以准备好参加AP考试了！你能学到什么： AP生物学考试准备 人口、社区、生态系统生物学知识 生物系统如何互相作用 生物系统如何储存、提取、传输、回应信息 参与研究性实验的调查和讨论",
    "C_course-v1:TsinghuaX+20430064_2X+sp": "量子力学是近代和现代物理学的理论基础，也是许多现代高新技术的科学基础。现代物理学的众多分支学科，例如原子和分子物理、原子核和粒子物理、凝聚态物理、材料物理、化学物理、生物物理、天体物理、量子信息和量子计算等等，都离不开量子力学。近年来，随着实验技术和探测手段的不断进步，出现了一系列宏观尺度上的新奇量子现象，例如超导、超流、量子霍尔效应、高温超导、玻色-爱因斯坦凝聚、拓扑绝缘体等，大大拓宽了量子力学的应用范围，也加深了人们对于量子力学的认识。同时，对“基本”粒子世界的研究、对量子信息学的研究、对量子纠缠的本质的研究等等，也给量子力学提出了许多有待回答的新问题。所以，量子力学是一门仍然在不断地发展，与时俱进的科学。本课程主要是在分析实验现象的基础上，利用推理论证和解析推导的方法，阐释量子力学的基本原理和基本概念，发展量子力学处理实际物理问题的基本方法，以求正确地认识和描写微观世界。这个MOOC课程将把《量子力学》的内容分解成以20分钟左右的视频为单元的一系列片段，每个片段包含一个或两个基本知识点。在学习过程中，请注意各个知识点之间的相互联系。考虑到选课同学的基础和目标不同，这个MOOC课程的内容分为两类：基本内容（不带星号）和提高拓展内容（用星号表示）。物理专业的同学要求掌握全部的内容，物理专业以外的同学可以只学基本内容。当然，非物理专业的学生学一点提高拓展的内容，也是有益无害的事情。",
    "C_course-v1:RiceX+AdvENVSCI_2x+sp": "备考AP环境科学考试需要深入了解有关环境科学的相关话题，同时还需熟悉AP考试的题目类型。本课程为AP环境科学考试备考系列课程的第二部分。在第二部分，您将了解居住在地球上的人口。了解人口动态，人口与可持续发展。也会研究土地和用水。课程包含AP环境科学考试专家的授课视频，类似AP考试的选择题和主观题，以及详细的问题解决指导视频。系列课程结束后，你就可以参加AP考试了！",
    "C_course-v1:RiceX+AdvENVSCI_3x+sp": "备考AP环境科学考试需要深入了解有关环境科学的相关话题，同时还需熟悉AP考试的题目类型。本课程为AP环境科学考试备考系列课程的第三部分。在第三部分，你将了解到污染和地球上的资源。你将了解地球面临的几种污染问题，资源的情况和它们如何影响着地球和人类。课程包含AP环境科学考试专家的授课视频，类似AP考试的选择题和主观题，以及详细的问题解决指导视频。系列课程结束后，你就可以参加AP考试了！",
    "C_course-v1:Tsinghua+20150001+sp": "你在为发表论文发愁吗？你知道写作一篇科研论文应从何开始吗？从文章题目，关键词，一直到结论，文献，该如何正确的组织文章结构？期刊主编都看重什么？文章发表后如何获得关注以及如何推广你的文章？学术出版道德相关的基本原则是什么？学术出版中都有哪些“雷区”?本课程邀请到清华名师以及Elsevier出版人，为你讲述论文写作的原理，内容架构，技巧及学术伦理道德，并邀请优秀学生分享他们发表论文的宝贵经验，帮助你更有效的写作和发表学术论文。",
    "C_course-v1:UQx+Crime101x+sp": "课程从心理学的角度系统地研究了法律和司法制度的有效性。通过亲身参与一个虚构的案件，同学们将学到法律心理学，以及一些常见的人们对刑事司法所持有的错误观念。",
    "C_course-v1:TsinghuaX+00040132X+sp": "宝玉石的基本概念、属性、分类和地质成因，人类宝玉石文化的历史。宝玉石的自然特性：颜色，光泽、透明度、色散、多色性、折射及双折射、特殊光学效应（星光、猫眼、变彩、变色效应等）、硬度、韧性、解理和断口、密度。宝玉石的常规鉴定方法。影响宝石品质（价值）的因素：品种及档次，质量、重量、款式、艺术及工艺。钻石、红宝石、蓝宝石等20几种单晶质宝石的品种、特性、地质产状、产地及有关文化历史。和田玉、翡翠、玛瑙等10几种多晶质宝石（玉石）的品种、特性、地质产状、产地及有关文化历史。琥珀、珊瑚等几种有机宝石的品种、特性、产地及有关文化历史。 ",
    "C_course-v1:RiceX+RELI157x+sp": "什么是宗教？什么是嘻哈文化？它们是一回事吗？两者有什么内在联系？六个星期的学习会让大家了解，其他人对于这些问题的看法，并且还能找到自己需要的渠道来探索这些问题。我们会先讲一些基本假设。最重要的一点是，我们要主动思考嘻哈文化和宗教文化，并努力解决这些关于人生的问题。如：我们是谁？为何生于此？又将归于何处？我们的思想要足够开放，要接受嘻哈语言，因为它反映、探索并解释了这些复杂的宗教性问题。随着这门课程的展开，我们将深入探讨嘻哈文化和宗教的关系。我们将探索嘻哈文化是如何探讨生命并展现人生意义的。主要方式为：（1）讨论说唱音乐的内容和发展历史；（2）考察说唱音乐的宗教意义；（3）探索说唱艺术家的宗教情结；（4）讨论说唱音乐和宗教之间联系的内在含义。我们会特别利用影像资料、读物、音乐、图像、相关故事，并咨询幕后业内人士的观点来实现这一目标。学习这门课程，可以加强理解美国宗教和嘻哈文化的契合点。可以零基础学习。",
    "C_course-v1:TsinghuaX+00740123_X+sp": "课程目标：掌握Java的基础语法、面向对象的程序设计方法；初步了I/O流类库与集合框架；初步了解GUI程序开发方法。",
    "C_course-v1:TsinghuaX+64100033X+SP": "通过本课程学习，了解大数据管理的工具平台、开发环境、基本原理，熟悉典型大数据工具与平台的特性，掌握大数据处理的基本开发方式。在介绍典型系统工具使用的基础上，通过分析其实现原理与设计理论，增强学生大数据工具与平台的应用与开发能力，同时也为有志于继续深入学习大数据专业课程的学生创造基础 。具体课程内容包括：绪论，云计算，文件存储，计算框架，内存计算，NoSQL，流数据处理等。",
    "C_course-v1:TsinghuaX+60610231+2016_T2_SP": "《工程伦理》课程有着广泛的社会需求：先从《华盛顿协议》谈起，1989年来自美国、英国、加拿大、爱尔兰、澳大利亚、新西兰6个国家的民间工程专业团体发起和签署《华盛顿协议》，针对国际本科工程学历资格互认，工程伦理教育被纳入工程专业教育认证的制度体系中，2016年6月2日中国成为国际本科工程学位互认协议《华盛顿协议》的正式会员。再谈“美国注册工程师”    1996年开始，美国注册工程师考试将工程伦理纳入“工程基础”考试范围。美国国家工程院的报告指出，“伦理标准是未来工程师具备的基本素质之一”。最重要的是培养面向未来、面向世界的中国工程师    中国当前的“一带一路”、“中国制造2025”建设，需要有跨文化、全球视野的大量工程师人才，需要工程师具备在不同文化下的工程伦理规范意识。   鉴于此，工程伦理教育受到工程界、教育界和政府相关部门的高度关注，在工程教育中全面推进工程伦理教育成为各界共识，在2015年全国工程专业学位研究生教育指导委员组织清华大学、北京理工大学、北京协和医学院、大连理工大学、浙江大学等多所院校的十几位专家合作编写了《工程伦理》教材同时录制相关的MOOC课程。   该课程不同于传统的工程伦理理论教育，突出强调了工程伦理的实践性。在具体的工程实践中，由于工程活动的复杂性和不确定性，工程师还需要培养良好的工程决策能力，既要把伦理意识和伦理规范具体落实到解决工程实践面临的伦理问题上。由此，工程伦理教育的目标除了培养工程师的工程伦理意识和责任感，引导其掌握工程伦理的基本规范，还需要通过工程伦理教育，提高工程师的工程伦理决策能力，故课程从工程职业伦理和工程实践中的伦理问题两个方面构建课程体系，课程分为“通论”（MOOC课程为《工程职业伦理》）和“分论”（MOOC课程为《工程实践与伦理决策》）两个部分。课程立足于面向中国社会、面向中国现实、面向中国未来。",
    "C_course-v1:JXUST+JXUST2016001+2016_T2": "主要内容：人工智能的定义，树搜索算法，无信息搜索策略，启发式搜索策略，约束满足问题求解，博弈算法，贝叶斯网络，隐马尔可夫模型，卡尔曼滤波器。特色：人工智能课程在学校的讲授时间为32个学时，面对计算机科学与技术硕士研究生，是一门专业必修课。由于人工智能基础理论涉及到智能搜索，推理，机器学习等，是现在信息类研究生各研究方向的必备理论基础，能为学生深入各方向的研究打下良好的基础。其中的思想可以应用于模式识别，图像视频智能分析处理，数据挖掘及各种信息的智能处理应用中。由于课程讲授侧重于算法的描述，所以学生并不会觉得枯燥，在结合编程的实践练习下能很好掌握智能思想。",
    "C_course-v1:NJU+C1026+2016_T2": "本课程有三个特点：第一，强调计算机软硬件协同设计技术，讲授操作系统各个模块的实现方法、策略与算法；第二，从大型软件系统构造的角度看待操作系统的实现，训练学生以折中的方法和方案，综合解决宏观问题的能力；第三，采用工程师的立场，强调操作系统的构造特征，即概念大于理论、技术大于算法、整体先于局部，培养学生综合解决实际问题的能力。",
    "C_course-v1:ZUELX+B0800280+sp": "内部控制与风险管理是重要的管理活动，现代企业内部控制已由单纯规避损失的传统风险管理转向能够创造价值的全面风险管理。有效的内控体系能将企业战略、管理理念、控制要求全面融入公司治理、企业文化、岗位授权、制度规范和操作流程，通过风险分析及应对、缺陷改进等，推动企业管理水平的全面提升。",
    "C_course-v1:NBCC+NBCC000201+_sp": "本课程将从Linux网络管理员的视角出发，由浅入深，循序渐进地围绕着初级Linux网络管理员在日常管理工作中将会遇到的任务场景而展开。课程内容可以汇聚成10个主题，分为初级和中级两部分：其中初级管理主题包括：安装部署Linux系统，管理文件和目录，vi的应用，管理用户和用户组，管理硬盘。中级管理主题包括：流、管道、重定向和脚本初步的运用，软件安装与包管理，进程和服务的管理、配置网络和连接Internet，远程连接主机。",
    "C_course-v1:TsinghuaX+01030132X+sp": "人类没有大学，世界将会怎样？怎样解决问题取决于怎样提出问题。这个规律尤其适合我们探索大学的本质、起源、演进和前景。无论你上着、上了还是要上大学，你可好奇“大学”从哪里来、到哪里去？一代又一代“大学人”如何学习、生活和生存？大学到底是什么？大学是常维新的。你可感受到，你和这门课程是多么独特的存在？在此你可以无处不在地学习、享有各类课程资源，你还可以随时随地与老师和来自天南海北的同学沟通研讨。这可是“有教无类”，可是“海内存知己，天涯若比邻”？这种教和学的模式是大学的未来吗？或者，通过数码在线，我们终于回到了过去？千年的大学可拥有共同的目标、共同的方法、共同的群体、共同的未来？你不是一个人，你是古今中外“大学人”共同体中的一员，你本已具有、但尚需明晰你的身份特征和大学赋予你的使命、责任和权益。大学真是个伟大的存在，不然它怎能在地球上千年长存？当今大学的普遍存在仿佛是势所必然、理所应当。真是这样吗？我们不能忽视大学屹立于世的伟大，不能忽视大学在怎样的坚守与变革中才奋斗到了今天。开卷有益、以史为鉴。这是一门中西方教育文化的探索发现课，又是一门自省自强课。诚邀你与我们共渡一段充实又愉快的学习之旅。",
    "C_course-v1:DelftX+ET3034x+sp": "通过这门课你将会了解如何设计一个完整的光伏系统。这门课程介绍了关于将太阳能转化为电能，热能及太阳能燃料的技术，主要聚焦于电力生产。光伏（PV）设备作为先进的半导体设备直接从阳光中传输电力。重点在于了解太阳能电池的工作原理和生产制造，以及光伏组件的结构和光伏系统的设计。你将对光伏转化—将光转化成电的原理有一个更深入的理解。这门课程探讨了不同太阳能电池技术的优点，限制和挑战，例如结晶硅太阳能电池技术，薄膜太阳能电池技术以及一种最近提出的，还在实验研究阶段的新兴太阳能电池概念。我们将对太阳能组件的具体规格进行讨论并且演示如何设计一个能够投入实地应用的完整太阳能系统。 教育方式 课程由8-12分钟的教学视频，练习，任务作业和考试组成。规定的任务和三次考试将会决定最后成绩。学生们可以在网上免费获取代尔夫特理工大学的新教材“太阳能基础，技术和系统”。你的课程管理人员会鼓舞你通过互相帮助和分享好的想法及实践练习来与你的合作伙伴在课程论坛上相互学习与交流。          许可 本课程的教材版权属于代尔夫特理工大学并拥有知识共享署名 - 非商业性使用 - 相同方式共享(CC-BY-NC-SA)4.0的国际许可。",
    "C_course-v1:ZJUX+2017011101X+2017_T1": "本课程是环境工程与科学专业的主要课程，围绕国际工程教育核心理念，课程特色如下： 1、基于环境工程学的基本理论，归纳总结工程设计的原则与程序，系统讲授厂址选择与总平面布置、工艺流程设计、环保车间布置、 管道布置与设计等，缕清学生环境工程设计思路，加深学生对环境工程、工程制图等原理的理解，授课过程布置思考练习题； 2、重点介绍AutoCAD的基本绘图、基本编辑、高级编辑与技巧、绘图环境定义、 文字和表格创建、标注、 块/属性块/外部参照使用、输入输出/打印与发布图形、三维图形绘制等，使学生在短时间熟悉CAD系统的操作规范与使用技巧，授课过程布置专题练习作业； 3、结合环境工程经典设计案例，展开环境工程专业CAD绘图实训，教授学生绘制环境工程专业的平面布置图、工艺流程图、构筑物图、管道布置图等，为从事环境治理、科学研究与设计奠定良好基础。 ",
    "C_course-v1:NUDT+125205501+sp": "本课程主要内容有：公共管理的概念及发展，政府职能及政府治理，公共政策的制定与执行，公共部门战略管理，公共组织管理，公共部门领导，公共责任与伦理等。本课程的学习，让学习者了解现代公共管理理念，认识公共部门的运行方式及活动规律，熟悉公共部门政策的制定及执行、公共组织的变革方向、公共管理者自身的素质要求及责任，有助于学习者加深对公共组织自身和社会问题的认识，客观、科学地分析现实社会和政府面临的问题，并能提出有效解决问题的思路。 该课程在公共管理研究生中进行了16年的教学（40多个班次），听课人数达1600多人；在地方政府领导干部中进行了12年的教学（12个班次），听课人数达600人，受到听课者一致好评。 ",
    "C_course-v1:WUT+1022817X+sp": "让我们看看互联网上一分钟发生了什么？全球IP网一分钟传送639TB，发送2亿封邮件，Facebook新增27.7万用户，发生六百万次访问，Google发生2百万次搜索查询，Flicker有2千万次访问照片，Twitter新增10万条信微博，Youtube上载30小时的视频，发生130万次观看，2015年的你要用5年时间才能看完在互联网上一秒中所传的视频。数据正以前所未有的速度在不断的增长和累积，大数据时代已经来到。如何从数据中发现有趣的知识，并将其应用到具体的领域之中？数据分析与挖掘技术让你通过纷繁复杂的现象，看到背后隐藏的规律和模式，修炼一双在信息时代的慧眼。《互联网大规模数据分析技术》这门课程从大数据的基础技术入手，首先介绍大数据处理平台Hadoop和Spark、非关系数据库NoSQL、MapReduce分布式并行编程模型等；然后重点讲解数据挖掘中的经典算法。接下来解剖信息检索和推荐系统两大Web主流应用的原理和模型，并通过例子加深对这些问题的理解。同时推荐Lucene和Mahout两个开源工具包，可以快速搭建属于自己的全文搜索引擎和商品推荐应用系统。最后给出了信息过滤系统的评价体系，便于从学术的角度对系统性能进行分析。",
    "C_course-v1:USTC+2017011401X+2017_T1": "本课程从实践入手循序渐进，以Linux系统环境和Linux内核源代码为例，将Linux网络相关命令用法、Socket网络编程、TCP协议、IP协议及路由表、ARP协议及ARP缓存、二层交换网络的学习转发和过滤数据库等互联网架构的关键环节一一解析，并通过MenuOS实验系统进行代码跟踪分析。最终理解分析打开一个网页背后互联网的工作过程，其中重点分为三个抽象层次：一是便于人类理解的记忆的编址方式DNS Naming；二是便于全球定位编址和路由的IP Networking；三是便于局域网中实际完成数据交换传输的Layer 2 Switching；同时在理解互联网体系结构的基础上探寻它的历史演化渊源，乃至发现它背后的设计哲学，解读未来网络的演进方向。 互联网概述 1.1 课程内容简介1.2 网络协议基础1.3 上网浏览网页背后的网络通信过程1.4 实验环境安装配置1.5 网络相关命令 Socket网络编程 2.1 编译、构建和调试2.2 Socket接口2.3 UDP范例代码2.4 TCP范例代码 TCP协议 3.1 TCP协议概述3.2 Linux网络协议栈源代码简介3.3 Linux系统的编译、构建和调试3.4 TCP协议源代码分析 IP协议及路由表 IP协议基础路由表路由转发举例IP协议栈源代码解析路由协议简介网络层数据传输路径解析 ARP协议及ARP缓存 ARP协议基础ARP解析的过程ARP解析在网络传输过程中的作用ARP协议栈源代码解析 二层交换网络及转发过滤数据库 以太网基础交换机的学习、转发和过滤数据库常见二层协议数据链路层在Linux网络协议栈中的一些关键代码分析 DNS协议及域名存储与解析 DNS协议基础DNS域名的存储DNS域名解析过程分析 互联网架构设计背后的渊源 互联网架构设计的最初动机与核心目标互联网架构设计的具体目标及背后重要权衡",
    "C_course-v1:USTC+2017011402X+2017_T1": "随着Web应用的飞速发展，Web安全也越来越重要。《Web安全实践》课程面向零基础学生，从网站搭建的基础知识开始，覆盖了CSS历史攻击、CSRF、XSS、点击劫持、SQL注入、基于算法复杂度的DoS攻击以及基于机器学习的恶意URL识别。通过将所讲述的攻击在课程网站上实现，学生可以检查自己对攻击的理解ginger锻炼自己的编程能力。通过本课程的学习，学生能够深入理解Web应用的工作过程和原理，掌握常见的Web攻击的防御方法，从而为开发安全的Web应用打下坚实的基础。",
    "C_course-v1:NUDT+2017011401X+2017_T1": "“互联网+政务”理念的提出为政府的政务活动带来了巨大变革，电子政务的科学推行已经成为实现国家治理体系和治理能力现代化的重要手段。本课程通过对电子政务基础概念、实现过程、典型应用等基础性、总论性和前沿性的理论知识讲解，将授课内容依据“业务重组、流程再造、信息共享、组织虚拟”这4个电子政务的基本特征进行展开；共分为6个章节，分别用于阐述与上述4个特征相关的内容，包括社会信息网络化、电子政务概述、电子政务应用系统关键技术、电子政务组织管理与外包、电子政务环境下的政府流程变革、电子政务的发展与前沿等内容。本课程的目的是培养一批高素质、高层次、能够熟练掌握新技术，同时又懂政务管理的政务信息化人才。 考核规则：课后习题60%，期末考试40%",
    "C_course-v1:TsinghuaX+80240372X+sp": "本课程完整覆盖数据挖掘领域的各项核心技术，包括数据预处理、分类、聚类、回归、关联、推荐、集成学习、进化计算等。强调在知识的广度、深度和趣味性之间寻找最佳平衡点，在生动幽默中讲述数据挖掘的核心思想、关键技术以及一些在其它相关课程和教科书中少有涉及的重要知识点。本课程适合对大数据和数据科学感兴趣的各专业学生以及工程技术人员学习，不追求纯粹的理论推导，而是把理论与实践有机结合，让学生学到活的知识、有用的知识和真正属于自己的知识，特别是数据分析领域的研究方法和思维方式。",
    "C_course-v1:TsinghuaX+Thesis2016X+sp": "学位论文答辩环节是研究生培养的重要环节，为了充分发挥该环节的育人作用，搭建学术交流的平台，进一步保障和提高研究生培养质量，清华大学研究生院从2014年开始，从申请学位的博士、硕士研究生中选取了部分具有代表性的学位论文答辩进行录像，并首次将答辩视频上传学堂在线，获得了社会各界的认可和积极反响。2016年，清华大学将继续这一形式，遴选不同专业的博士、硕士研究生的学位论文答辩视频，继续以MOOC形式共享呈现给大家，以使更多的人能够分享这些资源，搭建更为广阔的学术交流平台。如果这些视频能对您的学术研究有所帮助和启发，则是我们十分期待并愿意看到的事。",
    "C_course-v1:NCTU+wghx+2017_T1": "化学是以实验为基础的科学，原理会随着新实验技术及新物理理论的产生而随之修正。有趣的是化学旧的原理就不会因为新的理论的成立而完全被推翻，而且新理论还常需要旧原理的帮忙才能让人看得到更完整的微观世界。本课程将从电子的总数、分布的几何空间及运动的模式来解释原子及分子的化学活性的来源，并进而解释微观分子世界的光电磁现象的原理。",
    "C_course-v1:TsinghuaX+20440333X+sp": "有机化学是化学科学中极为重要的一个分支，也是最有魅力的基础学科之一。主要内容包括各类有机化合物的命名、结构特征、物理性质、化学性质、用途、来源和制备方法。根据有机化合物结构的不同，可以将其划分为烷烃，烯烃，炔烃，芳烃，卤代烃，醇，酚，醚，醛，酮，羧酸，羧酸衍生物，胺类，硝基化合物，杂环化合物等，本课程将会分章节地对这些化合物的结构，性质，化学反应及制备方法等进行详细介绍。重点介绍一些基本反应类型，如取代反应、加成反应、消除反应、重排反应、氧化还原反应等的反应机理、反应条件和影响因素、应用范围。此外，还详细介绍有机结构理论，建立各类化合物的结构与反应性的关系；有机分子的立体化学基本概念；以及有机化合物的结构鉴定方法等。",
    "C_course-v1:TsinghuaX+00701032X+sp": "本课程将介绍美国政治制度的起源、变迁和现状。从美国的宪法框架出发，本课程试图讲解：（1）美国民主制度当中的各种分权和制衡机制，以及这一机制中各种政治力量在历史中的此消彼长。（2）美国民主制度中的各种政治参与途径（投票、社团、政党、媒体等），以及这些参与途径的有效性及限度。（3）美国不断变化的政治文化，以及它如何影响美国的政治制度。（4）美国民主制度的政策产出——外交、经济、社会福利等等，并通过这些政策来评估美国政治状况。",
    "C_course-v1:HUBU+HU08002X+sp": "健康是人类发展永恒的主题，追求健康是人们共同的愿望，拥有健康是人人享有的权利，维护健康必须走科学的道路，增进健康应遵循自身的规律。《运动与健康》这门课程将带领大家为健康而运动。在这门课程里，你可以领悟到运动对机体的神奇影响；你可以寻找到科学健身的方法；你可以欣赏到精彩的运动视频；你还可以学会运动损伤的初步处理；你会在运动误区的解释中豁然开朗！",
    "C_course-v1:HUBU+HU08003X+sp": "本课程一直体育专业本科生必修基础课，每学年第一学期开课，约300人，目前本课程有19所地方高校，约400名学生同时在线学习，涉及的专业较多，年均线上访问次数约50000次。本课程从学习者的兴趣和需要出发，利用团队专业理论和实验教师及网络技术人员共同设计制作了35个在线课程模块体系，精心设计了65个任务点，运用闯关模式，推进扫雷式学习。结合知识点模块，设计了35个章节测试内容，且设置了相应的达标要求，巩固学习。 ",
    "C_course-v1:HUBU+20170227X+sp": "葡萄牙语是世界第六大语言，在亚、非、欧、美等四大洲的葡萄牙、巴西、安哥拉、莫桑比克、佛得角、几内亚比绍、圣多美和普林西比、东帝汶以及中国澳门等国家和地区都以葡萄牙语为官方语言，全世界有近2亿人口讲这种语言。巴西葡语和以葡萄牙为代表的欧洲葡语在语音、词汇、语法等方面都稍有区别，本课程葡语发音以巴西葡语为主，从生活、学习、工作中的日常内容着手，深入浅出的传授语音、词汇、句型等语法知识。针对每个话题，提供对话和课文对应的中文翻译，对每一课重点词汇与句型进行讲解，还会穿插巴西和葡萄牙等葡语国家的文化小常识。通过学习本课程，学生能够运用葡语进行日常会话，具备扎实的基础葡语语法知识。",
    "C_course-v1:HUBU+2017022703X+sp": "该课程主要内容包括英语元音、辅音、语流音变、重音和语调，涵盖了主要的英语语音知识。本课程在学校讲授时间为16周，授课对象为英语专业一年级本科生，每届人数为150人左右。经过一个学期的学习，大多学生能够初步掌握英语语音的基本知识，并在一定程度上提高自己的发音水平。但英语语音学习是一个长期的过程，因此该课程的学习效果与学生投入的时间和精力密切相关。 ",
    "C_course-v1:TsinghuaX+2070071X+2017_T1": "心理健康课程是教育部要求的通识必选课，是大学生情智教育，是理解自己、发展自己的教育。比如，你是谁？你喜欢自己吗？你怎样才能有正能量？你怎么看别人，怎么与别人合作？怎么样能拥有影响别人的能力？你怎么样能活出自己？你怎样过一生才觉得自己是有价值和有意义的？通过课程的学习，最后能够使大学生悦纳自己，适应社会，活出人生。具体内容包括：自我意识与认识自我；焦虑应对与防御机制；自我认知与调整；树立自信 发现伟大的自己；调控情绪，塑造阳光心态；人际影响与合作；时间管理；恋爱与成长；爱的多样性与性；珍爱生命等。",
    "C_course-v1:WUT+WUT2016001+sp": "现代社会存在着形形色色的网络，如万维网、社交网、交通网等，人与人互相交互、影响，产生了各种各样有趣的问题。有人说“朋友的朋友是朋友”，那么“朋友的朋友的敌人的朋友”是敌人还是朋友呢？为什么只要你愿意，想认识任何一个陌生人最多只需要通过六个人。”，在这些社会现象的背后，是否还隐藏着我们不知道的规律呢？   当我们精心挑选好自驾线路，却身陷堵车或者更堵车的高速公路的时候，究竟是埋怨社会资源的匮乏还是怪自己读书少，不知道在线路的选择中其实还要用上博弈论。   美国选举，驴象之争，台湾投票，蓝绿混战，我们除了看热闹以外，怎样还可以看到选举背后的门道。   《网络、群体与市场》这门课程从交叉学科的角度出发，综合运用经济学、社会学、计算机科学，以及应用数学的有关概念与方法，分析与推理现实经济社会生活中的若干典型问题。帮助学生体会学科交叉的内涵，培养学生以“计算思维”的观念，解决社会学与经济学问题的能力。   老子说甘其食，美其服，安其居，乐其俗。邻国相望，鸡犬之声相闻，民至老死，不相往来。这种小国寡民的时代远去了。弹指一挥间，世界皆互联。让我们深入其中，探究高度互联世界的行为原理与效应机制。",
    "C_course-v1:BIT+BIT2016001+sp": "你需要学这门课么？如果你是天才，你不需要学。因为课程里的规则和方法都太简单了，太显而易见了；如果你是傻子，你千万别学。因为死搬硬套规则和方法，到了实践中不仅毫无用处，还会害人不浅。  如果你现在或将来是一位软件开发人员，那还犹豫什么？这门课可以让你把软件工程当中枯燥乏味的规则和方法瞬间和你的生活关联起来，让你发出会心一笑：原来如此！   本课程首先带你了解软件工程的基本概念，重点强调大家容易忽视的两个开发阶段：需求分析和测试。然后理性分析目前流行的敏捷开发方法SCRUM和XP，提醒大家不要过分迷信。考虑到面向对象技术在软件开发中的重要地位，在掌握了基本的面向对象技术和UML之后，我们通过一个完整案例来展示如何用UML来记录面向对象开发过程。   本课程会进一步介绍目前软件开发各阶段的自动化方法和工具，通过视频演示和小实验的方式，让大家亲密接触自动化工具，提高开发效率。最后可以协作完成持续集成和持续部署的工作。   除此之外，课程突出了过程改进，质量保证和软件复用这三个目前备受关注的软件工程主题。",
    "C_course-v1:HUBU+2017030501X+sp": "本课程以R、L、C等线性元件的特征方程及基尔霍夫定律两类约束为基础，介绍了选择变量建立方程以及运用电路定理等效变换得到电路电压、电流输入输出关系及负载功率的两种电路分析方法。在电路基本分析方法的支撑下，结合微分方程给出了LC动态元件构成的电路暂态分析特征，结合相量分析方法给出了正弦稳态电路的处理办法。课程在基本理论和方法学习应用的前提下，进一步将电工实验操作与仿真实验相结合，加深对知识的理解，提高应用能力。通过知识点整合拍摄的19个理论骨干视频和6个仿真实验视频，每个视频控制在10分钟左右，以知识点为独立单元，短小精炼，适合计算机、物理、化工、环境工程等非电类专业电工基础课程的理论学习。5个现场实验视频配合电工实验台的实际操作以供选择。视频以通用教材为依托，着重课程主干知识单元和知识点的牵连和扩展，通过在线引导和互动，提升电路基础知识的学习效果，也引导学生学习电工操作技能以及现代仿真工具的应用方法。本课程网站资源的建设目标是结合工程实际与科研前沿给出实际应用范例，提升知识应用水平和吸引学生学习兴趣。",
    "C_course-v1:HIT+HIT2016002+sp": "滑雪运动是人类在征服自然的实践过程中产生的，最早的滑雪活动是人们为了利用雪作为行走、狩猎、运输、迁徙、战争等内容的手段，大约开始于公元前8000年以前。随着时代的变迁，滑雪的实用价值已逐渐降低，但由于它更贴近自然、贴近生活，因而被人们广泛接受，如今，滑雪已成为冬季最受欢迎的休闲体育运动之一。高山滑雪是在越野滑雪基础上孕育发展而成的。起源于欧洲的阿尔卑斯山脉地区，故称阿尔卑斯滑雪，它是以滑雪板和滑雪杖为主要用具，在山上专设的线路上进行转弯和滑降的一种雪上运动项目。1721年，在挪威军队里，一个正式的滑雪组织成立了，12年之后，一般性的滑雪技巧成为男性必备的技能之一。早期军队中士兵一般都在鞋后跟部捆上皮革，这是原始的制动装置，用来在下坡时防止自己的滑雪板脱落。但是这样的捆绑有时候还是太松散，不能确保对滑雪板的控制，所以，一个单独的，可靠的滑雪杖应运而生，它在下坡路段可以起到刹车的作用，而在平坦的路段则可以作提高速度的加速器。1733—1917年间挪威出版了最早的滑雪书籍，成立了最早的滑雪俱乐部和第一支滑雪部队。20世纪20年代末，高山滑雪比赛进一步增多，特别是大型比赛。这时的高山滑雪无论从组织上还是规则上均已完善。随着世界锦标赛及世界杯等国际赛事的开展，高山滑雪开始风靡全球。",
    "C_course-v1:HIT+HIT2016001+sp": "十六世纪冰壶运动起源于苏格兰，是当时冬季人们在结冰的江河或池塘上玩的一种溜石游戏。由于项目自身所具有的独特魅力，很快在欧美许多国家流行起来，目前冰壶运动已发展成为全球性运动，并且作为正式比赛项目出现在奥运会上。1995年冰壶传入我国并很快发展起来。截止目前，我国女子冰壶队多次在世锦赛上获得奖牌、奥运会曾夺得铜牌，男子冰壶队也取得世锦赛和奥运会第四名的优异成绩，标志着中国冰壶跻身世界冰壶强队之列，受到世人的瞩目。冰壶课程主要内容包括：冰壶运动起源与发展、冰壶场地与器材、冰壶技术原理、冰壶教学、冰壶战术、赛事欣赏以及国内外赛事介绍等。通过幕课教学过程，使学生了解冰壶运动历史、传统和项目特点，树立终身体育观念；掌握冰壶基本的比赛技、战术知识和相关比赛规则，为实践操作和观赏比赛打好坚实基础。",
    "C_course-v1:TsinghuaX+80140242+sp": "锅炉、加热炉、窑炉、汽车、船舶、飞机、导弹和运载火箭等的高温工业燃烧装置中，处处可见高温热辐射在其中发挥重要的作用。包含气体、液滴、固体颗粒物等热辐射参与性介质的热辐射传递过程准确定量十分更加复杂。本课程将辐射传递方程（Radiative Transfer Equation，RTE）作为介质辐射传热分析的主线和重点，大约一半的课时用于RTE的推导、分析及求解方法的介绍，大约四分之一课时用于对气体、颗粒物和表面辐射特性及其模型进行介绍，剩下四分之一课时用于若干介质热辐射传递的应用问题。本课程将贯穿科学思维方法和先进分析方法的讲解，比如具有普遍使用价值的蒙特卡罗方法，以及已知信息不足条件下的病态反问题求解方法等，这些分析方法对热辐射以外的问题也具有良好的参考价值。",
    "C_course-v1:TsinghuaX+81020142X+sp": "集成电路是现代电子系统里必不可少的组成部分之一。数字集成电路的设计过程包括前端设计和后端设计。在前端设计阶段，在完成数字系统架构和算法设计的基础上，主要进行寄存器传输转换级(Register Transfer Leve",
    "C_course-v1:TsinghuaX+Pr20170406-SC_p1+sp": " 本课程为“全国大学生智能车竞赛”秘书处组织的“智能车制作”系列微课之一，在有限学时中帮助学生快速入门和了解ARM微控制器（单片机）与嵌入式系统，适合想参与竞赛的本科生和爱好者。微控制器与嵌入式系统技术，很适合于开始尝试挑战各种课外科技活动和竞赛的低年级本科同学，是初次尝试设计与创新时一个很有力的工具和敲门砖。ARM Cortex M构架的32位微控制器外围接口丰富、片内资源适中，能够实现大多数常用功能；同时，ARM Cotex M的32位内核构架则相对简练易学，容易从整体上理解和把握，适合低年级同学上手学习。本微课程介绍微控制器开发的基本方法和流程，以全国大学生智能车竞赛采用的32位微控制器为例，讲解微控制器与嵌入式应用开发的一般方法，让学生能尽快将一个微控制器的基本系统跑起来，动手实现自己的创意，进而参加全国大学生智能车竞赛等各类科技活动。本微课程是学堂在线MOOC课程“ARM微控制器与嵌入式系统”的精选版本，欢迎有兴趣的同学选择该课程进一步深入学习。",
    "C_course-v1:GXUST+2017041901X+2017_T1": "计算思维教育已然形成了共识和热潮，却也遇到了极大的挑战——挑战一：计算思维及其教育的本质内涵到底是什么？挑战二：计算思维教育所涉及的教学理念、教学内容、教学方法和手段等到底如何确定、凝练和解决？挑战三：现有的教学条件如何应对？ 必须指出的是，计算思维不是计算机思维，计算思维教育也不是计算机基础知识教育。就教学内容而言，我们认为应该在以下两方面进行挖掘和凝练：（1）深入计算学科，探寻计算机科学家们面向计算时求解问题的思想和方法；（2）跳出计算学科，面向所有的领域、所有的人，如何基于计算去求解问题、设计系统，乃至理解人类行为。 显然，计算思维是一种方法论，计算思维教育奉行的是“不要告诉我世界是怎么样的，告诉我如何创造世界”，它可以启迪大家心灵与智慧，可以提升大家的创新意识和能力。",
    "C_course-v1:BNU+GE410081071-01+2017_T1": "课程 《循环经济与可持续发展型企业》围绕循环经济专题，以物质在人类社会经济系统中的循环流动为核心，采用讨论式教学法，模拟科学研究与应用管理过程，分享可持续发展管理、物质循环流动、循环经济实施、可持续发展型企业构建与管理等基本内容。共14讲，32学时。提升学生认知与科研能力，培养文、理、工复合型创新人才。",
    "C_course-v1:FudanX+SOSC120007+sp": "（1）教学目标通过本课程的学习，让学生从宏观视角了解现代经济中金融市场、金融机构、中央银行的作用和运作机制，破解货币的秘密，理解货币是什么、如何产生和膨胀、具有什么影响，理解开放经济条件下央行实施货币政策、货币与经济关系等的相关理论与实证。（2）课程内容本课程主要包括四部分，第一部分导论，主要介绍什么是货币以及金融体系概览，第二部分是金融市场，侧重分析金融市场的价格——利率的行为特征及其决定；第三部分是金融机构，侧重分析在货币创造过程中最重要的金融机构——商业银行的运营及其行业特征；第四部分是本课程的核心，即货币供给、货币需求、货币政策的传导、货币政策策略以及货币政策规则等。",
    "C_course-v1:JNUX+07009156X+sp": "  《中医与诊断》是中医入门课程。本课程适合任何对中医学感兴趣的学生选修，不需要任何前驱中医知识。本视频课程共10单元，主要内容有两大块：  其一是部分中医理论知识（1阴阳和五行理论、2五脏六腑理论，3气血津液理论，4病因理论等），告诉大家中医说了什么。 其二是中医诊断方法（5问诊、6望诊、7舌诊、8脉诊、9闻诊、10切诊），告诉大家中医是如何运用望闻问切的方法进行诊断的。  中医诊断方法是本课程的学习目的，中医理论知识是为了更好的理解中医诊断方法而做的必要补充。  本课程扩展学习，是针对课程学习中的诊断结果，给出的治疗方案，使本课程不再局限于理论学习，也能让大家将理论运用到实践中。这部分扩展学习将在微信公众号“sunlitcm”中与大家见面。  本课程为学习者提供课程视频、电子讲稿、PPT、习题作业、在线测试、交流互动，以及扩展微信学习，使学习者不仅能够了解中医原理和中医诊断方法，而且能够学会运用适当的中医诊断方法来关注自身的健康以及疾病状况，为自身保健，及就医治疗提供一定依据。  本课程在每周四晚，将进行视频直播教学一小时，为你解答学习中的难点和疑点，全程陪伴你学完全部课程。   找个医生做朋友，不如自己就成为懂医的人。让我们一起，进入本课程的学习吧。",
    "C_course-v1:TsinghuaX+00690212X-2+sp": "中国是传承千年的礼仪之邦，声教播于海外。相传在三千多年前的殷周之际，周公制礼作乐，就提出了礼治的纲领。其后经过孔子和七十子后学，以及孟子、荀子等人的提倡和完善，礼义文明成为儒家文化的核心。西汉以后，作为礼义文明的理论形态和上古礼制的渊薮，《仪礼》、《周礼》、《礼记》先后被列入学官，不仅成为古代文人必读的经典，而且成为历代王朝制礼的基础，其对中国文化和历史的影响之深远自不待言。随着东亚儒家文化圈的形成，礼义文明自然成为了东方文明的重要特色。毋庸置疑，要了解中国传统文化，就需要了解中国古代礼义文明。",
    "C_course-v1:ZUELX+B0601353+sp": "你想成为优秀的管理者吗？你在为如何激励员工而烦恼吗？你想有效管控下属行为吗？你在为如何打造一支高绩效团队而发愁吗？欢迎来到《组织行为学》MOOC课堂，王淑红副教授将以清晰的逻辑、生动的案例、风趣的语言带你来一段“烧脑”之旅，一起来解开管理情境中员工行为背后的密码！",
    "C_course-v1:TsinghuaX+80000901X_2+sp": "数千年的中国历史上，曾出现了很多伟大的城市，汉长安、北魏洛阳、隋唐长安和洛阳、北宋开封、元大都，都是当时世界上最繁华的大都市。这些城市虽已星光黯淡，却留下了一座座优美壮丽的建筑杰作，令人叹为观止。中国的宫殿、宗教建筑、佛塔、陵寝和园林等建筑类型，无论建造技术还是美学追求，都达到了很高的水平。中国古代的建筑有着自成体系的一套营造方法，以木结构为主，也有不少砖石结构的佛塔和陵寝。历史上建造了大量宫殿建筑，北京故宫是现存世界上最大宫殿建筑群。自南北朝至唐，出现了大批佛教寺院与石窟寺。南北朝以来各地建造的砖石塔，也使中国砖石建筑达到很高水平。唐、辽、宋、金时期留下了一大批宗教建筑遗存，包括大型殿堂，多层楼阁，与高度达67米的高层木塔。明清时期坛壝、祠庙、陵墓与民居，有了高度发展，北京天坛，曲阜孔庙、明十三陵，北京四合院等，是这一时期重要建筑实例。北京颐和园、承德避暑山庄是古代皇家园林代表，明清私家园林则是数千年中国园林艺术的结晶。宋《营造法式》和清《工部工程做法则例》是中国官式建筑两部重要文本，对于理解中国建筑有着重要的意义。课程资料中也将包括这两部著作的电子版。",
    "C_course-v1:TsinghuaX+30640014X+sp": "语言最重要的功能就是交流。在交流中我们要知道如何开始一个对方感兴趣的话题，回答别人的提问，自然、流畅地完成一个对话。本课程选取了8个主题，由50多位来自美国、英国、加拿大、澳大利亚、哥伦比亚、中国的老师及各个年龄段的学生，在真实的场景中，用最地道的表达和最纯正的英语，带你谈论日常生活、学习的方方面面。本课程分为八个单元，每个单元有一个主题，分别是：1、个人信息的介绍与交换2、我们的家人和朋友3、饮食与用餐4、英语学习的目的和方法5、假日活动和难忘的经历6、兴趣爱好7、情感表达8、保持健康每个主题由十余组对话和小组讨论，外籍老师的中西方文化差异介绍，中国老师的重点词汇、句型讲解，听力理解练习和口语测试构成。通过学习和练习，你将可以和讲英语的朋友们自如地交谈、讨论与主题相关的任何问题。本课程的学习方法有很多。英语学习者可以在反复地听和跟读对话的过程中，不断积累语言素材，和你身边的朋友或同课程的学习者进行对话练习；英语教师可以选用本课程中适合的主题，组织学生进行听说训练，组织高效课堂。也许你不能理解每段对话的全部内容，只需听懂大意，随着课程的进展，你听懂的内容会越来越多。让我们一起实现一次英语听说的飞跃吧。本门课程在制作过程中得到了香港伟新教育基金和Google公司的资助，特此鸣谢。",
    "C_course-v1:McGillX+Chem181x+sp": "理解食物的细微差别并选择所吃的东西让人感到复杂而疑惑。几乎每天都有新闻告诉人们应该摄取某种“神奇食物”，或者应该避免某种“有毒食物”。今天是番茄能够预防癌症，明天是亚麻仁能够预防心脏病，后天又是大豆对更年期有疗效。此外还有对反式脂肪酸、转基因食物、阿斯巴甜或者味精的警告。营养保健品被吹捧为保持健康的关键。一些人认为奶制品必不可少，而另一些人则认为应该减少摄入。肉类、小麦、大豆等等食物都是如此。本门课程将会揭示宏观和微观营养素的分子组成，并利用前沿科学视角澄清一系列食物争议。其他话题还包括：饮食与癌症的关系、饮食与心血管疾病的关系、食物带来的疾病、食品添加剂和体重控制。你能学到什么： 了解饮食的主要营养组成 解释关于食物生产和健康的相关问题 评估媒体报导的关于食物的研究的可靠程度",
    "C_course-v1:TsinghuaX+30806872X+sp": "本课程以贾玺增博士主讲的清华大学精品课程《中国服装史》内容为基础，邀请中国最优秀史学专家、收藏家和复原团体，通过大量丰富的考古实物、图像资料，从物质生活、社会审美风尚变迁的角度，解读中国服装历史发展演变、文化内涵与象征意义，对比展示中国传统服饰的艺术风格、服装式样、裁剪结构、工艺细节，分析中国传统服饰元素时装转化的技巧与路径，海量举例名师大牌历史元素时装设计的成功案例，在中国服装史与时装设计之间搭建桥梁，对学习中国传统服装史、理解中国古代流行时尚，以及有效利用中国服装史元素，活学活用、学以致用地进行时装设计具有极大的现实意义和参考价值。",
    "C_course-v1:TsinghuaX+30700313X+sp": "在人们物质生活飞速发展的今天，关注心理学显得尤为重要。在美国大学，心理学是学生人数最多且最受欢迎的学科之一。本课程分为13章，分别阐述绪论、意识、感觉、知觉、学习、记忆、思维、情感、进化、动机、人格、社会以及幸福问题。在每一章中，都会以心理学的实证研究作为例证，以经典理论观点作为主导，以积极正面的心理学研究为方向，让学生掌握心理学的基本内容和前沿动态，了解心理学的思考方式，去除对心理学的疑惑与误解，掌握基本的心理学研究方法。",
    "C_course-v1:SEU+00690803+sp": "东南大学以王步高教授主持的大学国文（亦名：大学语文）课程，是同类课程中首门国家精品课程，目前升级为国家资源共享课，其“大学语文教学改革的理论与实践”获2005年国家教学成果二等奖，与课程配套王步高主编的《大学语文》教材，系国家“十五”、“十一五”、“十二五”规划教材，2001年，即获国家优秀教材二等奖，并有精美的课程网站、系列课件与之配套。东南大学大学语文对全国同行长期起着引导与示范作用。2009年起王步高教授又将本课程开进清华大学，是全校学生最欢迎的课程之一。大学语文MOOC课，与王步高教授主编的《大学语文》国家规划教材配套，开设64节课，为4学分，各校可以选其中部分课时，改为3学分或2学分。其中48课时由王步高教授亲自讲授，其他课程由东南大学教有所长、具有博士学位的教授、副教授讲授。王步高教授长期为全国大学语文的带头人之一，可以组织全国同行为各校提供适当面授、答疑与专家讲座。相信本课程对推动全国高校普遍开设本课程，提高全国大学生的母语水平，起到积极作用。",
    "C_course-v1:TsinghuaX+10800163X+sp": "通常的艺术史及艺术创作课程，会引导人们了解过往的文化，会指导人们体验曾经的艺术，前者侧重理论研究，后者侧重创作实践。但无论是理论，还是实践，都并不容易介入人们的生活，它们只是生活的样板和艺术的楷模，而不是生活和艺术的本身。虽然我们不是因为艺术而活着，但艺术确是由于我们才存在。《艺术的启示》这门课致力于消除艺术与生活的隔阂，消除艺术与公众的隔阂，让艺术像阳光、空气和水一样，蕴育和滋养我们社会中的每一个人。本门课程在引导学生敬仰艺术、热爱艺术的同时，更注重学生独立思考能力的引导，更注重学生思辨能力的培养。从阅读、欣赏优秀的艺术作品开始，学生要学会判断、学会分析、学会质疑。从参与、制作自己的艺术作品开始，学生要体会创意、体会创作、体会创新。我们研究艺术的目的，终究还是为了研究生活。我们通过艺术去体会纠结，通过艺术去应对烦恼，通过艺术去寻求创造，并且最终达到心灵的和谐、精神的和谐。在这里，艺术的理论+艺术的实践，等于“艺术的生活”！",
    "C_course-v1:TsinghuaX+00690302_2+sp": "作为《原来姹紫嫣红开遍——昆曲艺术欣赏》课程的后续，本课程将集中介绍昆曲经典剧目中目前舞台上较常见的《牡丹亭》、《长生殿》等十部本戏，《浣纱记·寄子》、《天下乐·嫁妹》等二十出折子戏。对于每个剧目，课程将分别介绍其原作者、剧情梗概、主要人物、常演选折、角色行当、艺术特色、常见版本等，以帮助观剧者更好地欣赏这些剧目。",
    "C_course-v1:DYU+dyuwgzbbm+sp": "财务报表是公司与投资大众之沟通工具。公司传达他们的经营绩效给公司外部人士，供信息用户了解公司的状况。学会计阅读财务报表对任何需运用财务信息做决策的信息用户而言是必要之要求。本课程之主要目的在提供容易阅读财务报表的方法给企业财务信息之潜在用户，如投资大众、债权人、公司员工和其他利害关系人（如供货商，客户），逐步引导财务报表使用者进入财务报表世界。本课程着重于如何理解公司各项活动造成报表的变化，首先教导财务报表使用者学会「望」字诀，懂外部经济活动之脉动变化之影响，例如：全球经济变化。第二，引导财务报表使用者学「闻」字诀，让使用者理解产业变化对财务报表影响。第三，指引财务报表使用者学习「问」字诀，可以看到财务报表数字时问自己数字背后代表之意义。第四，最后教导财务报表使用者学习「切」字诀，让财务报表使用者拿到财务报表时，即可理解公司究竟发生什么事，如何处理这些问题。本门课程针对三大主要财务报表之呈现方式与表达意涵。学员将学习到未来进行财务分析应注意之会计变动影响情况，及理解会计信息受会计处理变更之影响幅度。除此之外，学员还将可学习到会计准则、和公司管理与奖励制度如何影响财务报告程序。",
    "C_course-v1:TsinghuaX+10800032X+sp": "本课程为清华大学人文素质核心课程。自从地球上有了人类，工艺美术也就开始产生了。一部工艺美术史，实际上也是人类文明不断发展、演变和进步历程的形象记录。上下百万年，人们创造的分布在世界各地、难以数计的工艺美术作品，无一不是人类文明高容量的载体。外国工艺美术史研究是人文学科中的重要环节。它对培养国人的文化素质，提高我国综合素质教育质量，完善人文学科，树立学术形象，提升综合学术地位，皆有重要意义。",
    "C_course-v1:WellesleyX+ANTH207x+sp": "作为现代人类，我们都是以往进化的结果。可以通过研究人类化石记录、考古研究资料、现存和已灭绝人类种群的DNA直接研究过往发展历史。本课程将为人类进化史提供综述，从相对意义上的近现代人类变异知识到距今约500-700万年我们和现存类人猿最后的共同祖先都有涉及。重点介绍人类发展的主要进化改变，古人类学者和相关研究人员为了解这方面知识所用的研究方法。课程伊始将有关进化如何影响生物变异以及在现存人类和猿猴身上看似存在何种变异提出基础性问题。我们将随后研究人类血统何以开始有别于类人猿、南方古猿的兴衰、人属的起源和分布，以及在过去的1.5万年间与农业实践相关的最终激进进化改变。通过这一课程，学生们将接触到影响我们对人类进化理解的主要数据、地点和理论。图像: 阿根廷 Santa Cruz 省 Perito Moreno 镇附近平图拉斯河手洞中的手印。Mariano 摄于2005年",
    "C_course-v1:TsinghuaX+80000901X_1+sp": "数千年的中国历史上，曾出现了很多伟大的城市，汉长安、北魏洛阳、隋唐长安和洛阳、北宋开封、元大都，都是当时世界上最繁华的大都市。这些城市虽已星光黯淡，却留下了一座座优美壮丽的建筑杰作，令人叹为观止。中国的宫殿、宗教建筑、佛塔、陵寝和园林等建筑类型，无论建造技术还是美学追求，都达到了很高的水平。中国古代的建筑有着自成体系的一套营造方法，以木结构为主，也有不少砖石结构的佛塔和陵寝。历史上建造了大量宫殿建筑，北京故宫是现存世界上最大宫殿建筑群。自南北朝至唐，出现了大批佛教寺院与石窟寺。南北朝以来各地建造的砖石塔，也使中国砖石建筑达到很高水平。唐、辽、宋、金时期留下了一大批宗教建筑遗存，包括大型殿堂，多层楼阁，与高度达67米的高层木塔。明清时期坛壝、祠庙、陵墓与民居，有了高度发展，北京天坛，曲阜孔庙、明十三陵，北京四合院等，是这一时期重要建筑实例。北京颐和园、承德避暑山庄是古代皇家园林代表，明清私家园林则是数千年中国园林艺术的结晶。宋《营造法式》和清《工部工程做法则例》是中国官式建筑两部重要文本，对于理解中国建筑有着重要的意义。课程资料中也将包括这两部著作的电子版。",
    "C_course-v1:TsinghuaX+80611322X+sp": " 教育给了我们第二次生命，教育让我们成为自己。在漫长的十数载教育历程中，你是否想过教育给了你什么；站在人生的十字路口，你如何做出选择？对于教育，我们都有太多话要说。  但是，经验不等同于知识，观点需要数据的支撑，如何用教育社会学的专业研究和理论解释教育现象，如何从社会的角度分析教育问题？  教育社会学这门课程围绕教育与社会流动、教育体系的社会学分析、以及全球化和教育变革三大部分，讲述人类知识的演化、社会分析的概念体系、教育社会学的学科性、社会不平等与分层、教育与社会流动、性别与教育平等、班级社会学、学校组织社会学、教师的职业社会学分析、全球化与中国教育变革共十讲的内容。  每一讲都以热门话题为引，话题中代入了你的故事，回应你对世界的好奇和质疑，安抚你成长的困惑和阵痛。术业有专攻，本课程诚邀你与清华师生共渡一段充实又愉快的学习之旅，从而帮助你构建积极自我，确立最佳教育策略。 ",
    "C_course-v1:TsinghuaX+00612643X+sp": "《资治通鉴》是北宋司马光主持编纂的著名编年体史书，其自问世以来，不但以不可替代的史料价值为历代学者所重视，更以资政育人的根本动机与高卓史识为后世所称道。在该书294卷、300多万字篇幅中，隋唐五代史部分跨越近四百年沧桑，独占118卷，以无可替代的史料价值，成为整部《通鉴》最重要的内容。“《资治通鉴》导读之《大唐盛衰》”，接续自2014年开设以来广受好评的《&lt;资治通鉴&gt;导读》课程，主讲张国刚教授潜心研读《资治通鉴》数十年，通过精心选取其中的经典人物言行与历史场景，钩沉发覆、条分缕析，以现代思维总结文化精髓，以生动语言阐发历史智慧，尤其侧重其中修身、齐家、治国的现实意义。通过课程学习，同学们不仅可以掌握隋唐五代历史发展基本脉络，在小说影视演绎之外，领略更生动真切的隋唐风情；更可以走进原始记载，感受中国伟大史学著作的独特魅力，领悟从传统文化汲取现实营养的基本方法，为终身学习国学经典开辟道路。",
    "C_course-v1:TsinghuaX+90640012X+sp": "作为一门语言非常重要的两个方面，阅读可以让我们获取丰富的知识，写作可以让我们表达内心的思想。掌握正确的阅读技巧和写作技巧，能够让我们更好地获取信息和表达信息。本课程由中外教师及清华学生带领大家在真实的生活场景中畅游英语世界。本课程从学习、大学、文化、城市、教育、行为论、人际交流和人生的意义等八个主题展开，每个主题由主题课文（两篇）、重点词句讲解、阅读技巧讲解、嘉宾访谈、作文批改和写作技巧讲解、英语学习方法介绍、文学赏析等模块构成。主题课文模块围绕精心挑选的主题展开，带你体验丰富多彩的文化，拓宽视野，同时配有相应的重点词句讲解，让你的英语知识库更庞大；阅读技巧模块以师生互动的形式展开，由老师和英语专业研究生带大家从学习者的角度一起探讨英语阅读的秘诀所在；嘉宾访谈模块邀请了三位嘉宾老师，分别在学习、文化等方面进行了介绍和分享；写作部分包括作文批改和写作技巧讲解，选取与主题相关的四六级作文考题，并各配以两篇学生真实写作案例，通过批改作文的形式讲解写作技巧；英语学习方法模块以访谈形式展开，由留学生助教为大家分享英语学习经验；文学赏析模块精选了八篇文学名著，让学习者在师生互动中遨游文学的海洋。    和我们一起感受语言的魅力，让我们一起实现一次英语读写的飞跃！",
    "C_course-v1:ACCA+MA1_X+sp": " 初级管理会计为对会计和商务感兴趣的人士设计。零门槛课程，由伦敦帝国理工学院分支机构Epigeum设计，国际会计专家任导师。汉化课程时长为10周。加入学习ACCA-X为您打开进入财会行业的通道。课程简介ACCA-X全球在线课程由世界知名在线学习平台edx提供运作，该平台由麻省理工大学和哈佛大学共同搭建。课程内容由伦敦帝国理工学院分支机构Epigeum专业设计开发，旨在帮助有志成为未来商界领袖、会计师和企业家获得入行必备知识及在现实世界里处理财务会计业务活动中所应具备的专业能力。ACCA-X已获全球奖项包括：1.PQMagazine Awards 20172.AssociationExcellence Awards 20173.Internationaland European Association Awards 20164.EducationInvestor Awards 20165.LearningTechnologies Awards 20166.Featuredin the Financial Times 2016ACCA-X全面汉化的中文课程由学堂在线提供运作，学堂在线是清华大学发起的精品中文慕课平台。本课程的互动性非常强，所有的学习活动均经过精心构思和巧妙设计。课程管理团队还将邀请国内财经大咖做精彩的线上线下分享，让您直接地了解财会行业的事，财会行业的人，近距离感受财会的魅力及价值。完成课程的同学，也会获得由学堂在线与ACCA联合认证的证书。本课程：初级管理会计学，是管理会计的基础课程。通过学习管理信息，培养学员在现实环境里处理管理会计业务活动中应具备的基本专业能力。此课程不仅适合在校学生，也可作为从业人员了解企业管理会计的理想入门课程。本课程的学习目标：帮助学员认识并了解如何在组织中将数据转化为信息，为规划和决策提供有效的管理支持。本课程由ACCA New Ventures 特聘专家Barry Walsh先生和Tara Askham 女士提供在线视频授课。Barry是具有专业资质的会计师，在许多不同的行业都有着丰富的经验，他也是一名会计软件咨询师。在过去的15年中，Barry从事专业资质的教材出版和培训工作，也为专业会计师考试编写客观测试题。 Tara在诺丁汉中央学院（Central College，Nottingham）教授簿记课程，在会计专业领域有着丰富的教学，命题和编写教材的经验。通过本课程的学习，您将主要掌握：1.成本和管理会计的本质及目的2.如何记录和分类成本3. 如何使用电子表格  ",
    "C_course-v1:CUPB+CUPB201702+sp": "在中国石油工业发展历程中孕育出的石油文化，是中华民族宝贵的精神财富，是石油文明独特的基因组码，是中国石油企业鲜明的文化脉络。本课程对中国石油文化的内涵、外延进行凝练、概括，对其历史发展进行梳理、对其当代价值及石油工程伦理精神进行挖掘。",
    "C_course-v1:TsinghuaX+10610224X+sp": "本课程为思想政治理论课。课程以“历史与理论相结合、思想与现实相结合、线上与线下相结合、高雅与通俗相结合”为特色，讲授马克思主义中国化、毛泽东思想、社会主义初级阶段理论和基本路线、社会主义本质理论、社会主义改革开放理论、建设中国特色社会主义的总布局、根本目的、依靠力量、领导核心等专题，引导学生正确把握毛泽东思想和中国特色社会主义理论体系的基本内容和精神实质，引导学生深刻认识改革开放的必要性、可能性和艰巨性，引导学生牢固树立中国特色社会主义的道路自信、理论自信、制度自信和文化自信。本课程实施“转客为主”教学模式，即通过设置多重教学环节引导学生由“教学对象”向“教学主体”转化，由“被动性学习”向“主动性学习”转化，由“以听为主”向“听说读写行并重”转化。课程鼓励和引导学生实现“六化”： 一是“化耳为口”，即不仅要听，而且要说；二是“化目为手”，即不仅要读，而且要写；三是“化知为行”，即不仅要求知，而且要践行；四是“化外为内”，即将外在的知识转化为内在的素养；五是“化隐为显”，即将隐性的素质转化为显性的成果；六是“化人为己”，即将他人的素养转化为学生自我的素养。",
    "C_course-v1:SEU+00690803+Sp": "东南大学以王步高教授主持的大学国文（亦名：大学语文）课程，是同类课程中首门国家精品课程，目前升级为国家资源共享课，其“大学语文教学改革的理论与实践”获2005年国家教学成果二等奖，与课程配套王步高主编的《大学语文》教材，系国家“十五”、“十一五”、“十二五”规划教材，2001年，即获国家优秀教材二等奖，并有精美的课程网站、系列课件与之配套。东南大学大学语文对全国同行长期起着引导与示范作用。2009年起王步高教授又将本课程开进清华大学，是全校学生最欢迎的课程之一。大学语文moocs课，与王步高教授主编的《大学语文》国家规划教材配套，开设64节课，为4学分，各校可以选其中部分课时，改为3学分或2学分。其中48课时由王步高教授亲自讲授，其他课程由东南大学教有所长、具有博士学位的教授、副教授讲授。王步高教授长期为全国大学语文的带头人之一，可以组织全国同行为各校提供适当面授、答疑与专家讲座。相信本课程对推动全国高校普遍开设本课程，提高全国大学生的母语水平，起到积极作用。",
    "C_course-v1:TsinghuaX+00690302_1+sp": "昆曲是中国戏曲最杰出的典范，被联合国列入第一批人类非物质文化遗产代表作。初步接触昆曲，往往会提出这样的问题：什么是昆曲？怎样欣赏昆曲？中国戏曲的特点是什么？比起戏曲的其他剧种，昆曲有什么特色？戏曲的行当（生旦净末丑）是什么？昆曲中的语言是什么口音？什么是南昆和北昆？“青春版”《牡丹亭》是怎么回事？作为文化遗产的昆曲现状究竟如何？……本课程的宗旨是让更多人接触昆曲、熟悉昆曲，培养欣赏兴趣，提高欣赏水平。课程将介绍昆曲的基本知识，包括中国戏曲概况、昆曲的来龙去脉、昆曲的剧目、昆曲的艺术特色、昆曲的音乐和语言、昆曲的现状和展望等。前面那些问题，在课堂上都可以找到简明的答案。同时还开设《携手向花间——昆曲经典剧目欣赏》课程，集中介绍昆曲经典剧目中目前舞台上较常见的《牡丹亭》、《长生殿》等十部本戏、二十出折子戏。欢迎选修。",
    "C_course-v1:TsinghuaX+400182X+sp": "作为最优秀的综合性大学之一，清华大学有责任有义务培养深谙现代生命科学研究的医师科学家。他们不仅具备扎实的临床技能，在病床旁表现优秀，而且能够自如地运用现代生命科学的新知识和新工具创造性地解决临床问题，在转化医学研究的实验室中一样表现优秀。清华大学医学院培养的医师科学家与其他院校相比有哪些不同之处?清华大学如何发挥综合大学的优势来实现这一目标？我们的课程对医学实验班独特的3+2+3的八年制特色培养计划进行了详细的解读，通过本课程的学习，可以对清华大学医师科学家的培养体系有大致的了解，并对医学院的各个科研方向有更深刻的认识。学生不仅可以了解到医学学科的特点，而且会对医学院各基础学科，例如免疫、传染性疾病、神经科学、干细胞、结构生物学等形成初步的认识，此外课程也会对临床医学进行概要性的介绍。完成本课程后，学生对清华大学医学院培养的医师科学家会有更深入的了解和认识，他们首先是医生，但不是仅仅具有高尚的医德、精湛的医术，还具备强大的科学研究能力，能为现代医学指明方向、开拓创新，是国际医学界的领军人才。",
    "C_course-v1:TsinghuaX+10691113X+sp": "如果对人类历史做一个大致的划分，那么它可被分为古代社会与现代社会。不管是古代社会还是现代社会，都与人类的思想密切相关。人类社会的真正改变是由思想的改变引导的，并且是由思想确立的原则塑造的。古代社会之为古代社会，就在于它是奠定在由古代思想确立的五大原则之上：一，目的论原则；二，善高于一切的原则；三，责任与服从优先的原则；四，统治的合法性来自人之外的超越者的原则；五，集体优先于个人的原则。这些原则都是通过兑换成责任原则得到贯彻与落实。所以，古代社会首先是以责任原则去规定人与人之间的关系，并借此构建人间秩序。“启蒙运动”通过对人类个体自由的深度自觉与系统论证，为现代社会确立起不同于古代社会原则的一系列基本原则：1.自由优先原则；2.个体先于集体原则；3.权利与责任并行原则；4.统治的合法性来自于被统治者的授权与认同的原则。这些原则可归结为权利原则，现代社会是以权利原则去构建人间秩序。这门课将通过讨论以下问题来展示上面这些主题内容：人类思想是如何为古代社会确立起那些构成其秩序基础的基本原则？如何放弃和改变这些古代原则？又如何确立起那些把人类带进现代社会的基本原则？人类个体为什么有责任？又为什么有权利？",
    "C_course-v1:RiceX+MedDigX+sp": "医学正经历一场史无前例的变革。信息和技术的推进速度要快于我们的适应能力。这些变革，加上社会力量，如健康2.0运动，正在重新定义医生和患者所扮演的角色。本课程为参与者提供医药和医疗保健上前所未闻的观点。该课程面向公众，与对新兴的医疗环境有兴趣的人尤其相关。在课程结束时，学员将掌握知识能够成功参与到未来数字化的医学。数字时代的医学映射出在网络时代医疗保健面临的挑战和机遇。我们将探索社交媒体在医疗保健传播中的作用、可穿戴技术的应用、大数据在重塑健康行为中的潜力、个性化医疗伦理，以及这些新发展对医患关系的影响。参与者将了解相关的医疗革命并有能力批判性地分析这个不断发展的生态系统。数字时代的医学将提出一个新的对话，讨论医学未来的角色以及我们如何实现这一构想。加入我们吧！你将学到： 如何识别数字医疗核心领域的增长和毁灭 如何区分数字医疗的泡沫与真实机会 在医学从手动记录向数字化记录转变的过程",
    "C_course-v1:WageningenX+NUTR101x+sp": "食物在我们的社会中担任着很重要的角色，但很少有人真正了解它对于我们的身体的作用。学习关于营养的知识，能够了解日常饮食如何深刻地影响着我们当下与未来的健康。这门营养学基础课程就以营养过剩为焦点，详细介绍了营养与人类健康的关系。  来自荷兰瓦赫宁根大学的Sander Kersten教授将在课程中介绍脂肪、碳水化合物和蛋白质这三大宏量营养素的化学原理。你将学到大量的关于营养的知识，比如营养是如何被吸收的？是怎么被储存起来的？又是如何被代谢成能量的？你将了解到最新的关于不同类型的脂肪、碳水化合物和蛋白质是如何影响人类健康的看法。此外，这门课程还将涵盖有关能量平衡和体重调节的知识点，提供丰富的关于肥胖的知识。最后，通过课程的学习，你还将熟悉营养学研究以及营养学研究中常用的实验方法。  这是营养学入门课程，不需要更多的知识基础。完成这门课程的学习，你将掌握必要的工具来更好的权衡和解读铺天盖地的营养和健康的报道。  “营养与健康第1部分：宏量营养素与营养过剩”是瓦赫宁根大学“食品与健康”系列课程的一部分。我们的第二部分课程将更多的关注营养不良的问题，欢迎大家继续学习。 ",
    "C_course-v1:ACCA+MA2_X+sp": " ACCA-X全球在线课程由世界知名在线学习平台edx提供运作，该平台由麻省理工大学和哈佛大学共同搭建。课程内容由伦敦帝国理工学院分支机构Epigeum专业设计开发，旨在帮助有志成为未来商界领袖、会计师和企业家获得入行必备知识、及在现实世界里处理财务会计业务活动中所应具备的专业能力。 ACCA-X已获全球奖项包括： PQ Magazine Awards 2017Association Excellence Awards 2017International and European Association Awards 2016Education Investor Awards 2016Learning Technologies Awards 2016Featured in the Financial Times 2016ACCA-X全面汉化的中文课程由学堂在线提供运作，学堂在线是清华大学发起的精品中文慕课平台。本课程的互动性非常强，所有的学习活动均经过精心构思和巧妙设计。课程管理团队还将邀请国内财经大咖做精彩的线上线下分享，让您直接地了解财会行业的事，财会行业的人，近距离感受财会的魅力及价值。完成课程的同学，也会获得由学堂在线与ACCA联合认证的证书。 本课程：中级理会计学，是为内部管理人员使用管理信息用于决策制定设计的课程。作为管理会计的提升课程，如果您已有一定的基础的管理会计和商务知识，可以选择这门课。本课程的学习目标：帮学员了解成本和资金管理基本原理，为规划和决策提供有效的管理支持。本课程由ACCA New Ventures 特聘专家Jayne Howson 和Valli Rajagopal 女士提供在线视频授课。Jayne是一名具有专业资质的会计师，有25年教授ACCA的丰富经验。她专长于财务报告和财务管理课程，也教授税务课程。Jayne为课堂授课设计和编写教辅材料及技术性文章，多篇文章已经在ACCA学员期刊（Student Accountant）上发布。 Valli是一名管理会计作者，同时也是高等教育学院（Higher Education Academy）的研究员。Valli曾有多年在荷兰及中国从事教师，记者和会计工作的经历。作为一名具有专业资质的会计师，Valli也曾服务过多家慈善机构。 通过本课程的学习，您将主要掌握：1.成本核算的作用以及成本分类、成本习性2.现金管理、现金预算的目标、编制和控制机制 3.本量利（CVP）分析  ",
    "C_course-v1:TsinghuaX+20220332X+sp": "在中国近代史发展的进程中，日本超过世界上任何一个国家，成为了对中国影响最大的国家。日本文化对中国青少年的性格形成乃至文化认同感、价值观塑造方面所起到的影响不容小觑。从日本社会生活现象中学习并反观中国社会。重新认识日本国和日本人，从中日两国现代交往的种种矛盾现象中看清楚“岛国根性”与“大陆农耕民族”最根本的差异所在。对于一个国家的了解、与其交流或者认知，掌握这个国家、民族的文化甚至比单纯掌握这个国家的语言更为重要。在日语基础的学习过程中，比以往课堂教学更多地揉入对日本社会生活中的文化现象予以介绍和分析。语言部分预计学习指定教材的1-9课，学习日语的语音；基本句式；用言的词尾变化；助词、助动词的使用等。完成本课程后可以达到掌握日语自学基础。课程共计12个单元。本门课程线上与线下学生所用时间预计分别占20%和80%。日本文化和日语基础将由不同教师担任。",
    "C_course-v1:TsinghuaX+00670122X+sp": "中国文人生活的厅堂之雅，在宋代已形成“文人四艺”的琴棋书画，和“生活四艺”的插花、点茶、焚香、挂画。经过数千年的传承与发展，生活四艺不仅是技艺，更可从中领悟人与天地自然合一之妙，体验一种智慧、高雅、优美的生活方式，借以修身养性，渐而入道。现代生活美学（一）侧重生活四艺中的插花。插花是将鲜切植物素材（枝叶花果等），配以合适的器皿，经过一定的修剪技术和造型艺术，重新创作出一件抒情表意的精致艺术品。通过插花的仪式和创作过程，放下杂念，让心得以宁静，体悟天地自然之性情，为之花道。课程首先梳理东西方插花的发展脉络，从插花看中国、日本以及西方花文化的不同特征，以及相互影响和融合的过程；然后进入到插花的操作层面，如植物知识、色彩构成，东方插花构成等。在此过程中，认识和亲近植物花卉，关注内心体验，平衡心理，培养优雅的生活方式和社交礼仪。现代生活美学（二）将生活美学的内容进一步延伸到香道、茶道、礼仪与健康等等。课程将邀请有关的业内嘉宾，如茶师、营养师、化妆师、园艺师等与老师同学一起互动。Sincethe Sung dynast",
    "C_course-v1:TsinghuaX+THU201605X+sp": "“信息素养——学术研究的必修课（通识版）”是一门让学习者终身受益的关于方法与技能的课程，无论你处于哪个年龄段，无论你拥有何种专业背景。课程开篇会有人与你聊聊他对信息素养的认识，聊过之后你可以顺便测一测自己的信息素养水平，包括在很大程度上决定你信息素养水平的信息检索与利用的能力。如果你希望继续学习，接下来的内容包括：① 文献信息检索的基础知识；② 信息检索的误区和常见问题；③ 从检索案例出发，探讨信息源的利用、检索方法与技巧；④ 利用参考工具检索各类数据与事实；⑤ 享用一切可以利用的网络信息资源；⑥ 认识学术交流模式，学习学术规范；⑦ 做好知识与文献管理，利用现代技术与工具提高工作效率。",
    "C_course-v1:TsinghuaX+02070251X+sp": "职业的选择与发展是人生的重要主题之一。对于大学生而言，第一份职业的选择并不是一件容易的事，需要经历长时间的职业探索和自我探索，学习有关决策的思维和技术，学习适应自身和外界的快速变化，学习平衡理想与现实，工作与生活的多重角色，掌握求职技巧，并在不断的实践中验证、修订或者更改自己的职业目标。可以说，职业的探索与选择不仅是毕业生的紧急任务，也是普通大学生在学期间的重要任务之一。职业的选择不仅仅是找到一份工作，也是个人在与职业环境的互动中，更加知道“我”想成为一个什么样的人，并且努力完成一系列生涯任务的生命历程。",
    "C_course-v1:XJTU+ME-XMGL2013-014X+sp": "本课程讲授项目采购与合同管理的相关概念、理论和方法, 包括采购分类和规划, 采购计划的制定和招投标的基本过程, 合同的制定过程和法律特征, 争议纠纷及索赔的处理办法等. 通过一些代表性实际案例, 说明该领域中的国内及国际通行原则和做法, 以此充实学生在项目采购与合同管理方面的理论知识, 提升他们在此方面的实际工作能力。本课程的特色是实践性和操作性。 实践性是指课程以实际中的项目采购、招投标、合同履行及争议纠纷解决为主要对象, 面向实践中具体问题的解决,为项目采购与合同管理的实践服务；操作性是指课程的内容以项目采购和合同管理的法规、法律、制度和规定等为主,介绍如何进行操作才符合采购与合同管理的基本原则,实现经济性和效率性的目标。",
    "C_course-v1:MIL+MIL2016001+sp": "在亚欧大陆东部，太平洋西岸，矗立着世界上陆地边境线最长，邻国众多的国家，中国。在我们美丽的家园周边，有这样一些国度，“清晨之国”朝鲜、横跨欧亚大陆的俄罗斯、热情奔放的蒙古、世界上最大的内陆国哈萨克斯坦、有着“中亚瑞士”美誉的吉尔吉斯斯坦、有“高山国”之称的塔吉克斯坦、在中亚地区南部起重要屏障和桥梁的阿富汗、“清真之国”巴基斯坦、世界四大文明古国之一--印度、“万佛之国”尼泊尔、亚洲幸福指数最高国度不丹、“佛塔之国”缅甸、中南半岛北部唯一无海岸线的内陆国家老挝、“斗笠之国”越南。这些国度紧贴着我国总长度约2．2万公里的陆地边境线，勾勒出美丽富饶的中华大地，他们与我们只有一步之遥，却又无比神秘。接下来，就让我们一起走进这些神秘的国度。 ",
    "C_course-v1:JinanX+2017031001X+sp": "《华文教学的理念与方法》是为海内外众多有志于从事华文教学工作的在校学生和老师专门开设的一门课程。“华文教学”指的是向海外华人华侨子女教授华文，与一般所说的对外汉语教学不完全相同。本课程将系统讲授华文教学的理论基础，介绍海外华人社会及华文教育的历史发展和现状，探讨华文教学的相关教学理论，介绍华文教学的常用教学方法与技巧。这门课的目的就是希望我们现代的华文教师能具备科学先进的教学理念，掌握行之有效的教学方法，使海外华人的祖语传承工作能发展得更好。《华文教学理念与方法》这样的课程，在国内大学中，同类的课程极少。普通高等院校目前开设的主要是《对外汉语教学概论》等汉语作为第二语言教学领域的课程。而这门课则是以“华人”和“华语”的视角，去理解关于汉语作为祖语的教学。都说国际“汉语热”，事实上在学习汉语的外国人中，华裔占了相当大的部分。怎样更有效地针对他们的情况进行华语教学，怎样让华文教师们以最新的理念和方法去指导他们的教学实践，这正是本课程所要解答的问题。",
    "C_course-v1:TsinghuaX+40260092X+sp": "传感器是能够感受规定的被测量，并按照一定规律转换成可用输出信号的器件或装置。本课程围绕常见传感器类型，讲解其原理、实现方式、应用、最新研究及产品进展等。",
    "C_course-v1:TsinghuaX+10610183_2X+sp": "《思想道德修养与法律基础》是一门融思想性、政治性、知识性、综合性和实践性为一体的课程。作为大学生的第一门思想政治理论课程，本课程以马克思列宁主义、毛泽东思想和中国特色社会主义理论体系为指导，传承中华优秀传统文化，借鉴人类文明的有益创造成果，围绕当代大学生在成长成才过程中面对的思想、道德、法律等问题，进行马克思主义的世界观、人生观、价值观、道德观和法律观的教育教学，帮助大学生提高思想道德素质和法律素质，成长为德智体美全面发展的社会主义事业的合格建设者和接班人。",
    "C_course-v1:TsinghuaX+40160092X+sp": "“生产计划与控制”课程是工业工程专业的核心骨干课程。工业工程师和制造企业管理者必须掌握生产计划与控制方面的基本知识与能力。本课程的主要内容包括：生产运营战略、产品需求预测、库存控制、综合计划、物料需求计划、作业调度、精益生产、约束理论、应对变动。本课程将使你加深对工业生产的理解，强化对生产系统的掌控能力，为“中国制造”由大到强，尽一份自己的力量。",
    "C_course-v1:TsinghuaX+TSINGHUA107+sp": "“人文清华”邀集清华大学最优秀的人文社科学者，阐述经典学说、独特思考和重大发现。选课同学听名师主题演讲，观看学术对谈，在助教带领下精读大师著作，完成课堂讨论与课程作业。 本学期暂定推出七位著名学者的课程，分别是著名作家格非，国学家陈来，社会学家李强，伦理学家万俊人，历史学家彭林，思想史家、文学史家汪晖，科幻作家郝景芳。每位学者一个单元，共7个单元，均包含以下内容： 1、 授课1：听学者讲座，深入探究本学科的一个重要问题； 2、 授课2：长篇访谈视频，呈现该学者的学术研究概貌和思想脉络； 3、 课外阅读：由每位学者的博士生带领阅读一本经典著作； 4、 课堂讨论：由每位学者的博士生组织并带领专题讨论； *考核方式参见【常见问题】。",
    "C_course-v1:AdelaideX+humbio101+sp": "你是否准备从事与健康相关的职业，或是想要学习健康科学？或许你是想要了解更多的人体的奥妙？我们的身体是奇妙而复杂的生物机器。本门课程会为你学习人体解剖学和生理学打下良好的基础。你会更全面地了解人体细胞和组织在健康或疾病状态下的正常结构与功能。在课程中也会清晰阐述身体四种主要类型组织：上皮细胞，结缔组织，肌肉细胞和神经细胞。本课程采用多种有趣的学习方式，包括短视频、动画、互动和综合测验。课程通过对核心概念进行引导，使你进行相关学习。你将学到： 人体细胞和组织的结构和功能知识 基本人体解剖和生理学知识 健康科学以及健康职业的知识准备",
    "C_course-v1:TsinghuaX+40990255X_1+sp": "通过学习本课程，掌握采暖、通风、空调设备与系统的基本概念、构成和工作原理，了解各种有关设备和系统的特点和应用性能，培养运用先修所学的基础理论与本课程的专业知识分析解决本专业问题的能力。本课程覆盖的技术领域为用于控制建筑热湿与空气质量环境的楼内设备与系统，把传统上被分在空调、通风、供暖三门课程中的系统与设备融为一门课程进行讲授，通过对比分析提炼不同类型技术手段的共性与各自的应用特点，克服了随着技术的发展凸显出的原有专业课程分类区隔的局限性。本课程着重各种建筑环境控制技术与设备的特点与发展的动因介绍，以及针对不同目标的各种类型技术及组合的应用适宜性分析。通过案例分析来促进学生掌握设备和系统等技术手段的发展与应用的思路，培养学生灵活运用不同类型技术手段及其组合来解决实际专业问题的能力。",
    "C_course-v1:TsinghuaX+30040352X+sp": "课程目标是以地下含水介质中的非饱和－饱和地下水为对象，运用水文循环和水量平衡原理，深入理解其储存、运动和转化的知识和理论，掌握现代观测、模拟、预测的技术和方法，为水资源开发利用和生态环境保护提供专业基础知识。课程内容从介绍土壤水和地下水的基本概念开始，学习土壤水和地下水运动基本方程与求解方法、土壤水和地下水转化的理论与计算，并进行典型案例讨论分析。了解土壤水和地下水参数获取方法，学习应用HYDRUS和FEFLOW（or MODFLOW）两个软件模拟土壤水和地下水运动。最后学习观测、生态环境、管理的基本知识，介绍地下水文学的学术前沿。",
    "C_course-v1:TsinghuaX+70612463X+sp": "统计学是现代科学的通用语，是现代研究一项不可缺少的工具。社会科学与经典统计学原理结合，形成了一套使用统计测量体系研究社会环境中人类行为的方法论体系。这套体系不仅局限于深奥的数字、表格和公式，更是一种逻辑思维方式；它提供给研究者的不仅是收集、分析、理解数据的基本技能，更是一种从证据到结论的科学推论过程。统计分析可分为探索性数据分析和推断性统计方法两部分，概率论则是连接两者的桥梁。本课程将借助开放源统计软件R语言所带来的强大功能，介绍探索数据的必备技能。接着，我们将对抽样分布、估计以及假设检验等统计学核心理论进行讲解。最后，我们将结合来自社会学、心理学、教育学等学科的研究实例，对多元回归、逻辑斯蒂回归、多水平模型等高级统计方法在社会科学中的应用进行探讨。即使你以往的数学学习困难重重，也并不意味着你在这门课的学习中将处于劣势。我们相信，逻辑思维的训练比计算能力更重要。课程结束，你将对如何提炼纷繁数据中的有效信息有更好的感觉；别人研究中的统计分析将不再是你的阅读禁区；你将学会如何作为统计学原理的消费者，将统计思维应用到自己的研究中去。",
    "C_course-v1:TsinghuaX+20250064X+sp": "本课程是电子技术基础的一个重要分支，是电气、电子信息类和部分非电类专业本科生在电子技术方面入门性质的技术基础课。课程主要包括（1）基础部分和（2）应用部分；前者内容为半导体基础知识、放大电路基础、多级放大电路、集成运算放大电路、放大电路的频率响应、放大电路的反馈等，后者内容为信号的运算和处理、波形的产生和信号的转换、功率放大电路、直流稳压电源和模拟电子电路的读图等。本课程通过对常用电子器件、模拟电路及其系统的分析和设计学习，使学生获得模拟电子技术方面的基本知识、基本理论和基本技能，为深入学习电子技术及其在专业领域中的应用、认识电子技术的新发展打下基础。",
    "C_course-v1:FUDANx+ECON1300812+sp": "金融工程主要是随着投资银行业与资本市场的扩张而产生和发展起来的一门应用性很强的金融学科。通过本课程的学习，同学们能掌握远期、期货、期权、互换等衍生金融工具的基本原理；掌握衍生金融工具定价的基本原理；掌握运用衍生金融工具进行套期保值的基本原理；掌握金融工程的基本理论和技术，初步学会运用工程技术的方法，如数学建模、数值计算、网络图解、仿真模拟等设计、开发和实施新型金融产品、实施金融风险管理策略等，创造性地解决金融问题；通过授课、作业、案例分析等，培养学生的金融工程思维。",
    "C_course-v1:TsinghuaX+00690863X+sp": "本课程系王步高教授主持的“唐宋诗词鉴赏”国家精品课程、国家资源共享课系列课程之一。课程从词的定义、词的起源开始，较系统地讲授唐宋词的代表作家、代表作品，重要流派；以讲作品为主，兼及作家、唐宋词史以及宋代的历史、民俗及人文精神；通过本课程的学习，使学生对唐宋词有较为全面系统的了解，同时能提高其诗词阅读鉴赏及批评能力。主讲人王步高教授为词学大师唐圭璋入室弟子，协助唐主编过《唐宋词鉴赏辞典》，长于诗词写作，词学领域著作颇丰，该课程是清华大学、东南大学最受学生欢迎的课程之一。",
    "C_course-v1:JSUX+2017011101X+sp": "艺术心理学分为艺术视觉心理和艺术社会心理两部分，第一部分侧重视觉心理与艺术形式的对应关系，探讨艺术的心理效应。该课程紧密结合艺术实践，通过艺术心理研究来验证艺术的性质和效果，把基本原理化解在重要的专题中。课程共分12讲，所选课题注重实证性和实用性，结合大量的作品分析，导入以人为本的价值判断和艺术创造的方法论，兼有专业理论和人文普适性的特点。根据在线课程的特点，该课力求简明扼要、生动直观、深入浅出，把思辨性、直观性、趣味性相结合，以有限的内容启发学员线下阅读，注重提高自学研究能力。",
    "C_course-v1:TJU+2010241X+sp": "园林植物景观学原理与方法课程是同济大学建筑与城市规划学院开设的一门风景园林工程硕士专业学位必修课",
    "C_course-v1:ZUEL+B0680090+sp": "经济地理学是一门关于人为生存而抗争的地理学。它是现代地理学的重要分支，主要探讨企业的经济活动与地理和环境之间的复杂动态关系，它跟踪和反映了现代工业社会的空间变迁轨迹。学习本门课程不需要高深的先修知识，只需要不断追问“在哪里？”和“为什么？”这样的问题。",
    "C_course-v1:ACCA+FA2_X+sp": " ACCA-X全球在线课程由世界知名在线学习平台edx提供运作，该平台由麻省理工大学和哈佛大学共同搭建。课程内容由伦敦帝国理工学院分支机构Epigeum专业设计开发，旨在帮助有志成为未来商界领袖、会计师和企业家获得入行必备知识、及在现实世界里处理财务会计业务活动中所应具备的专业能力。ACCA-X已获全球奖项包括：PQ Magazine Awards 2017Association Excellence Awards 2017International and European Association Awards 2016Education Investor Awards 2016Learning Technologies Awards 2016Featured in the Financial Times 2016ACCA-X全面汉化的中文课程由学堂在线提供运作，学堂在线是清华大学发起的精品中文慕课平台。本课程的互动性非常强，所有的学习活动均经过精心构思和巧妙设计。课程管理团队还将邀请国内财经大咖做精彩的线上线下分享，让您直接地了解财会行业的事，财会行业的人，近距离感受财会的魅力及价值。完成课程的同学，也会获得由学堂在线与ACCA联合认证的证书。本课程：中级财务会计学，是针对为企业内部和外部利益相关者以标准形式记录商业交易和编制一系列账表，对于刚开始接触财会行业的人，如果您已有一定的财会与商务基础知识，可以选择这门课程。本课程的学习目标：建立对主要商业交易类型和通用会计准则和概念，了解复式记账法使用和基础财务报表编制的技巧以及编制合伙企业账户。本课程由ACCA New Ventures特聘专家Jayne Howson和Valli Rajagopal女士提供在线视频授课。Jayne是一名具有专业资质的会计师，有25年教授ACCA的丰富经验。她专长于财务报告和财务管理课程，也教授税务课程。Jayne为课堂授课设计和编写教辅材料及技术性文章，多篇文章已经在ACCA学员期刊（Student Accountant）上发布。Valli是一名管理会计作者，同时也是高等教育学院（Higher Education Academy）的研究员。Valli曾有多年在荷兰及中国从事教师，记者和会计工作的经历。作为一名具有专业资质的会计师，Valli也曾服务过多家慈善机构。通过本课程的学习，您将主要掌握： 通用会计准则和概念 如何编制试算表、日记账以及分类账目 控制账户目以及现金账对账 如何编制合伙企业账户 ",
    "C_course-v1:ACCA+FA1_X+sp": " ACCA-X全球在线课程由世界知名在线学习平台edx提供运作，该平台由麻省理工大学和哈佛大学共同搭建。课程内容由伦敦帝国理工学院分支机构Epigeum专业设计开发，旨在帮助有志成为未来商界领袖、会计师和企业家获得入行必备知识及在现实世界里处理财务会计业务活动中所应具备的专业能力。ACCA-X已获全球奖项包括：1.PQMagazine Awards 20172.AssociationExcellence Awards 20173.Internationaland European Association Awards 20164.EducationInvestor Awards 20165.LearningTechnologies Awards 20166.Featuredin the Financial Times 2016ACCA-X全面汉化的中文课程由学堂在线提供运作，学堂在线是清华大学发起的精品中文慕课平台。本课程的互动性非常强，所有的学习活动均经过精心构思和巧妙设计。课程管理团队还将邀请国内财经大咖做精彩的线上线下分享，让您直接地了解财会行业的事，财会行业的人，近距离感受财会的魅力及价值。完成课程的同学，也会获得由学堂在线与ACCA联合认证的证书。本课程：初级财务会计学，是针对会计核算方法和应用实践的基础课程，不仅适合在校学生，也可作为从业人员了解企业会计基本概念的理想入门课程。本课程的学习目标：建立对主要商业交易类型和文件归档方式的认识，理解如何在会计系统中记录交易和存档，并编制试算平衡表。本课程由ACCA New Ventures 特聘专家Barry Walsh先生和Tara Askham 女士提供在线视频授课。Barry是具有专业资质的会计师，在许多不同的行业都有着丰富的经验，他也是一名会计软件咨询师。在过去的15年中，Barry从事专业资质的教材出版和培训工作，也为专业会计师考试编写客观测试题。 Tara在诺丁汉中央学院（Central College，Nottingham）教授簿记课程，在会计专业领域有着丰富的教学，命题和编写教材的经验。通过本课程的学习，您将主要掌握：1.商业交易，银行系统和复式记账法2.工资和分类账目3.试算平衡表",
    "C_course-v1:HEBNU+2017011901X+sp": "模拟电子技术基础”是一门研究电子器件及其应用的科学技术，主要是围绕着各种半导体器件及其电路展开研究的。半导体器件主要讲解了二极管、双极型三极管、场效应管和集成电路；所涉及的电路有基本放大电路，多级放大电路与的频率响应，功率放大电路，集成运算放大电路，放大电路中的反馈，信号的运算与处理，信号产生电路，直流电源等内容。本课程在国内电类课程中率先完成了数字化资源和同步教材的慕课建设。其中，数字化资源于2015年9月1日已在中国大学MOOC发布，通过100个教学微视频和3个知识回顾微视频（共计11.5小时，平均每个微视频6.7分钟）再现教学精华；同步教材于2016年10月在高等教育出版社出版，实现了教材内容与100个教学微视频的一对一。为“教”与“学”提供了有效的保障。   在“学堂在线”平台，为学习者提供了教学PTT、随堂测验、单元测验与作业、讨论题和网上答疑等互动学习体验环节。相信学习者通过“百集模电视频、同步慕课教材、学习体验平台”三位一体的学习套餐，会逐步适应和喜欢本课程的。",
    "C_course-v1:Tsinghua+Thesis2017X+2017_T1": "学位论文答辩环节是研究生培养的重要环节，为了充分发挥该环节的育人作用，搭建学术交流的平台，进一步保障和提高研究生培养质量，清华大学研究生院从2014年开始，从申请学位的博士、硕士研究生中选取了部分具有代表性的学位论文答辩进行录像，并首次将答辩视频上传学堂在线，获得了社会各界的认可和积极反响。2017年，清华大学继续这一形式，遴选不同专业的博士、硕士研究生的学位论文答辩视频，继续以MOOC形式共享呈现给大家，以使更多的人能够分享这些资源，搭建更为广阔的学术交流平台。如果这些视频能对您的学术研究有所帮助和启发，则是我们十分期待并愿意看到的事。",
    "C_course-v1:ICx+Spanish001+sp": "Este curso está diseñado con el objetivo de proporcionar a sinohablantes un primer acercamiento al español y la cultura hispanohablante.  该课程旨在引导中国学生迈出了解西班牙语和西班牙语文化的第一步。  El alumno irá dando sus primeros pasos en el aprendizaje de español de una forma fácil y atractiva. A través de una metodología comunicativ",
    "C_course-v1:TsinghuaX+80000271X+sp": "我国每年都在建设大量的居住建筑，住宅设计是建筑师的基本功。随着人们对生活水平与居住质量要求的逐步提升，住宅设计正向精细化、人性化方向发展。基于此，本课程将从以下问题出发，深入浅出地带大家了解住宅精细化设计的各个方面：我国住宅设计是经历了哪几个发展阶段？室内装修中有哪些常犯的错误？怎样才能使住宅更加舒适、实用？户型优化设计该从哪里入手？住区的规划与设计中有哪些人性化设计要点？国外住宅设计有哪些值得借鉴的理念与做法？住宅的未来发展趋势是什么？无论你是设计专业的学生、建筑师、地产工作者，还是热爱生活的普通人，都能通过本门课程的学习，对住宅有更深的理解与认识、掌握精细化设计的理论与方法，从而体味“源于生活、高于生活”的居住艺术。",
    "C_course-v1:HUBU+20170619001+sp": "在认识和掌握生态学的基本规律的基础上，能够运用生态学理论，保护和合理利用自然资源，治理被污染和被破坏的生态环境，恢复和重建受损的生态系统，实现保护环境与发展经济的协调，以满足人类生存和发展的需要。",
    "C_course-v1:ZJFF+000516+sp": "《商务礼仪》是浙江省高校精品在线开放课程，也是首批宁波市高校慕课联盟平台课程。课程中既有团队各位老师知识点的讲授，更有大量实操的示范及点评，使学员通俗易懂。有34个礼仪视频和对应章节练习。开设省市两个平台教学已经二年多，学生类型都是各高校学生，学生对该课程评价很高。",
    "C_course-v1:XJTU+COMP200853+sp": "在今天的信息化时代，计算机已成为了人类工作和生活中必不可少的一部分。计算机的主要应用方向之一是过程控制。工业过程控制的对象往往是一些连续变化的非电物理量，要使这类信号能够被计算机所识别和处理，需要经过一个复杂的过程。本课程面向有志于从事计算机过程控制系统设计、或对计算机硬件结构感兴趣的学习者，介绍包括计算机基础知识、微型计算机基本工作原理、存储器接口设计、输入输出接口控制技术等理论知识和设计方法，并最终实现简单I/O接口控制系统软硬件设计的初步能力。需要说明的是，随着计算机技术的发展，现实中更多情况下工业过程控制使用单片机技术更加适合，但考虑到我们日常见到和使用最多的计算机是微型计算机，建立微型计算机系统的整体概念，理解微型计算机的构成、工作原理、输入输出控制方法等，具有更普适的意义；并且，作为计算机的“微缩版”，单片机虽然在体系结构、指令集等多个方面与微型计算机存在较大差异，但许多的基本理论和控制方法是相似的。本课程所介绍的内容，将对进一步从事单片机技术、嵌入式技术开发，有着非常直接的指导意义。课程按周组织，共14周，涉及8个章节的内容，包括：微型计算机系统概述、微处理器与总线、80x86基本指令集、汇编语言程序设计、半导体存储器、输入输出和中断技术、可编程并行数字接口、模拟量的输入输出。",
    "C_course-v1:HAUT+2017070701X+sp": "有机化学是化学与化工专业的一门重要基础课，也是生命科学、医学、环境科学、粮食工程、食品工程、材料科学的必修课程之一。通过本课程的学习，要求学生掌握该课程的基本理论、基本知识和基本实验技能，为各专业学生进一步学习打下扎实的基础，是学习化学工程、生物化学、药物化学、油脂化学、食品化学、谷物化学等课程的基础。本课程的教学目标在于让学生能够牢固地掌握有机化学的基础理论知识，培养学生运用这些知识去解决相关问题的能力，培养自我获取知识的能力，进而培养学生的创新意识和创新能力。随着科学技术的不断发展和教学方法的改革，有机化学涉及的内容不断丰富和更新，因此，本课程的教学内容既融入学科前沿的科研与教学成果，又融入各专业特点；将研究性和问题式教学法渗透教学过程。本课程的主要内容包括：烷烃、烯烃、炔烃、脂环烃、芳烃、对映异构、卤代烃、醇酚和醚、醛酮和醌、羧酸及衍生物、羟基酸和羰基酸、胺和杂环化合物等。河南工业大学有机化学教学资源齐全，师资队伍较强，将精选教学内容，结合教学研究成果，利用现代教育技术，深入浅出地讲解，将带领你在有机化学的五彩世界里漫游，感受有机化学的魅力，深切体会有机化学在生活中的重要作用。",
    "C_course-v1:BNU+2017071001X+2017_sp": "通过环境地学原理学习，使我们了解地球环境系统的组成结构与性状特征，掌握地球环境系统物质能量迁移转化及其时空分异规律，其主要作用有：熟悉地球环境调查观测的基本方法，培养我们的综合思维与集成创新能力；为环境科学与工程学习、研究的奠定必要的地学基础；有利于开拓环境科学与工程的研究领域；也有利于和谐与健康地生活。课程考核方式：平时成绩100%",
    "C_course-v1:UESTC+2017071301X+sp": "本课程在学校讲授时间为30学时，其中理论基础16学时，实验课程14学时。内容包括嵌入式系统基础、嵌入式处理器、嵌入式操作系统、嵌入式软件开发平台、嵌入式Linux驱动开发，以及相应的实验内容。授课对象为专业型硕士，目前已开课5学期，每学期选课人数80左右。通过对该课程的学习，大部分学生能够建立嵌入式系统的概念，对相应的开发平台能够正确使用。如果再结合实验室有关项目，可培养出较为优秀的嵌入式系统工程师。",
    "C_course-v1:XJTU+PHLS100914+sp": "医学伦理学，是医学与伦理学的牵手。在珍爱生命、敬畏生命的伦理精神指引下，医学从洪荒时代冲破艰难险阻走到今天的现代医学。医生肩负着维护和促进人类生命健康的重任，优秀的医生必须是医德和医术的完美统一。医学伦理学，用伦理的眼透视人类所有的医学活动，它帮助我们，理解医学的人文性。",
    "C_course-v1:XJTU+C00204+sp": "课程内容： 本课分十个专题，分别介绍《周易》的思想、孔子《论语》的思想、老子《道德经》的思想，《大学》《中庸》的思想，《庄子》的思想，《孙子兵法》的思想，《墨经》的思想，《心经》的思想，以及朱熹理学的思想、王阳明《传习录》的思想。既有对儒释道经典的介绍，也有对理学、心学思想的阐释，以期以一种更广阔的视角看待中国传统哲学，让学生能够对中国传统哲学有一种全方位的认识。课程连续多次被Coursera评为最受中文学习者欢迎的8门课程之一。该课程项目出版教材《中国哲学经典著作导读》一部，发表论文多篇。以该课程为主体的《中西哲学经典著作导读》2014年被评为全国优秀通选课、陕西省级视频资源共享课。 ",
    "C_course-v1:GZHU+000001004+sp": "本课程为高校思想政治理论课程之一，为本科公共必修课，亦可作为专科层次的公共选修课，同时可以满足各层次、各年龄段学习者修学分和兴趣学习。本课程学习采用线上学习和线下学习（翻转课堂）相结合的方式，学期末给予学习成绩和修学证书。线上学习内容包括教学视频、教案、课件、资料视频、练习题、课内讨论、作业等，其中教学视频为三位主讲教师同时出镜的交互讨论式视频，内容上把教材内容体系转变为教学内容体系，把教学内容体系转变为具有逻辑结构的问题体系，再把问题体系落脚到价值观体系，这是教材内容的重构和创造性设计，有利于师生更好地把握教材体系和内容结构；同时重构了教学流程，改变了传统的教学组织形式。形式上借鉴“锵锵三人行”和“百家讲坛”的多种优势，为MOOC或SPOC教学的新探索。本课程充分体现教育性教学、实效性教学和发展性教学的教学理念，突出课程教学的认知目标、能力目标和情感目标。经过2个学年的实践应用，取得了满意的教学效果。",
    "C_course-v1:GZHU+136300904+sp": "死亡是什么？人为什么会死？人应该如何死？人临死会是怎样的心理？我们如何对待亲人的死？如何面对自己的死？对我们而言，死亡是那么的神秘而又恐怖。作为国内高校开设时间最长且最为系统的生死教育课程，主要涉及生死本质与尊严，死亡意识（畏死体验、死亡恐惧、濒死体验、临终心理），个体死亡（疾病、衰老、灾难），社会死亡（战争、贫穷、堕胎、死刑、动物生命权），生死两安（临终关怀、伤痛恢复、丧葬礼俗），死亡优化（安乐死、脑死亡与器官移植），自杀问题等内容。本课程以生死为核心概念，以当下生命为立足点，通过解除生死问题的神秘性，赋予生死问题以神圣性，旨在以死观生，优化自我生命。",
    "C_course-v1:BJTU+2017072501X+sp": "本课程讲述18世纪以来的工业革命的发展和重要领域的技术变革，总结前三次工业革命的历史经验，重点讲技术创新人物故事的技术人文历史、技术创新对社会影响的技术社会史，以及揭示为什么技术创新会发生的技术创新思想史。通过该课程给学生以启示，引发对历次工业革命的思考，展开第四次工业革命对人类的影响的学习与讨论。",
    "C_course-v1:NU+2017081001X+sp": "本课程高度概括了力学、热学、电磁学、光学、量子物理等领域的基本知识及其中蕴含的科学思想和科学方法，注意反映新的科技进展以及有关的社会问题，介绍物理学原理在文化、经济、政治、社会网络和科技等日常生活领域中的最新前沿应用。随着大数据和网络分析的不断进步，在公司、城市、国家及个人的很多方面，我们都将会越来越多地感受到物理学所起的作用及产生的影响。本课程旨在通过物理学的普及教育使学生获得逻辑思维能力、解决问题的能力和接收新事物能力等的熏陶，尝试用科学和发展的全新方式看待人类未来，引发对人类从何处来，将走向何处的深度思考。本课程无预修课程要求，数学仅限于初等数学（非常少量），特别适合人文、社科各专业以及希望对物理有一个宏观、总体了解的学生修读。考核标准：单元测验（20%）+期末考试（80%）学时：32学时",
    "C_course-v1:CQU+ICE20012+sp": "  通过本课程的学习和实践，使学生掌握逻辑代数的基本理论；理解门电路的基本特性；掌握组合逻辑电路、时序逻辑电路的分析与设计方法；掌握常见数字芯片的原理及其应用；了解脉冲电路的工作原理，存储器、A/D、D/A等大规模数字芯片的特点及原理。使学生初步理解运用数字电子技术解决实际问题的方法。 在教学中着重要求学生在掌握数字电子技术基本理论的基础上，理解常见数字芯片的原理及其应用，初步掌握利用中规模器件解决实际问题的方法，使学生具有一定的实践技能和应用能力，为以后的相关课程打下较坚实的基础。   ",
    "C_course-v1:SPI+40281x+sp": "本课程以欧姆龙CP1E型PLC为例，按照项目引导，任务驱动教学方法设计，内容包括6个项目，按项目任务对教学内容进行序化，以基于工作过程的思想组织，把PLC应用技术的基本知识及基本技能项目化和任务化，分解到6个项目21个工作任务中，每个工作任务技能训练项目中，将技能训练效果进行记录，并量化考核，使学生完成搜集资讯、计划、决策、实施、检查、评估一个完整的工作过程。将职业素质和职业道德培养落实在每个教学环节中，采用教、学、做一体化现场教学模式，使学习者在做中学，学中做，做学结合，在完成任务的过程中掌握PLC应用技术的基本知识，训练PLC的基本技能，培养学生的职业素质能力。通过一系列项目的学习与训练，使学习者逐步掌握欧姆龙CP1E型PLC控制系统设计、安装与调试。",
    "C_course-v1:SPI+20170828001x+sp": "   本课程从职业岗位要求出发，基于工作过程整合了传统《电机与电控》、《PLC》、《变频器》、《电力电子》、《自控系统》等课程部分或全部的理论和实践环节，成为装备制造类电气自动化专业的核心专业课程。    针对教学实施提供课程资源，针对学习提供学习资源，针对职业特性提供素材资源，资源的表现形式多样，实现共享。 本课程教学内容的选择结合电气类企业岗位需要，基于生产流程，以“任务驱动”形式，在教学实施过程中采用“资讯－计划－决策－实施－检查－评价”六步骤教学法，以学生自主学习为主，使学生有计划的学习，有目的的学习，有评价过程的学习，由简单到复杂的完成工作任务，，使讲授、示范、训练同步进行，通过若干实训任务完成技能训练，逐步形成职业能力。    具有教学目标定位准确；教学模式、方法与教学内容紧密结合；教学手段多样，教学资源丰富；实训条件良好；教师队伍结构合理等特点。    将实际案例引入教学中，每个知识点均与实际应用结合。采用案例教学法、启发引导法，通过精心准备项目内容，预设问题，引导学生思考、讨论，除了给学生必要的提示外，其他的内容留给学生自己查找相关资料，以减少讲课时间，提高教学效率，培养学习能力。    与国内同类课程相比，课程在教学理念、内容选取、内容组织、教学过程设计、教学方法应用等方面具有明显优势，处于同类课程建设前列。 考核方式：作业40%+期末考试60%",
    "C_course-v1:KMUSTX+8209001+sp": "许多人都认为市场营销学是一门很高深的学问，其实它就体现在我们的日常生活当中，只是我们从来没有认为它就是一种市场营销行为！营销真是无处不在。无论是有意识的还是无意识的，任何组织与个人都在从事着各种各样的市场营销活动。良好的市场营销日益成为商业成功的重要因素。市场营销对我们有着深刻的影响，它已经根植于我们的日常生活之中。在课程内容的编排上，按照市场营销学导论、市场调研、市场营销竞争战略、目标市场营销战略、市场营销组合（4P’s）策略等这样一个体系来安排，尊重市场营销学学科体系的完整性和系统性。理论讲授和案例教学相结合。体现出：市场营销学既是一门科学，又是一种艺术。课程讲授从生活中的市场营销案例或故事入手，反映出生活中的市场营销智慧，课程注重贴近人们的生活，增强趣味性。",
    "C_course-v1:EST+20170914+sp": "通过本课程的学习，使学生系统的掌握测试系统集成技术中的原理和方法。重点掌握程控仪器的一种数字接口；重点掌握仪器语言（SCPI），包括程控命令的句法、格式；重点掌握测量控制机设计技术；能够正确选择仪器和测量控制机并具有组建自动测试系统的能力；能够编制测试应用软件，并能进行实际操作。",
    "C_course-v1:MIT_SLT_Lab+161x+sp": "本课程探讨并介绍了在发展中国家这一背景下，规划并实施土地整备的过程。土地整备是一种土地征集方法，可以替代政府强制性购买(通常称为土地征用权)和自愿市场交易。在土地整备过程中，公共或私人机构邀请土地所有者成为再开发项目的利益相关者，并将其土地作为投资资本贡献给该项目。作为回报，该项目完成后，每个土地所有者将在原地点附近获得一块至少同等价值的土地。该地区的所有房产都征集好之后，将这些联合的土地进行再划分，从而为拓宽道路以及其他当地基础设施腾出空间。土地征集的传统方法经常引发各种冲突。通过这门课程，实践者可以对土地整备这种发展中国家实现城市化的替代方式有所认识，并为他们解决问题增加另一个可行的工具选择。土地整备已经展现出多种优势，包括对征集土地的初始资本要求低，能有效劝阻抵制者，而且减少了现有居民的大规模搬迁。如果在适当的时间和地点进行土地整备，那么在城市化发展迅速的国家，这种方式能够少出土地重新开发的阻碍。本课程的考核方式全部为选择题，分单选题和多选题，共计18道。",
    "C_course-v1:TsinghuaX+20220332X_1+2017_T2": "在中国近代史发展的进程中，日本超过世界上任何一个国家，成为了对中国影响最大的国家。日本文化对中国青少年的性格形成乃至文化认同感、价值观塑造方面所起到的影响不容小觑。从日本社会生活现象中学习并反观中国社会。重新认识日本国和日本人，从中日两国现代交往的种种矛盾现象中看清楚“岛国根性”与“大陆农耕民族”最根本的差异所在。对于一个国家的了解、与其交流或者认知，掌握这个国家、民族的文化甚至比单纯掌握这个国家的语言更为重要。在日语基础的学习过程中，比以往课堂教学更多地揉入对日本社会生活中的文化现象予以介绍和分析。",
    "C_course-v1:HEBUT+20170921001+sp": "工程图学是研究工程与产品信息表达、交流与传递的学问。工程图形是工程与产品信息的载体，是工程界表达、交流的语言，是工程技术部门的一项重要技术文件。本课程理论严谨，实践性强，与工程实践有密切联系，对培养学生掌握科学思维方法，增强工程和创新意识有重要作用，是工科本科专业必修的重要技术基础课程。培养使用投影的方法用二维平面图形表达三维空间形体的能力。培养初步的创造性构形设计能力。培养工程意识,贯彻、执行国家标准的意识。培养认真、严谨的工作作风。",
    "C_course-v1:JNUX+jnu05011190X+sp": "该课程是华文教育专业主干必修课程，是汉语国际教育专业、语言学及应用语言学专业特色选修课程之一。该课程以华文教育专业、汉语国际教育专业、语言学及应用语言学专业本科生为主要教学对象，也可供相关专业的研究生和海外华文教师修读。本课程主要学习内容包括：（1）了解华文趣味教学法的内涵、设计理念及依据。（2）掌握华文趣味教学的目的、性质、任务及原则。（3）对汉语趣味教学法有全面的了解，包括华文趣味教学法的类型、特点及目标。（4）掌握绕口令、儿歌、谜语、故事、古诗、做游戏、看图画画等华文趣味教学活动设计与选择的方法和原则。（5）掌握结合汉语教材语音、汉字、生词、句子、课文、课后练习等不同教学板块的特点或者听、说、读、写各项技能的训练有针对性地设计趣味教学活动的方法。（6）掌握华文趣味教学活动组织开展的基本原则与方法，组织并引导学生进行趣味教学活动实践。课程的主要教学目标是培养学生的实践教学能力，特别重视实践性教学环节的设计，采用教师理论讲授、代表性教学设计评析、示范教学过程观摩与讨论、教学设计与展示相结合的形式组织教学，从理论认识的形成，到用理论指导实践评析，再到教学设计实践，循序渐进，环环相扣，适合华文教育专业、汉语国际教育专业学员的认知、学习特点和该专业人才培养需求。学员在修读本课程后，均能形成就指定教学内容、教学对象及目标完成有针对性的教学设计和展示的能力。",
    "C_course-v1:SICT+2017092601+sp": "本课程主要面向高职院校移动互联网、物联网应用技术、软件技术等专业在校生，以及具有Java编程基础有意向从事基于Android的智能设备应用开发等相关工作岗位的上班族。通过教学视频、课件、测验及期末考核等形式使学习者能够掌握移动App应用的开发、测试及部署，从而能够从事移动APP和移动互联网产品的设计、开发、测试、发布、维护等工作岗位。课程分为七个单元：单元1 开发第一个Android应用程序）、单元2 界面编程）、单元3 深入理解Activity、单元4 使用Intent进行通信、单元5 数据存储、单元6 广播与服务、单元7 网络应用技术。1.课程考核模块说明 考核模块详细说明开放时间补充课后测试题（45%）课程7个单元，共30道题目，共45分。每讲教学视频之后题目全部为程序填空题，每题1.5分，出题范围在每章的教学视频中。课后测验是对于学习者对课程掌握程度的一种过程性评价，每个知识点后有一道程序填空题，需要在规定的截止日期前作答。若是自主模式课堂，则没有截止日期。期中测试题（15%）从前3个单元中知识点中设计出15个题目。第三单元任务二结束之后。题目包括单选、填空题，每题1分，出题范围在前三个单元知识点中。期末测试题（40%）从7个单元知识点中设计出20个选择题。7个单元内容全部讲完之后。题目包括单选、填空题，每题2分，出题范围在7个单元知识点中。2.获得课程证书满足条件 （1）四个考核部分无缺项；（2）四个部分总成绩≥60分。",
    "C_course-v1:SCUT+145055+sp": " 数据结构是计算机学科各专业的一门重要专业基础课程。本课程主要论述数据的逻辑结构、存储结构、算法设计以及算法评价四方面的内容，使学生对线性表、栈、队列、树、图等各种数据结构以及查找、排序等基础算法有深入的了解；还要求学生针对具体的工程问题，系统地掌握在不同的数据结构上进行有关算法设计的思想和技巧。数据结构是一门理论性和实践性都很强的课程。课程成绩考核：平时作业：100%；合格分数线：60分。",
    "C_course-v1:JNU+07009215+sp": "地球曾经是如此美丽，充满生机，曾给人类带来无限的希望。然而，为什么又说全球的环境恶化、生态危机已成为人类生存、发展的最大祸患？是什么原因影响了生态安全？全球气候变化给人类带来哪些不良后果？请跟我们一起走进“自然保护与生态安全：拯救地球家园”这门通识课程，一同来探索以上问题的答案。本课程要求学生掌握自然保护的基本概念和基本理论，了解我国自然保护的现状，熟悉全球自然生态保护的热点问题，培养学生热爱自然的情操，增强学生保护自然资源的意识，守护地球家园。本课程2014年评为全国大学素质教育精品通选课，2015年评为广东省精品资源共享课程。2016年“中国自然保护的发展”获第二十届全国教育教学信息化大奖赛微课一等奖，“生物多样性概述”获全国生命科学类微课教学比赛优秀制作奖，《自然保护概论》精品资源共享课程获第二十届全国教育教学信息化大奖赛三等奖。",
    "C_course-v1:SXPI+20171101002+sp": "高等数学课程是高职各专业的一门重要的基础理论课，它是研究物质世界中各种数量之间的最基本、最普通的关系。它是一切自然科学的基础，也是当今工程技术的重要依据。对高职高专院校的几乎所有工科专业而言，它是一门必要的基础课程。因此，高等数学教学应完成以下的任务：1、使学生较深入地、系统地掌握一元函数的基本知识。2、使学生掌握一元函数微积分的基础知识和常用的方法，并能处理常见的最基本的实际问题。3、使学生了解和掌握空间解析几何的基本知识。4、注重培养学生的多种能力（较准确的运算能力、一定程度的逻辑思维能力、空间想象能力，对基本的实际问题的分析与解决能力）和个人素质。考核：章节测验100%",
    "C_course-v1:YMY+20171108001+sp": "当你发生刷牙会流血，牙龈肿大、口臭、牙龈萎缩、牙齿对刺激的食物过敏等现象时，常因不会疼痛而忽略就诊，而导致牙齿缺失、牙齿松动脱落、增加全身疾病的发病率等。为了提高全民的口腔保健意识，让全民80岁以上都拥有一口整齐洁白、健康的20颗以上牙齿， 我国全民口腔健康教育已进行了近三十年，经过政府与社会的推动，国人的护牙意识显著提升。但由于城乡差异、自身预防意识以及饮食习惯的不同，一部分人群对口腔健康的关注不够，存在一定误区。俗话说“牙疼不是病，疼起来要人命”，口腔是消化系统的“门户”，口腔健康是全身健康的重要组成部分。世界卫生组织将口腔健康列为人体健康的十大标准之一，口腔健康的标准是“牙齿清洁、无龋洞、无疼痛感、牙龈颜色正常、无出血现象”。维护口腔健康是防控全身性疾病的重要手段，防治全身性疾病有利于促进口腔健康。口腔疾病可防可控可治，防控口腔疾病需要个人口腔维护和专业维护相结合，定期检查、及早防治是关键。考核方式：章节测试100%",
    "C_course-v1:TsinghuaX+20250064+sp": "本课程是电子技术基础的一个重要分支，是电气、电子信息类和部分非电类专业本科生在电子技术方面入门性质的技术基础课。课程主要内容包括半导体基础知识、放大电路基础、多级放大电路、集成运算放大电路、放大电路的频率响应、放大电路的反馈、信号的运算和处理、波形的产生和信号的转换、功率放大电路、直流稳压电源和模拟电子电路的读图等。本课程通过对常用电子器件、模拟电路及其系统的分析和设计学习，使学生获得模拟电子技术方面的基本知识、基本理论和基本技能，为深入学习电子技术及其在专业领域中的应用打下基础。",
    "C_course-v1:LZU+20171113+SP": "《室内花草栽培技术与装饰布景》是一门公共选修课，适合在校各专业的大学生修学。本课程是为了让学生了解中国的花文化，使大家掌握室内花草的种类与特点，熟悉花草栽培所用的各种容器、基质、工具、装饰材料等；掌握室内花草换土、去尘、配土、施肥、浇水、湿度控制方法及病虫害防治等基本技能；掌握不同功能的室内空间绿化装饰和绿化材料的养护与管理技术；重点阐述了环境与尺度的关系，空间与色彩，群植组合技巧，艺术栽培技巧，瓶景设计制作要点，立体栽培方法。组合栽培植物选择与栽培技术要点。以及室内植物摆放的风水学方面的知识。通过本课程的学习，让学生领略室内花卉的独特魅力，懂得花卉的性格和文化，科学合理的搭配栽培花卉、营造充满绿意的室内和谐环境。使学生既有一定的理论水平又具有绿化装饰室内的实践能力。在学习、工作闲暇之余，陶冶情操，培养积极向上的生活态度。",
    "C_course-v1:FAFU+20171121001+2017_T1": "寄生虫是一类对人和动物影响巨大的病原，有很多寄生虫都是人畜共患病原，可引起人和动物的寄生虫病。但很多人对这些病原及其造成的危害不甚了解。有必要开展《寄生虫与公共卫生》这门课程，向同学们介绍一些常见的寄生虫及其对人和动物的影响，进而引起人们对此类病原的认识，加强对自身的防护。本课程将向大家讲述寄生虫与公共卫生的概述、食源性寄生虫病、土源性寄生虫病、宠物源性寄生虫病以及旅游相关的寄生虫病。考核：章节测验60%+期末测验40%",
    "C_course-v1:WHUT+20171128+sp": "1.了解现代产品设计的基本特征与方法2.掌握产品开发设计的基本原则与程序3.重点培养学生系统思考问题及产品认识和创新的能力4.掌握产品开发设计的价值与评估方法",
    "C_course-v1:CUNY+20171211001+sp": "本课程主要在六个方面进行介绍：计算机网络基础知识－简短回顾；网络安全研究的是什么问题；编码解码学；网络安全协议；无线网络安全；防火墙及攻防系统。学员可以了解到网络安全的方方面面，掌握网络安全相关的知识。",
    "C_course-v1:TsinghuaX+Thesis2018+sp": "学位论文答辩环节是研究生培养的重要环节，为了充分发挥该环节的育人作用，搭建学术交流的平台，进一步保障和提高研究生培养质量，清华大学研究生院从2014年开始，从申请学位的博士、硕士研究生中选取了部分具有代表性的学位论文答辩进行录像，并首次将答辩视频上传学堂在线，获得了社会各界的认可和积极反响。2017年，清华大学继续这一形式，遴选不同专业的博士、硕士研究生的学位论文答辩视频，继续以MOOC形式共享呈现给大家，以使更多的人能够分享这些资源，搭建更为广阔的学术交流平台。如果这些视频能对您的学术研究有所帮助和启发，则是我们十分期待并愿意看到的事。",
    "C_course-v1:JNU+07040146+2018_T1": "细胞生物学是研究细胞生命活动规律的科学。早在1925年，生物学大师威尔逊就提出：“一切生命的关键问题都要到细胞中去寻找答案”。综观近50年来荣获诺贝尔奖生理学或医学奖和化学奖的重大突破，有70多个与细胞生物学密切相关。细胞生物学对生命科学的发展产生着巨大的推动作用。暨南大学细胞生物学课程是支撑生命科学与技术国家级实验教学示范中心、生物技术国家级特色专业、广东省特色专业和名牌专业的基础主干课程，课程拥有一支由5名教授和2名副教授组成的高素质教学团队。在《细胞社会的奥秘》这门课程里，我们将从细胞的内部社会结构、细胞的内外社会联系、以及细胞的整个生命历程等层面，通过细胞社会性和网络化新视角，对细胞生命活动的复杂机制进行解读。课程不仅阐释细胞的基本结构、基本功能及分子调节机制，而且描绘细胞生、老、病、死等生命状态和稳态与变异的内在决定性。我们希望融会细胞学理论与实践应用、基础知识与前沿进展，带领同学们进入丰富多彩的细胞科学世界，激发探索生命奥秘的热情，培养同学们的创新精神。",
    "C_course-v1:RiceX+Phys102x+sp": "PHYS_102x 课程是电磁学的导论，按照标准的大学第二学期物理课进行安排。其开篇为物质中的电荷、电荷间的作用力、电场、高斯定理和电势等内容。还会讲到电流和电阻，之后是介绍电阻器、电容和直流电路。本课程还会涉及磁场、安培定律、法拉第感应定律。最后是电感器和交流电路等内容。PHYS_102x 课程包括每周约两小时的视频讲座、每周的在线作业题、一页同行评估的设计项目和两次在线考试。课程为期12周，但是在进行考试的两周时间，不会安排新的课程或作业内容。建议学生每周坚持学习，每周在课程内容方面估计需要10－12小时。PHYS_102x 课程将包括下列内容：视频讲座和讲座问题、作业问题、期中和期末考试、在线讨论论坛PHYS_102x 课程针对的是有着宽泛背景和能力的听众，从感兴趣的高中生到中断学业后再度学习的人均有涉及。本课的先修课程是微积分和入门级力学。",
    "C_course-v1:MITx+2_03x+sp": "这门入门课程和M.I.T.普通课程一样严谨。这是M.I.T.机械工程本科生第一科目中的其中一门。 通过这门课程的学习，学生将会学习分析、预测物体和系统的动态行为、它们的运动轨迹、相关的力，同时也将了解工程实践所呈现的错综复杂的机械系统。学生也将分析机械装置的动力学，掌握物体在旋转过程中的扭距及角动力，了解旋转系统中的不平衡。最后，学生还将运用运动的非线性方程解释各种机械系统，通过用MATLAB、绘图中的数值方法解决问题并解释结果。 这门课程将精确和现实巧妙结合，在可操作、娱乐的形式中培养学生最基本的技能。 课程开始前，你可以尝试新的edX Demo，来感受有趣、互动的学习环境以及虚拟的实验室。学习更多。",
    "C_course-v1:UC_BerkeleyX+CS169_2x+sp": "CS 169.2x是加州大学伯克利分校长达一学期的工程软件即服务课程的第二部分。在第一部分CS 169.1x中，学生利用敏捷开发方法在云上配置了一个简单的SaaS应用程序。在第二部分CS 169.2x中，学生将会通过在模块中添加关系来创建更复杂的应用程序，并通过JavaScript来完善应用程序。学生还将学习当应用程序真正分配给用户后将会发生什么，包括如何监测性能，如何发现常见性能问题并尝试解决，如何避免危害到客户数据。最后，学生将会学习如何应用敏捷技巧来提升和重构遗留代码，这是专业程序员的必备技能。其他内容还有：如何构建、组织和管理小型编程团队设计模式是什么，如何发现应用设计模式的机会使用Rails的高级功能，如第三方认证和SaaS中经常出现的设计模式三项家庭作业：两项编程任务，一项操作/发布任务还有几个小测验。课程视频和作业已于2013年10月进行修订课程形式？课程由8到12分钟的讲课视频构成。其中一些包含配套的“自我检验”问题。还有编程作业和讲课视频外的单独测试/小问题。如何了解更多课程内容？请观看此页上的视频。视频字幕是否可下载？是的。字幕可以下载。是否需要同步观看视频？不用。可以按自己的时间观看。我需要下载什么软件吗？你需要准备包含我们提供的镜像的虚拟机。你可以下载这个镜像，然后在任何的基于Intel x86的电脑上用免费的VirtualBox（virtualbox.org）软件进行运行。或者，你可以根据我们提供的教程在亚马逊弹性计算云上进行配置。请在VM教程中下载虚拟机和查看运行指令。课程使用的Ruby和Rails版本是？请在http://beta.saasbook.info/bookware-vm-instructions上下载包含所有可见的虚拟机镜像。你可以下载这个镜像，然后在任何的基于Intel x86的电脑上用免费的VirtualBox（virtualbox.org）软件进行运行。或者，你可以根据我们提供的教程在亚马逊弹性计算云上进行配置。我们一般使用Rails 3.2和Ruby 1.9.3，但是也会使用其他预装工具。你将学到： 如何通过在模块中添加关系来创建更复杂的应用程序，并通过JavaScript来完善应用程序； 当应用程序真正分配给用户后将会发生什么，包括如何监测性能，如何发现常见性能问题并尝试解决，如何避免危害到客户数据； 如何应用敏捷技巧来提升和重构遗留代码。",
    "C_course-v1:cup+20180130+sp": "  《催化剂设计与制备》是为研究生开设的主干课，主要面向石油化工、煤化工、环境化工、物理化学以及应用化学方向的研究生。目前，全球化工产品的生产，80%以上的化学反应过程都需要催化剂。学习和掌握催化剂的设计和制备方面的知识，能够为研究生日后进入化工行业从事相关的技术性工作提供知识储备和技术指导，也能为从事催化相关（能源化工、有机化工和环境保护）基础研究的研究生提供理论和技术指导。  主要内容包括：催化剂设计的原则、催化剂制备方法（沉淀法、溶胶凝胶法、浸渍法、溶剂热（水热）法、熔融法、涂层法、微乳法等）、催化剂的成型方法。  通过本课程系统学习，要求学生全面掌握催化剂设计和制备的基本原则和方法。1. 认识和掌握固体催化剂设计的基本思路和方法。2. 掌握固体催化剂制备的方法和基本原理。3. 掌握氧化物催化剂、负载型催化剂、分子筛催化剂等常用工业催化剂的设计与制备方法。4. 掌握通过分析催化反应的基本原理进而设计和制备催化剂的方法。",
    "C_course-v1:XIYOU+20180208+sp": "编译技术是计算机科学与技术专业研究生重要软件理论课程，培养学生解决问题的思路和抽象思维的方法。通过本课程的学习使学生对高级语言程序的编译过程及其原理有较全面的了解，从理论和实践上掌握高级语言程序翻译的基本原理，具有系统软件翻译开发的能力，为进行其它软件设计打下良好的基础。 《编译技术》课程的成绩评定及证书要求1.完成课程所有的学习内容、视频、课件，并在课程“讨论区”中积极发贴和回贴；2.完成课程中每一章的自测练习与单元测试，占总成绩50%；3.完成2018期末考试，占总成绩50%。总评成绩60~79分可以获得课程主讲教师签名颁发的电子版合格证书，80分及以上可以获得课程主讲教师签名颁发的电子版优秀证书。如果需要纸质版证书的学员，需要付费购买课程。",
    "C_course-v1:GZLIS+070200140+2018_T1": "《印刷色彩基础与实务》是印刷类专业的一门核心课程，为后续专业课程学习奠定必备的颜色理论与基础技能。主要内容包括：1.颜色如何形成？有何特点和规律？2.颜色有何属性？如何表示？3.印刷颜色如何形成？有何特点和规律？4.如何辨识与调校印刷品颜色？5.如何调配印刷专色？6.如何测量与评价印刷品颜色质量？。每个学习情境均以问题为线索、以典型案例或项目训练为引导，将从事印刷生产与管理所需的颜色理论与应用技能融入到各个情境之中。做到复杂内容简明化、深奥理论通俗化、抽象概念形象化、操作技能步骤化，易学、好学、实用。",
    "C_course-v1:TsinghuaX+00670122+sp": "<h3>课程简介</h3>中国文人生活的厅堂之雅，在宋代已形成“文人四艺”的琴棋书画，和“生活四艺”的插花、点茶、焚香、挂画。经过数千年的传承与发展，生活四艺不仅是技艺，更可从中领悟人与天地自然合一之妙，体验一种智慧、高雅、优美的生活方式，借以修身养性，渐而入道。  生活美学系列课： 1. 插花之道：以插花为主线； 2. 花香茶之道：延伸到园艺、香之道、茶之道，以及礼仪化妆等内容。课程将邀请有关的业内嘉宾，以及爱好者一起来互动与分享。授课教师 主讲：刘惠芬 特邀嘉宾： 张智慧： 清华大学土水学院教授普洱茶的生活潘江琼： 清华大学园林工程师清华园景观植物介绍沙垚： 清华大学学生茶文化协会创会会长品茗美学罗子杰： 中国非遗协会香文化委员会副主任沉香与香席高佳逸： 中国非遗协会香文化委员会委员沉香与香席冷帅： 北京天福茗茶文化中心文化总监评茶与品茶张琳： 北京同可轩茶艺师评茶与品茶陈晨，佳丽宝化妆品培训经理化妆技巧与实操赵清华，佳丽宝化妆品培训经理化妆技巧与实操张东，佳丽宝化妆品彩妆师化妆技巧与实操张海静：深圳公务员香烛DIY  田慧： 北京IT从业中国十大名花体验Elizabeth Gasson：英国剑桥大学博士生英式下午茶体验邓俊辉，清华大学计算机系副教授书法作品高榕：书法作品蒋茹茹： 清华大学新闻与传播学院学生书法作品施文迪、刘书田、范煜群、孙子涵、冯真真、吴淑平、田力等： 清华大学在校生课程互动慕课设计制作 编导：刘惠芬 助教：马思冰，施文迪，王馨逸，张蓉 资料：张然然，刘梦洁，宋钰，马姚姚，孙子涵，范煜群，杨茂艺 录制：王建一，李御龙，韦颔龙，吕子涵，田力，刘新华图像与动画：马海博，范雅頔，高天仪，刘明惠 清花道编辑：饶饶，张然然，孙滢滢，刘梦洁，刘书田 清花缘书法：李哲，朱旭，蒋茹茹，安小展  线下活动：邱静，毕鲜荣，年英梅，饶饶 特别致谢原创图片分享： 清华大学教师摄影协会： 吴倬，郭泓，景纬，张军生活美学慕课花友： 何柳霓湖南青竹天津静文武汉陈纯丁厦门张小梅西安李月星西安冯真真北京感谢清华大学教工摄影协会的支持！ 感谢“现代生活美学”选课同学的互动参与，作品分享！ 感谢慕课学员们的互动参与，作品分享！ ",
    "C_course-v1:PasteurX+96008+sp": "结核病在千百年来一直是人类的灾难。在18和19世纪，结核病被称为白色瘟疫，在欧洲的一些国家和美国造成20%甚至更多的死亡率。今天，在所有传染病中，结核病仍然是最大的杀手，甚至超过了艾滋病毒和疟疾。据世卫组织称，2015年有近1040万例新的结核病病例，大约180万人死于该病，使其成为全世界10大死亡原因之一。尽管计划在未来几十年内将其消除，但目前每年的发病率仅下降1.5%左右。部分问题是这种疾病的性质：它需要几个月的时间来发展，需要数月的多药化疗才能治愈。它也可以潜伏数十年后出现严重疾病。另一个问题使结核病更难治愈，这就是人为因素导致的耐药性和多重耐药性。为了提供最新的疾病概述，巴斯德研究院和深圳市南山区慢性病防治院（NanshanCCDC）合作打造了一个专门针对结核病的 MOOC课程。本课程将提供一个知识库，囊括从结核病的基础知识到目前关于结核病各个方面的现状：临床图片、流行病学、儿科结核病、影响疾病易感性的因素，包括艾滋病",
    "C_course-v1:LUIBE+2018030701+sp": "本门课程以元认知心理干预技术的视角，科学地解释了大学生常见的心理问题与心理障碍，以及天才灵感状态与优秀人格的心理结构，提升大学生对潜意识心理过程的自我认知、监督、反思与调控能力，即元认知智慧。从而切实提高大学生心理健康教育的实效性。",
    "C_course-v1:JNU+03010100+sp": "在创建和谐社会的当下，家庭和谐社会才能和谐。本课程以婚姻法为基础，运用法律思维揭开婚姻的面纱，剖析现代婚姻家庭的法律关系（人身关系、财产关系）和情感关系，并以法律思维使各家庭成员在人身、财产、情感这三者间形成良性互动，以此实现“平等、和睦、文明”的婚姻家庭关系。本课程旨在让学生掌握婚姻法知识的同时，并能运用法律，让理性的法律在丰富的情感世界里展现出它的魅力。",
    "C_course-v1:TsinghuaX+2018032801X+2018_T1": "本课程以小程序实战项目为出发点，由浅入深地讲解微信小程序的基础知识和开发技术，包括小程序的基本概念和框架结构、数据绑定机制、模版化与模块化、数据缓存、常用组件和API以及全栈应用开发等。学习者可以通过“学中做”和“做中学”，掌握小程序的基本原理和前后端开发的实用技能，开启自己的小程序开发和上线之旅。",
    "C_course-v1:dlmu+20180330+sp": "   《实用绳结技术》是一门具有航海特色的实践性课程，它适用于所有专业的学生。对于非航海类学生，可以作为通识教育类选修课，通过学习学生能够了解绳结历史、绳结的日常应用及绳结艺术，了解航海文化，培养学生实际动手能力，树立学生实践意识；对于航海技术专业学生，该课程能够使学生掌握船舶水手工艺的基本操作知识和技能，增强实际动手能力，树立实践意识，培养海员素质，为以后上船工作打下良好基础，以适应海船工作需要，保证船舶安全。",
    "C_course-v1:dlmu+20180403+sp": "   我国航海高等院校从60年代初设置了《轮机自动化》课程，大连海事大学《轮机自动化》课程已具有五十余年的悠久历史，所编教材一直是全国通用教材。该课程是面向轮机工程专业学生开设的一门主干专业课，是我校最早实现CAI教学的课程，2005年评为国家级精品课程，2013年评为国家级精品资源共享课程。同时还完成了20多项国家级、省级及校级教改项目。积极吸收消化国外相关教学设备制作技术，实现轮机自动化设备，成套装置，综合系统，软件模拟制作等全面的自主创新，所取得的教学成果在国内外40多个院校的相同或相关专业中进行了成功的推广应用，引领国内轮机工程领域的教学改革，推进轮机工程自动化课程实验设备的更新换代，相关成果于2013年获得了国家级教学成果二等奖。",
    "C_course-v1:QHU+20180419+sp": "本课程为人文素质选修课，共有丝路与丝路南线、丝路南线民间文学的基本知识、丝路南线上的多民族神话、神话符号在丝路南线上的衍化、丝路南线上的民间传说、丝路南线上的民间故事、丝路南线上的民歌“花儿”、丝路南线上的民间谚语八章内容。",
    "C_course-v1:HNU+20180424001+2018_T1": "本课程旨在帮助学生从整体上把握马克思主义基本理论，从而把握人类社会发展的基本规律，以树立正确的世界观、人生观和价值观。教学内容主要有：物质世界及其发展规律；认识世界和改造世界的规律；人类社会及其发展规律。",
    "C_course-v1:MIT_SLT_Lab+162x+2018_T1": "你如何判断一个计划中的地产项目是否有社会责任感？你如何判官地产商是否有效使用了社会影响评估（SIA）和环境影响评估（EIA）这些工具并进行了公众咨询？ 通过本课程，你会学到如何评估一个地产项目和项目开发过程是对社会负责的，可通过使用社会影响评估，环境影响评估和公众咨询来达成。本课程还能帮助学生建立自己的一套原则来判断对社会负责的地产项目要满足哪些条件。本课程由一位在麻省理工学院有45年以上教学经验的教授传授，运用了实际案例学习方法。本课程为地产商和市政规则者提供了新的机遇，让他们了解社会影响评估，环境影响评估和利益相关方的参与咨询对在世界各地建设的有社会责任感的地产项目都起到了关键作用。通过学习本门课程，你将——掌握有对社会负责的房地产项目的关键要素；掌握社会影响评估和环境影响评估的理论和实践要素；运用社会影响评估和环境影响评估的基本原理来分析大型地产开发项目；总结出自己的对社会负责的地产项目的原则和实施策略；认识到社会影响评估和环境影响评估如何为地产项目中各利益相关方创造价值。    ",
    "C_course-v1:JNU+07009188+2018_T2": "力学是古老而又年轻的专业学科，在整个人类科学与技术发展历史中起着重要的支撑作用，几乎所有科技分支学科均是在力学基础上建立发展起来的。力学作为人类必备“文化素养”知识，在众多现代生活—日常生活、工程技术领域和社会经济运行中应用极其广泛。 本项课程针对非力学专业本科生及从业人员，首先从总体上介绍力学在认识自然(包括天地与宇宙人生)和现代生活（日常生活、工程技术和社会经济运行）中的作用，然后回顾人类科技发展历程及其启迪—科学技术.vs.力学发展，包括中国的历史贡献与当今科技发展水平，激发学生崇尚科学并为实现中国梦而努力奋斗的精神。随后，课程针对人类生活所处的“静态、动态、流体”三大基本力世界，围绕现代生活常见的力学知识和普遍关注的力学技术，包括航空航天、地震、材料工程、振动与噪声控制、文学与体育等领域涉及的力学问题，着重讲解“静力学、机械振动与声学、流体动力学”的简单力学研究模型、基本概念、基础理论、技术原理和计算分析方法。通过课程讲解与学习者学习，将使学习者能够掌握现代生活中的基本力学及相关科技知识，从而能自主地解释自然现象与工程科技问题，促进对科学人生的兴趣与追求。总体而言，本在线课程的教学目标是：为学习者提供力学启蒙教育、 提升力学文化素养、拓宽专业知识面并实现学科交叉渗透，从而为学习者开启科学人生之路，最终提高综合素质、创新思维能力和现代生活品质。",
    "C_course-v1:JNU+2018012501X+sp": "民法是从日常生活中抽象出来的法律规则，是民事领域的基本法律规范，是社会生活的基本准则。它关系到“人”的生活的方方面面，提供着“从摇篮到坟墓”的全面保护。生活中大大小小的烦恼，交通事故中的损害赔偿，职场中的性骚扰问题，改嫁女的土地承包经营权纠纷，生活中遇到出租车拒载、酒楼收取开瓶费等等不合理要求，朋友借钱多年催要仍不归还的苦恼，又或者楼上住户空调滴水等等，这些问题应如何轻松应对，都可以在民法中找到依据。《民法与生活》课程，以典型案例展示作为切入点，介绍案情，评析案例，重点讲解民法的基本概念、基本制度和基本理论，为您展开了一幅内涵丰富的权利体系图谱。包括生命权、健康权、身体权、姓名权、名誉权、肖像权、隐私权等人身权利，也包括所有权、抵押权、质押权、留置权、建设用地使用权、宅基地使用权、地役权、集体土地使用权、合同权利等财产权利，还包括当前述各项民事权利受侵害时侵权法提供的保护和救济。同时，课程注重剖析和解读民法所蕴含的私法精神、契约理念、诚实信用等理念。在《民法与生活》课程中，我们不仅能够找到自己的权利，更能学会如何去主张权利，并尊重他人权利。孟德斯鸠曾说：“在民法慈母般的眼里，每个人就是整个国家。”在民法的保护下，我们最终不仅实现自我的自由，而且在诚实信用和公序良俗等原则的指引下，发展为崇德向善的权利主体。",
    "C_course-v1:SCUEC+0171229001+sp": "精选核心知识点，从历史、方法、研究主题、应用四个方面对普通心理学的主体内容进行了讲解。帮助学生掌握心理学发展历史，从纵向角度建构心理学知识脉络；从研究方法入手，让学生感受心理学的科学魅力；从认知、社会性发展两个方面串联知识点；从对个体认识自己角度出发设计心理学应用知识内容。课程内容的凝练能够让心理学初学者走进心理学殿堂，感受心理学的精彩。",
    "C_course-v1:SCUT+145033+sp": "(1) 了解计算机网络和互联网络的发展历程，掌握计算机网络的基础知识、基本原理和重要的协议。以层次模型为线索，将内容有机地串在一起；主要包括网络相关术语和协议（TCP/IP协议）、网络标准、OSI参考模型、局域网技术（重点以太网）、物理层、数据链路层、网络层、传输层和应用层的基本功能和基本原理；重点学习网络层内容，包括各种路由协议的工作原理及其特点。(2) 要求学生在学习上述理论的基础上，初步培养网络编程、网络抓包工具使用、交换机和路由器操作等实际动手能力。",
    "C_course-v1:NJU+2018032001X+sp": "心理学很神秘？你会发现，只要有人的地方，就有心理学！心理学很深奥？你会发现，似乎每个人都是大众心理学家，谁都可以说点“心理学”。 的确，我们生活中处处都是心理学！但这门课程却要告诉你，我们常常挂在嘴边的“心理学”绝大部分是错的，剩下的一小部分也是不全面的。 所以如果你愿意，从现在开始，你可以和我一起去看看你的生活中，究竟有哪些有趣的心理学现象，让你自己看到一个丰富多彩的生活世界。我将用最生活的语言，教会你最专业的心理学知识，和你一起探索色彩的意义、发现记忆的秘密、揭开人格的面纱、勾勒情感的轮廓、解释人类的行为。  让我们一起用独具的慧眼看到一个与原先完全不同的生活世界！",
    "C_course-v1:Stanford+WomensHealth+sp": "本课程对妇女健康和权益进行综述，从婴儿阶段、儿童时期，再到青少年、生育年龄到老年阶段均有涉及。我们考虑到经济、社会、政治、人权等方面因素，以及女性在面对社会压力和阻碍时，为维持健康状况和掌控生活所面临的挑战。我们关注的是关键性内容，即对女性生死攸关的内容，这取决于她是否可以行使人权。这些关键性内容包括：生为女性及所受歧视、贫穷、受教育、获取食物、工作报酬和健康医疗等机会的不平等，以及各种形式的暴力。涉及的内容包括重男轻女、教育、HIV/AIDS、生殖健康、家庭暴力、战争暴力、难民环境、女性工作、性交易和老龄问题。我们的大型开放式网络课程(MOOC)特别关注创建相关学生的国际网络。我们将让学生参加互动式讨论，参与合作练习，并分享各自的经验体会。我们还让学生参与到各自所在的社区，以便加深对所学内容的理解，并使得学术理念和现实生活的具体实际相联系。",
    "C_course-v1:NJU+2018032002X+SP": "这门课的名字叫“手把手教你心理咨询”，但并不是要教你成为一名心理咨询师，而是要帮助你了解心理咨询、懂得心理咨询。并且手把手地教会你，将心理咨询的很多技巧和方法运用到你的实际生活中去，让你的生活变得更加和谐、更加精彩，所以这门课其实是向你讲授“谈话的艺术”。因此，这门课当中的所有情景展示都是基于我们日常生活中的谈话，而并非是真正的心理咨询。其实，这门课要告诉你，心理咨询并不是什么神秘、高深的技术，只要愿意学习，你也可以掌握其中的基本方法；只要运用得当，你会让你自己和你身边的人从中受益。",
    "C_course-v1:BerkeleyX+CS169_1X+sp": "CS169.1x讲授设计可持久化软件的基础知识，利用敏捷开发技术以及 Ruby on Rails 来开发云服务(SaaS)。 学生们将了解SaaS对抗成品软件的新挑战和机遇。他们将了解并将基础编程技术应用于一个简单的 SaaS 应用的设计、开发、测试及公共云部署。学生们将使用同类最佳的工具，支持行为驱动设计、用户故事、测试驱动开发、快速及结对编程等现代开发技术。学生们将学习如何利用元程序设计和反射机制等现代编程语言特性提高编程效率和代码可维护性。 学生们将进行每周编程项目和测验。成功完成作业且分数合格者将获得荣誉证书。 本期课程将使用2013年10月修改后的全新视频、两项新课外作业和全新考题。 学堂在线对此门课程进行了完全的汉化，包括中文字幕、中文习题等。同时清华的助教将全程进行中文答疑和辅导。",
    "C_course-v1:NJU+37204001+2018_T3": "哲学在希腊语中是指“爱智慧（philosophia）”，爱因斯坦将哲学称作“全部科学认识之母”，也有人说哲学是“一切学问的学问”。古今中外的先贤们的智慧凝结在这样一门独特的学问中，任何人都应当学哲学、用哲学。1920年，中国第一位哲学博士刘伯明先生创办了南京高等师范学校哲学系。南大哲学系至今已走过了近百年历程，汤用彤、宗白华、方东美、唐君毅、牟宗三等大师和著名学者都曾在此任教，改革开放的理论先声《实践是检验真理的唯一标准》也从这里诞生。今天的南京大学和南大哲学系有着最优质的办学环境和教学资源，在这里学习哲学绝对是难得的体验。本课程将重点围绕哲学的一些基本问题和南大哲学史上许多重要哲学家的思想历程，为学生展现一幅全面、系统、生动、丰富的哲学专业地图，澄清社会上流行的对哲学认知的偏见和误区，帮助大家正确地认知哲学专业和南京大学哲学系在中国近百年思想史的重要地位，积极提升学生的哲学素养和综合素质，为同学们的自由全面发展提供一个高水平的导学平台。  因此，本课程主要围绕三个核心内容展开集中讲授：一、何谓哲学？哲学的作用是什么？  通过这部分的学习，使学生形成基本的哲学认知，真正领略哲学的魅力；二、哲学基本问题本部分将分别选取马克思主义哲学、西方哲学、科学哲学等领域的几个基本问题，帮助学生学会如何进行哲学思考；三、南京大学历史上的伟大哲人本部分主要介绍南京大学哲学系的百年历史以及南哲历史上所涌现出来的伟大思想家，引导学生认识到南大哲学与南大哲人是如何与民族共思考、与国家共命运的。        ",
    "C_course-v1:CSU+210102T10+sp": "大学生心理健康教育是面向大学生开设的一门公共必修课程,属于思想政治理论课系列的文化素质课程。本课程旨在促进青年大学生顺利适应大学生活，增强心理保健意识，为把大学生培养成新时代创新型人才打下良好的心理素质基础。叶湘虹博士和唐海波博士用40个视频，带领你学习绪论和八个专题内容，在心理健康的海洋里遨游。本课程会让你在了解绪论大学生心理健康标准的基础上，学习1.自我意识发展，2.情绪情感调节，3.人际关系调适,4.性心理与恋爱心理维护,5.学习与创造心理，6.健康人格塑造，7.生命教育与心理危机干预，8.大学生生涯规划等八个专题内容，掌握基本的心理调适方法与技能，充满智慧地面对压力重重的现实生活，协助你活出多彩而满意的人生。英国哲学家怀特海说：中学生，他们需要伏案学习；大学生，他们需要站起来四面观望！本课程将为你拨开迷雾，引领航程，协助你站起来四面观望，活出精彩人生。",
    "C_course-v1:CSU+2018020201X+sp": "本课程是大学生提升国际视野和跨文化交流能力的有益阶梯！本课程按主题分模块与你共同探讨英语学习之道。课程内容围绕16大主题展开：大学生活、快餐世界、健康习惯、个人英雄、双语教育、爱情婚姻、金钱问题、太空奥秘、移民问题、灾难应对、书香校园、全球通用语、竞技精神、乐享极限、基因与人格、多样化交流。每个主题的学习包含主题语块（Lexical Chunks)、常用句型（Sentence Patterns）、语篇逻辑（Discourse Logic）和主题探究（Subject Matter Inquiry）等模块，从语言知识传授，到思维逻辑训练，再到思想内容提升，环环相扣，步步晋升。",
    "C_course-v1:CSU+210201T10+sp": "本课程为我国普通高校大学本科学生必修的一门公共课，担负着塑造大学生正确历史观的重任。课程主要讲述近代以来影响中国历史发展进程的重大事件，剖析近现代中国政治兴替背后的原因，探寻近现代中国政治演进的规律。以历史文化培育大学生的民族自尊心和国家认同感；以历史文化提升大学生对现实政治制度的认同度。<u>课程特色</u>：第一，教学体系的专题化。我们在统编教材内容中概括出十个专题，形成了以问题为导向的专题式教学内容体系。第二，教学内容的鲜活性。湖湘地区是中国近现代史展开的重要舞台，我们充分挖掘出近现代湖湘地域史资料，将地域历史资源融进专题教学中，以案例的方式增强教学内容的鲜活性。第三，教学方法的现场感。主讲团队利用学校周边丰富的历史文化资源，在部分课程内容中采取“革命遗址现场教学法”，即到历史现场讲解历史，增强了教学的情境感和感染性。",
    "C_course-v1:NCEPU+20180628001+2018_T2": "自动化专业概论是面向具有工程化背景专业的一门专业综合基础性质的必修课程，是本科生进入大学进行工程类专业学习和接触的第一门专业基础课。通过本课程的学习，目的是使学生从自动化、自动化科学与技术、工程实际中的自动化设备及装置等方面了解工程类相关专业尤其是自动化类专业的有关问题，为进一步的专业课程学习开辟出一条直达顶峰的路线，为今后的学习指明方向。树立正确的工程专业思想和学习观，为今后在校学习，激发自己的学习潜力，打下良好的学习方法，使学生了解工程类专业的性质、特点以及自动化技术在工程实际中作用和地位，了解工程化类专业的培养目标和教学内容。   从工程实用的角度讲述了自动控制理论所需要解决的问题：包括被控系统的数学模型（差分模型、微分方程模型、传递函数模型）；作为自动控制理论的数学工具，讲述了简单而实用的控制系统数字仿真方法（数值解）以及最优化技术与方法（穷举法以及智能优化方法）；在此基础上讲述了自动控制系统结构设计方法及动态品质指标计算、系统建模理论与方法、PID控制律的作用及其应用方法、并对新型控制策略（自适应控制，预测控制，模糊控制）进行了关键点介绍。   从自动控制系统工程实施的角度讲述了过程参数检测方法，控制装置与系统发展过程及其应用。   从自动化学科发展所面临的工程问题角度讲述了物联网与云计算、数字化工厂、新型检测技术与仪器。自动化专业概论从教育部要求设立开始，已经有了将近10年的发展，针对不同工程类专业背景出版了两部教材，课程的设置按照教材内容并契合自动化专业的发展。   科学技术的发展源于多学科的融合，自动化学科是多学科交叉的产物，它又服务于其他的工程学科。因此，自动化专业（学科）概论对于从事其他工程学科的学生、教师、工程技术人员也都是有帮助的。",
    "C_course-v1:BJTU+2017052601X+2018_T2": "本课程讲述18世纪以来的工业革命的发展和重要领域的技术变革，总结前三次工业革命的历史经验，重点讲技术创新人物故事的技术人文历史、技术创新对社会影响的技术社会史，以及揭示为什么技术创新会发生的技术创新思想史。通过该课程给学生以启示，引发对历次工业革命的思考，展开第四次工业革命对人类的影响的学习与讨论。",
    "C_course-v1:CCI+ccioo1+2018_T3": "为支持公益性医疗事业的发展，完善医学知识体系，向广大在校学生和社会学习者以及医疗工作者传递心血管疾病临床科研现状为医疗从业者提供临床创新指引，开拓心血管医学临床创新的发展。",
    "C_course-v1:ZUELX+B0601353+2018_T2": "你想成为优秀的管理者吗？你在为如何激励员工而烦恼吗？你想有效管控下属行为吗？你在为如何打造一支高绩效团队而发愁吗？欢迎来到《组织行为学》MOOC课堂，王淑红副教授将以清晰的逻辑、生动的案例、风趣的语言带你来一段“烧脑”之旅，一起来解开管理情境中员工行为背后的密码！",
    "C_course-v1:ZUELX+B0800280+2018_T2": "内部控制与风险管理是重要的管理活动，现代企业内部控制已由单纯规避损失的传统风险管理转向能够创造价值的全面风险管理。有效的内控体系能将企业战略、管理理念、控制要求全面融入公司治理、企业文化、岗位授权、制度规范和操作流程，通过风险分析及应对、缺陷改进等，推动企业管理水平的全面提升。",
    "C_course-v1:TsinghuaX+20430054X1+sp": "这是物理学科本科理论物理的四大力学中唯一的一门涉及基本相互作用力的课程，也是物理本科阶段最难（没有之一）的课程，无数学物理的学生在这门课上留下了一辈子都抹不掉的深刻记忆。其难点主要在于大量地使用数学中的以微积分为基础的场论，特别需要求解各种偏微分方程组，要把数学和物理有机地结合起来。电磁相互作用是从原子尺度一直到宏观尺度，控制物质形成及其运动的最基本的相互作用，由此成为我们生活周边绝大多数现象的物理基础。本课程是介绍在宏观尺度下电磁作用的基本现象和规律。它和很多物理学的前沿进展有着内在的联系。很多更高级更深入的物理学课程及很多以物理为基础的工程性和应用性课程都需要先修此课。",
    "C_course-v1:TsinghuaX+20430054X_1+sp": "这是物理学科本科理论物理的四大力学中唯一的一门涉及基本相互作用力的课程，也是物理本科阶段最难（没有之一）的课程，无数学物理的学生在这门课上留下了一辈子都抹不掉的深刻记忆。其难点主要在于大量地使用数学中的以微积分为基础的场论，特别需要求解各种偏微分方程组，要把数学和物理有机地结合起来。电磁相互作用是从原子尺度一直到宏观尺度，控制物质形成及其运动的最基本的相互作用，由此成为我们生活周边绝大多数现象的物理基础。本课程是介绍在宏观尺度下电磁作用的基本现象和规律。它和很多物理学的前沿进展有着内在的联系。很多更高级更深入的物理学课程及很多以物理为基础的工程性和应用性课程都需要先修此课。",
    "C_course-v1:TsinghuaX+20140064X+2018_sp": "《工程热力学》是研究热能与机械能互相转换以及热能有效利用的科学。本MOOC课程分上下两部分：《工程热力学(上)》主要有基本概念、热力学第一定律、热力学第二定律、理想气体的性质与过程以及气体动力循环等；而《工程热力学(下)》则主要有实际工质的性质与过程、蒸汽动力循环、制冷循环、湿空气、热力学微分关系式、化学热力学基础，以及学科研究前沿及研究应用简介等拓展内容(以*标注，不作考核要求)等。   《工程热力学》是能源工程、动力工程、机械工程、航空航天、工程热物理、建筑环境与设备工程、化工及核工程等专业的重要的专业基础课，是节能的理论基础，是热利用、热设计、热管理及热控制等的基础。",
    "C_course-v1:TsinghuaX+20140064_2X+2018_sp": "《工程热力学》是研究热能与机械能互相转换以及热能有效利用的科学。本MOOC课程分上下两部分：《工程热力学(上)》主要有基本概念、热力学第一定律、热力学第二定律、理想气体的性质与过程以及气体动力循环等；而《工程热力学(下)》则主要有实际工质的性质与过程、蒸汽动力循环、制冷循环、湿空气、热力学微分关系式、化学热力学基础以及学科研究前沿及研究应用简介等拓展内容(以*标注，不作考核要求)等。  《工程热力学》是能源工程、动力工程、机械工程、航空航天、工程热物理、建筑环境与设备工程、化工及核工程等专业的重要的专业基础课，是节能的理论基础，是热利用、热设计、热管理及热控制等的基础。",
    "C_course-v1:NUDT+05028103+2018_T2": "本课程的目的是帮助学习者掌握大学英文基本的写作方法和技巧，打好英文基础，为论文写作、出国留学和将来对外交流做好充分准备。英文写作说到底是一门实践课。因此，本课程强调实践，讲授按照过程写作法组织知识点，例子剖析贯穿始终，为学生提供边学边练的机会。课程结束时，学员能够基本掌握大学英文写作。《大学英文写作（一）》包含8单元，重点帮助学习者了解写作过程和学习规律，能够基本完成西方高校英文写作课程、人文社科课程和专业课程一般性的写作任务、写作规范和写作方法，作文基本做到条理清晰，连接自然，论据充分，具有说服力。《大学英文写作（二）》包含12单元，内容包含各种常见写作策略：描述和叙事、过程说明、比较和对比、因果分析、举例说明、分类法和定义法等等，重点放在论说文写作。人类思维经常是相通的，但同时由于文化和思维方式的差异，让英文写作中策略的运用形成了一些特点，与中文写作不甚相同。如果了解和把握这些特点，就能够有效运用写作策略。考虑到学习者的实际需要，本课程还补充了4个“how to\\\"单元：”如何写学期论文”， “如何写摘要”，“如何写留学申请信和简历”和“如何写个人陈述”。本课程适用对象：已修完《大学英语》课程，选修英文写作或者希望继续提高英文写作能力的学习者，以及准备出国深造的学习者。",
    "C_course-v1:BNU+2017001+2018_T2": "课程采用案例教学和讨论式教学，对国内外重大环境突发事件，如松花江水污染事件、莱茵河水污染事件、伦敦烟雾事件、北京雾霾事件及天津大爆炸事件等进行研讨。 对重大环境污染事件产生的背景、原因、生态恢复措施、责任追究、应急处置措施、生态环境影响等多种方式的讨论。课程采用启发式教学，采用教师先介绍事件背景，提出不同的问题，吸引学生思考。然后教师进行归纳解答的方式进行教学。 课程在讲述重大环境污染事件的同时，对我国环境应急管理的内涵、特点、基本原则、应急体系等进行总结，使学员对我国的环境应急管理体制有更深刻的认识。  ",
    "C_course-v1:SJU+2018072301+sp": "1 本课程从交互设计概述入手，讲述交互设计的相关概念、交互设计发展的历史，交互设计的作用，学习交互设计应该具备的知识。2 然后是交互设计原理，包括交互设计流程与过程模型、用户体验等知识。3 在第三章和第四章我们着重研究交互设计的对象——也就是用户，并通过用户研究形成良好的用户体验。4 在第五章，我们将集中讲述交互设计的方法，包括设计流程和模型，还有交互设计过程中的一些分析工具和研究方法5 从第六章到第八章，我们将进入交互设计的实际设计阶段，从交互设计产品的信息架构，到原型设计、测试，再到迭代产品的细化和升级，讲述交互产品的界面设计。6 最后我们用一章的内容回顾整个过程，用实际的课题讲解设计过程和方法在课题中的具体应用和可能遇到的问题。",
    "C_course-v1:SXPI+20171101005+2018_T2": "“思想道德修养与法律基础”课是一门承担“立德树人”为主要任务的课程。它以马列主义、毛泽东思想、邓小平理论、“三个代表”重要思想、科学发展观和习近平系列讲话精神为指导，针对大学生成长过程中面临的思想道德和法律问题，有效地开展马克思主义人生观、价值观、道德观和法制观的教育，更好地引导大学生树立崇高的理想信念，养成良好的道德品质，树立体现中华民族优良传统的和时代精神的价值准则，形成正确的行为规范，使大学生成长为德、智、体、美全面发展的社会主义建设者和可靠的接班人。",
    "C_course-v1:NBCC+013G29A00+2018_T2": "本课程为专业岗位技能课程。通过职业认知、劳动标准实施、员工入职与建立劳动关系、履行和变更劳动关系、解除与终止劳动关系、劳务派遣与非全日制用工、员工参与、劳动规章制度管理和处理劳动争议的学习，强化学生的劳动关系实务操作的职业技能，掌握市场经济条件下中小企业有关于劳动关系协调岗位工作的流程与具体处理方法，重点培养学员在人力资源资源管理中劳动关系实务操作中业务操作技能运用能力和岗位工作能力。在课程展现形式上，我们采用了：   根据真实案例改编的情景剧;<img /> 师生互动式的讲解;   企业人力资源主管的现身说法; 律师专家的专业见解。  考核方式：在课程视频学习的基础上，章节测试和期末考试各占总成绩的50%，满分100分，60分合格，85分优秀。  ",
    "C_course-v1:FAFU+20180104002+sp": "在世界昆虫邮票的长廊中，我们面对的不是一个纯客观的昆虫世界，而是充满了情感、生命和富有个性的，符号化的昆虫世界。在昆虫邮票中，我们不仅会认识千姿百态的昆虫，也可以认知它们独特的生存方式；不仅可以体会昆虫的生命智慧，也可以领悟它们深厚的文化内涵：在这里，您可以见到《诗经.蟋蟀》中吟咏的：蟋蟀在堂，岁聿其莫。今我不乐，日月其除。那一只唧唧鸣叫的“蟋蟀”；见到“蜂采百花成蜜后，为谁辛苦为谁甜”的中华蜜蜂；见到“朝菌不知晦朔，蟪蛄不知春秋”中的蟪蛄；也可以见到“高蝉有远韵，茂树有余音”中的那只“高蝉”；还可以见到在西方经典中，丘比特的原型；见到被埃及人称为太阳虫的那一只粪金龟……奥秘无穷的昆虫世界，丰富的昆虫文化内涵，在这慕课中，都一一为您娓娓道来。",
    "C_course-v1:SCUT+145055+2018_T2": " 数据结构是计算机学科各专业的一门重要专业基础课程。本课程主要论述数据的逻辑结构、存储结构、算法设计以及算法评价四方面的内容，使学生对线性表、栈、队列、树、图等各种数据结构以及查找、排序等基础算法有深入的了解；还要求学生针对具体的工程问题，系统地掌握在不同的数据结构上进行有关算法设计的思想和技巧。数据结构是一门理论性和实践性都很强的课程。课程成绩考核：平时作业：100%；合格分数线：60分。",
    "C_course-v1:SichuanU+304231020+sp": "《智能时代的创新创业》课程有两个时代背景，一个是智能时代的到来，第二是中国的创新驱动战略。我结合自己信息学科的专业背景以及自己在创新教育中的经验，把智能技术与创新创业结合。在课程中我们会探讨如何在智能时代到来的背景下进行创新创业，如何把人工智能技术融入到各个行业中去。课程的目标是让更多的人能从科技创新中受益，从创新创业中受益。我们把课程内容总结成一个模型，两个重点和三个部分。我们提出了在智能时代下的创业能力模型。这个能力模型一共有五层。第一层是自我认知的能力，包括自我价值观的澄清，人生意义的探索，愿景目标的清晰化，这是第一个能力。第二个能力是创新能力。具体来讲，就是创新心智模式与创新思维方法的结合；第三个能力是技术能力，就是懂得计算思维，以及能够用智能技术设计产品的能力。第四个能力是指商业能力，包括管理能力，市场和渠道的能力，资金和行业的经验，第五个能力是团队合作的能力。因此，我们的课程有两个重点，第一个重点是创新创业能力的培养。我们的课程专门设置了创新能力培养模块，通过切实可行的训练方法来提高创新能力。具体来说就是通过创新心智模式和创新思维方式的训练，来提高创新能力。对创业而言，我们会带大家观察创业的全过程，从而告诉大家创业的真相。同时引导大家思考自己适不适合创业。我们可以把这部分内容看成是创新创业的通识课程，它适合所有的同学学习，而且这部分内容不需要任何其他学科的知识背景。第二个重点是智能时代的技术创新，我们将讨论如何通过智能技术来承载我们的创新创业实践，如何把人工智能技术融入到行业中去，这部分的主要从科技创新的角度来谈的，比如我们会讲计算思维，我们会讲机器学习，会讲数据技术和互联网技术，会讲智能技术是如何落地到各个行业的。这个重点会涉及到一些数学知识和计算机科学的知识，考虑到我们这门课程是面向所有专业的通识课程，我们将尽量减少数学和专业知识的介绍，只给出相关的技术背景。我们将尽量用通俗易懂的方式进行讲解。当然，如果你本身有专业背景知识将对你理解课程有所帮助。课程的三个部分。第一个部分，我们将讨论人工智能时代我们面临的机遇与挑战，这个部分对人工智能应用到行业的情况有初步的探讨。第二部分，将讨论创业能力模型，并着重培养创新能力，这部分对应我们的第一个重点。第三部分，将讨论智能时代的技术创新，尤其是计算思维和机器学习技术。这部分对应我们的第二个重点。考虑到这门课程是实践型课程，在每个部分最后我们都设计了项目指南环节。通过这个环节，首先能帮助大家解决选题问题，能够引导大家找出有实践价值的创新点子；另外我们会在项目指南环节点评以前我指导的一些有代表性的项目，通过项目的讲解，深入理解课程的内容。另外，考虑到这门课的实践性，我们会在最后一个部分的项目指南邀请长期在创业和投资一线工作的创业导师来聊一聊创新创业和人工智能。课程的重点是培养下面三个能力：第一是培养创新能力。就是培养创新心智模式和创新思维方式，理解智能时代下的创新，有能力把创新点子转化为创新项目。第二是培养技术能力，通过对智能技术，包括对计算思维和机器学习的理解，有能力把创新项目转化为产品。第三是培养团队能力。我们强调团队合作能力，这也是创业必须要具备的能力。通过我们的创新项目训练，大家可以在小组里训练自己的团队能力，与人沟通的能力和组织协作能力。",
    "C_course-v1:CityU+GE2304+sp": "香港城市大学《创新创业基础》慕课是根据孙洪义博士独创的3333课程大纲和PIPE教学模式设计开发的。3333课程大纲和PIPE教学模式获得中国教育部高等教育学会2013年创新创业教育研究一等奖和众多国内外创新创业教育奖项，拥有独立的知识产权，中英文期刊和国际会议均有发表和交流。这六周的教学内容是创新创业基础课程的核心内容，符合教育部《创业基础》的大纲精神，教学量相当于16学时。结合配套教材和适当的线下辅导与考核，可以满足纳入学分24或32 学时的创新创业基础课或通识课的混合式教学要求。具体教学安排请参考教学大纲、教材和教学培训等材料。这门创新创业基础课程及配套教材可能是首个有系统地整合了创造、创新和创业（三创）的课程。本课程教学大纲的设计符合目前全球普遍采用的成果导向课程设计理念。该课程的学习成果（Learning objectives）不追求高大上，而是力求生活化、具体化、系统化，遵循依次递进和知行合一的原则，包括：1. 发现日常生活中的问题，实践和体验探索过程，提升探索能力;2. 产生解决问题的新想法（创意），实践和体验创造思维过程，提升创造力;3. 提出新产品或服务的设计方案，实践和体验产品的开发过程，提升创新能力;4. 制定简要的创业计划，实践和体验创业准备的过程，提升准备创业的能力。本课程的主要教学目的，是为了让学生经历和体验创新型创业之准备阶段的基本流程，培养创造思维、创新意识、创业精神和创业技能，播下创新创业的种子。有兴趣创业的同学可以继续进修创业训练营、辅修专业或孵化器项目等高级课程。本课程对学生的基础知识和专业背景没有任何要求。",
    "C_course-v1:CSU+82150112201+2018_T2": "循证医学是一门以解决临床问题为出发点，培养学生的批判性思维，树立循证医学理念，掌握循证医学方法，在临床实践中发现问题、寻找现有最佳证据、评价和综合分析所得证据，结合临床经验，充分考虑患者的意愿和价值观，做出正确的疾病诊治方案能力的课程。慕课以其大规模、自主性和开放性的优势打破了现有的“教室型”教学模式，学习者可以根据自身实际，自主安排时间到网上自由地选择课程进行学习，不受任何人为的、时空的限制。因此，循证医学的慕课课程将大大提高学生的学习兴趣和自主学习能力，提高教师的教学能力，改变教师在教学中的地位。    课程教学对象包括医学各专业硕士研究生，每年开课人数近500人。教学依照学生的学习特点在教学内容和方法上进行调整和增订，在学生中受到良好的反应。课程内容包括：1）循证医学总论；2）临床指南的制定与应用；3）临床科研方法学；4）临床研究证据的评价标准；5）临床实践中发现和提出问题等内容。   本课程的特色是：在强调医学研究生必须掌握扎实的医学理论基础和基本技能的基础上，提出现代医学要求的、最新的、科学的循证医学理念，让医学研究生在成为临床医师之际，懂得临床医学和临床科研的最新理念，使我校培养的临床医学研究生能更快的适应现代医学的要求。目前在国内各院校的临床医学研究生课程中还没有普及《循证医学》的专设课程教学，同时，在临床科研实践中进行循证医学理念的科研设计、实施更是未见报道和开启，我院率先开启和完善《循证医学》课程的学习并应用于临床科研中，力争建立临床科研的循证医学模式，其国内外影响力不容小觑。考核方式：在课程视频学习的基础上，完成期末考试，满分100分，60分合格，85分优秀。",
    "C_course-v1:NEU+2018051501+sp": "课程《软件工程》是软件工程专业的专业主干课，也是计算机科学、网络工程、信息安全、物联网、数字媒体等专业的专业必修课、专业基础课，是软件工程师、计算机、软件领域的各类从业人员、研究人员的必修课。本课程的目的是通过学习使学生了解和掌握软件工程的基本概念和知识",
    "C_course-v1:CSU+82150112201+sp": "  循证医学是一门以解决临床问题为出发点，培养学生的批判性思维，树立循证医学理念，掌握循证医学方法，在临床实践中发现问题、寻找现有最佳证据、评价和综合分析所得证据，结合临床经验，充分考虑患者的意愿和价值观，做出正确的疾病诊治方案能力的课程。慕课以其大规模、自主性和开放性的优势打破了现有的“教室型”教学模式，学习者可以根据自身实际，自主安排时间到网上自由地选择课程进行学习，不受任何人为的、时空的限制。因此，循证医学的慕课课程将大大提高学生的学习兴趣和自主学习能力，提高教师的教学能力，改变教师在教学中的地位。    课程教学对象包括医学各专业硕士研究生，每年开课人数近500人。教学依照学生的学习特点在教学内容和方法上进行调整和增订，在学生中受到良好的反应。课程内容包括：1）循证医学总论；2）临床指南的制定与应用；3）临床科研方法学；4）临床研究证据的评价标准；5）临床实践中发现和提出问题等内容。   本课程的特色是：在强调医学研究生必须掌握扎实的医学理论基础和基本技能的基础上，提出现代医学要求的、最新的、科学的循证医学理念，让医学研究生在成为临床医师之际，懂得临床医学和临床科研的最新理念，使我校培养的临床医学研究生能更快的适应现代医学的要求。目前在国内各院校的临床医学研究生课程中还没有普及《循证医学》的专设课程教学，同时，在临床科研实践中进行循证医学理念的科研设计、实施更是未见报道和开启，我院率先开启和完善《循证医学》课程的学习并应用于临床科研中，力争建立临床科研的循证医学模式，其国内外影响力不容小觑。考核方式：在课程视频学习的基础上，完成期末考试，满分100分，60分合格，85分优秀。",
    "C_course-v1:UESTC+E2216230+2018_T2": "  数据库技术是业务处理系统、电子商务系统、管理信息系统、办公自动化系统、大数据应用系统等各类信息系统的核心技术，也是信息化社会充分有效地管理和利用各类数据资源，进行业务处理、数据分析、信息服务、科学研究和决策管理的重要技术手段。  本课程教学目标与任务是帮助学习者掌握数据库系统原理知识及其开发技术，培养具有学生数据库设计、数据库编程、数据库应用创新等工程能力，从而建立数据库应用系统开发能力。",
    "C_course-v1:TsinghuaX+Intro2EltrMrt+2018_T2": "本课程将对电力市场的基本理论知识进行深入浅出的介绍，涉及经济学基本原理、中长期市场机制、现货市场机制、辅助服务市场机制、电力金融市场机制、市场监管方法、报价决策优化方法、电力市场技术支持系统等方面；课程还将对美国加州、PJM电力市场等实际案例进行剖析，并结合我国电力市场建设的进展与特殊性展开讨论。",
    "C_course-v1:CSU+20180918X+2018_T2": "“思想道德修养与法律基础”，是一门融思想性、政治性、科学性、理论性、实践性于一体的思想政治理论课。学习本课程，有助于大学生领悟人生真谛，坚定理想信念，践行社会主义核心价值观，做新时代的忠诚爱国者和改革创新的生力军；有助于大学生形成正确的道德认知，积极投身道德实践，做到明大德、守公德、严私德;有助于大学生全面把握社会主义法律的本质、运行和体系，理解中国特色社会主义法治体系和法治道路的精髓，增进法治意识，养成法治思维，更好行使法律权利、履行法律义务，做到尊法学法守法用法，从而具备优秀的思想道德素质和法治素养。通过这门课程的学习，学生在知识上要掌握丰富的思想道德和法律知识，一是以理想信念教育为核心，深入进行科学正确的世界观、人生观和价值观教育。二是以爱国主义教育为重点，深入进行弘扬和培育民族精神与时代精神教育。三是以基本道德规范为基础，深入进行公民道德教育。四是以大学生全面发展为目标，深入进行素质教育，促进大学生思想道德素质、科学文化素质和身心健康素质协调发展，引导大学生成为有理想、有道德、有文化、有纪律的社会主义新人。五是培养和提高大学生的法律素养。做到尊法、学法、守法、用法。在能力上要学会正确处理“德”与“才”的关系，运用理论分析自己的思想实际和社会实际的能力，提高明辨是非、区分善恶美丑的认知能力和行为选择能力；在素质上力争做到用马克思主义理论和社会主义核心价值观武装自己的头脑，不断提高自身的政治素质、思想道德素质和法律素质，德才兼备。",
    "C_course-v1:gmc+30102+2018_T2": "病理生理学的任务是研究疾病发生的原因和条件，研究整个疾病过程中的患病机体的机能、代谢的动态变化及其发生机理，从而揭示疾病发生、发展和转归的规律，阐明疾病的本质，为疾病的防治提供理论基础。病理生理学的内容可以分成三个部分，即疾病概论、基本病理过程以及各系统病理生理学。疾病概论所包含的内容是关于各种疾病的普遍规律性问题，如疾病发生的原因和条件，疾病时稳态(homeostasis）调节的紊乱及其规律，疾病的转归等。病理生理学是认识疾病和防治疾病的理论基础，是基础医学与临床医学间的桥梁。",
    "C_course-v1:gmc+306702+2018_t2": "《药物化学》课程是药学类等各专业的重要专业课程之一。它是涉及化学、生命科学和计算机运用的一门综合性学科，是药学专业学生在学习基础化学、基础医学、计算机技能、生物化学和药理学以后的一门专业课程，因此《药物化学》是药学各专业的重要必修课之一。《药物化学》是一门历史悠久的经典科学，具有坚实基础和广阔的发展空间；而新理论、新技术、学科间不断交叉渗透又形成新兴学科。在课程建设中，知识层面需要不断吸收本科学国内外前沿的研究成果；培养学生层面需要满足新药研发创新人才培养知识的需求，因此我们不断在课程教学内容、教学方法、教学手段、学生学习效果评价方法、教材建设等方面进行探索和改革。",
    "C_course-v1:jlu+20180925+2018_T2": "本课程为国家精品在线开放课程。本课程内容共分为六章：第一章绪论，主要介绍车的基本概念及缘起；第二章鸿蒙初辟，主要追溯车轮的发展历程和人力车的历史变迁；第三章畜力往事，主要讲解马车和马车礼仪的相关知识；第四章蒸汽时代，主要回顾蒸汽机和蒸汽汽车的发展历程和技术革新；第五章内燃江湖，主要阐释内燃机和内燃汽车的工作原理与结构组成；第六章电动风云，从电池、电机和整车三个方面讨论电动汽车的发展历程和技术演变。本课程在本校开设7期，共有选课学生616人，覆盖全校工学部、理学部、信息科学学部、人文学部、社会科学学部、地球科学学部、白求恩医学部和农学部的38个学院，辐射范围较广。本课程依托智慧树网平台已开设8期，共有285所外校选用该课程，选课学生累计51328名。选课学校涉及本科、专科、职业学院等多个层次，影响范围较宽。本课程依托爱课程（中国大学MOOC）平台已开设8期，社会学习者累计34081人。本课程用大量的案例深入浅出地阐述了汽车发展的历史和结构原理，内容丰富而全面；同时课程在线教程制作精致，教学模式多样，深受学生的欢迎和好评。",
    "C_course-v1:NBCC+031J33B00+sp": "   为满足IT学习者的迫切需求，拟通过本课程的学习，使零基础的学生具备Java程序语言开发的相关知识和技能；熟悉软件开发的基本流程，并能使用面向对象思维分析业务需求，解决实际问题；通过项目代码的撰写指导，使学生能熟练掌握Eclipse集成开发工具进行项目代码管理，版本维护和程序调试，并能编写一些简单的测试程序和异常处理程序等技能。   课程采用项目化驱动的方式，将知识点和项目任务对接，秉承以企业应用目的出发，以最新最前沿的热门技术为主要内容，以尽可能通俗、形象化的方式进行讲解，以多维度多形式的方式进行训练和考察。考核方式：在完整学习课程视频的基础上，各章测试题的得分为课程总成绩，100分满分，60分合格，85分优秀。",
    "C_course-v1:KMUSTX+1803168+2018_T2": "基因工程是生物相关学科专业（生物工程、生物技术、生物科学等）重要的专业课之一，是生命科学的重要学科，内容涉及生物化学、微生物学、分子生物学等学科理论和实验知识。课程的主要目的在于使学生掌握基因工程的意义、基因工程操作的基本理论，技术和应用，为今后开展基因工程研究打下理论基础。基因工程是在分子生物学和分子遗传学等学科综合发展的基础上，于上个世纪70年代诞生的一门新兴生物技术科学。它的创立和发展，直接依赖于基因分子生物学的发展与进步，两者之间有着密切而不可分割的内在关系。通过基因工程的教学，达到如下教学目的：使学生了解和掌握基因工程的基本概念和原理；使学生掌握基因操作的主要技术原理和应用；使学生掌握基因工程的研究内容和操作流程；使学生初步掌握基因工程的基本实验操作技术。课程的主要内容包括基因工程的基本原理和方法；目的基因的获得；基因克隆的工具酶与载体；重组子的鉴定与表达；基因测序技术；基因组学以及基因工程的应用。",
    "C_course-v1:Tsinghua+20181011X+2018_T2": "本课程为青年AI自强项目-计算机视觉课程，主要的组织者、演讲者、参与者全部以学生为主，为同学们解决实际问题：弥补“技术小白”与“老师觉得你懂”之间的鸿沟、弥补“课本”到“实践”的鸿沟、解决一般的学术文章/资源不易读的问题。本课程主要由8次讲座以及1个转化挑战任务组成，讲座每隔一周举办一次。每次讲座会用通俗易懂的语言引导大家掌握AI相关的知识点，依次为AI鸟瞰与进阶指南、机器学习入门、经典神经网络、深度神经网络、卷积神经网络、分类任务、探测任务、实例与调参方法，最后通过转化挑战任务带领大家实操实践等等。",
    "C_course-v1:gmc+3060511+2018_T2": "药剂学是一门研究药物制剂的处方设计、基本原理、制备工艺和合理应用的综合性技术科学。其最基本的任务是将药物制成符合各项质量标准要求的制剂，并将其应用于临床发挥防病、治病和诊断的作用。其宗旨是制备安全、有效、稳定、使用方便的药物制剂。药剂学的基本任务是将药物制成适于临床应用的剂型，并能批量生产安全、有效、稳定的制剂。药剂学是综合性应用技术学科，是药学、制剂、中药制剂等专业的主药专业课，而且也是与药物的实际应用最接近的研究领域。",
    "C_course-v1:PSFFC+2018102402X+2018_T2": "本课程从工业企业防火防爆基础理论入手，介绍常见的工业设备，以石油炼化、化工、纺织、食品等行业中火灾风险较大的生产过程为例，从生产基本原理、工艺流程、物质特性、火灾特点入手，研究物质性质与安全、化工厂设计与安全、装置操作与安全规律。通过学习这门课",
    "C_course-v1:PSFFC+2018102403X+2018_T2": "认真贯彻“教为战”的思想，满足当前消防工作和消防人才培养的新需要，立足教学实际，注重学科专业体系化建设，注重对各学科知识内容的更新，特别是对前言消防科学技术、消防理论研究成果的吸纳和应用；课程结构安排和编写体例紧紧围绕基础理论知识学习和基本操作训练，突出案例教学和实践教学，着重提高学生的专业理论水平和实际工作技能。",
    "C_course-v1:PSFFC+2018102404X+2018_T2": "本门课程设置的目的在于，通过教学，使学员较为全面和系统的了解灭火战术的基本理论，理解灭火战斗原则、掌握灭火组织指挥、灭火战斗行动、灭火业务基础建设、灭火应用计算与估算、灭火战术训练、灭火战斗保障等方面知识，学会用所学知识去分析、解决消防灭火救援工作中的实际问题，基本具备消防中队指挥员应有的指挥能力和专业素质",
    "C_course-v1:PSFFC+2018102405X+2018_T2": "《消防燃烧学》为我校精品课程，面向消防指挥、抢险救援专业开设，属于专业基础课程，54学时，其中理论教学48学时，实践课（实验）教学4学时。通过课程学习，主要让学员掌握燃烧学的基本概念、基本理论、基础计算等知识，构建学科知识体系，学以致用，为学好《危险化学品安全管理基础》、《工业企业消防安全》、《灭火战术》、《危险化学品事故应急救援》、《石油化工火灾扑救》等后续课程打下基础。建校27年来，共培养消防指挥、灭火救援、消防后勤管理等专业学生约1.7万余人。本课程教学，有专任教师9人，其中教授3人、副教授2人、讲师4人。平均教龄16.7年。多名教师教学科研成绩突出，在历年教学中，20余人次被公安部局和学校评为优秀教师，学员满意教员。",
    "C_course-v1:PSFFC+2018102406X+2018_T2": "《消防应急救援》是一门研究各类灾害事故救援的新兴交叉学科，是一门技术性和实践性较强的课程，主要为消防队的应急救援工作提供理论指导和技术支持。消防应急救援课程是我校的专业主干专业课程，是抢险救援专业和消防指挥专业的必修课，本课程理论体系的构建，以化学、物理、建筑、装备、战术、指挥等学科为基础，以适应当前消防部队应急救援任务需要为目标，内容基本涵盖了化学事故救援、交通事故救援、建筑物倒塌事故救援等消防应急救援任务，作为一门独立的新兴边缘学科体系中的课程，其理论性、实践性和实用性都很强。课程内容涉及面广，从危化品、交通等事故应急救援的特点，到各类突发事件应急救援的处置措施，还介绍了消防应急救援面临的形势等。对相关救援力量的应急救援培训，应急救援知识的普及有一定的积极作用。",
    "C_course-v1:BNU+CSL21148501+2018_T2": "本课程是为语言学及应用语言学学科（对外汉语教学方向）和汉语国际教育专业开设的专业基础课。  本课程分为汉字和词汇两个部分，汉字部分将讲授汉字的起源与发展演变的基本理论；汉字独特的表意特性和字形的表意理据，汉语字词的独特对应关系；汉字与远古文化及社会生活的密切关系；介绍第一部成熟系统的文字学著作《说文解字》的体例及使用方法。词汇部分将介绍汉语词汇的基础理论；阐释语素、词、短语等语言单位与汉字的关系；说明汉语词汇的构成与发展演化规律，剖析汉语词义的构成与相互关系等。 本课程旨在帮助学生打下汉语词汇与文字方面的理论基础，加深并拓展现代汉语词汇文字的基础知识，构建有关汉语词汇文字系统知识结构，了解相关问题的分析方法，促进学生对对外汉语教学相关的词汇文字研究成果的了解，提高学生对有关文字词汇问题的分析能力，研究兴趣及解决实际教学中的有关文字词汇问题的能力。 本课程的特点是打通古今、打通词汇与文字，根据汉语本体的基本理论和对外汉语教学的特点及其需要，科学地分析汉语词汇与汉字的特点以及它们之间的特殊关系，在突出理论系统的同时，顾及到实践应用。 本课程能够有效地帮助学习者掌握汉语本体知识以及其教学方法。学习这门课，也有利于那些已经从事对外汉语教学工作的学习者们得到理论上的提高。",
    "C_course-v1:XJAU+246010007+2018_T2": "交互式程序设计导论课程简介   这是我们第一次尝试在网络上以MOOC（慕课）模式开展大学计算机公共基础课程的教学活动。   我们将带领大家体验从未有过的学习经历。你们将通过这门课程学会一种计算机语言，并且用这种语言编写出有趣的计算机游戏程序，你们的作品不仅可以让他人体验快乐，也会让你自己感受到前所未有的成就感。   通过学习这门课程，你收获的不仅仅是了解编写计算机游戏的一些技巧！我们将教会你如何从计算机科学家的视角进行思考：像数学家一样，你们将使用形式语言来描述问题；像工程师一样，你们将能够设计制造某种东西；像科学家一样，你们将可以观察复杂系统的行为、提出理论假设、并对理论预测进行验证。   计算机是人类的“个人助理”，它能帮我们料理许多事情。课程组及学院全体老师将竭尽全力帮助你熟悉这个“个人助理”。   请在箐箐校园播种你的梦想，用青春汗水去浇灌她，果实累累的季节在等着你！   祝各位同学健康快乐！  先修课程  《Python交互式程序设计》是大学新生一年级的公共必修课程，也是我校所有学生的第一门计算机基础课程，学习该课程没有任何先修课程的要求。当然你一定具备初中的数学知识、也具备基本的中文阅读能力、熟悉26个英文字母，这些就足够了。课程组成员张太红教授张太红，男，汉族，祖籍甘肃静宁，1965年11出生，硕士研究生，教授，硕士研究生导师，主要研究方向为数据库技术和农业信息化技术。1983年至1987年，就读于陕西师范大学，取得理学学士学位；1987年至1990年，就读于原新疆八一农学院，取得理学硕士学位；目前在中国农业大学攻读农业信息化技术博士学位。1990年留校任教，1999年至2003年担任信息系统教研室主任，2003年至2007年担任新疆农业大学网络中心主任，主持实施西部大学校园计算机网络建设工程“新疆农业大学校园网建设项目”，2007年赴北京挂职锻炼，任中国农业大学信息与电气工程学院副院长。现任计算机与信息工程学院院长，兼任新疆劳动和社会保障学会常务理事、新疆人力资源管理协会常务理事、新疆劳动保障与人力资源管理咨询专家组成员、新疆教育信息化技术专家咨询委员会委员。新疆维吾尔自治区软件行业协会、新疆维吾尔自治区计算机学会、新疆维吾尔自治区电子学会（新疆IT三会）专家委员会委员、常务理事。为本科生主讲Python交互式程序设计导论、数据库系统原理、大型数据库应用技术等课程，为研究生主讲数据库实现、信息检索导轮等课程。主持和参加了国家十一五科技支撑计划“新疆村镇信息化技术集成与示范（2006BAJ09B0907）”及“农村特色产业信息化技术研究（2006BAD10A15-6）”、十五国家科技支攻关重点项目“奶牛养殖标准化信息管理系统”、自治区科技攻关计划“农村科技信息服务平台关键技术研究（200931103）”、自治区自然科学基金“无线传感器网络能量均衡机制与策略（2010211B09）”、自治区电子信息发展专项资金项目“维、哈文搜索引擎（XJDZZXZJ20109）”、新疆高校科研计划“eQuiz电子考试系（XJEDU2005E03）”、“Ubase数据库管理系统的研究与实现”及“单片机在面向创新能力培养的实验教学体系构建与平台设计（XJEDU2010I22）”等纵向课题，累计承担各类科研项目20余项，合同经费621万余元。取得计算机软件著作权登记7项，发表学术论文32篇，参编专著1部。获自治区科技进步二等奖两项（“农村远程教育及文化共享工程Linux支撑平台研究与应用”，证书编号：单位J2010057，个人G20100278；“昆仑跨平台多媒体交互式远程教学系统”），自治区科技进步三等奖一项（“社会保险信息管理系统”，证书编号：单位99-03-216，个人990949），校级教学成果一等奖一项，校级教学成果二等奖一项，校先进工作者二次，校优秀班主任一次。白涛博士\\\"&gt;白涛，男，1979年1月出生，中共党员，讲师，博士在读，新疆农业大学计算机学院教师。2001年获管理学学士学位，2013年获工学硕士学位，2013年9月至2014年7月在浙江大学计算机科学与技术学院做访问学者，2014年9月在南京大学攻读计算机科学与技术博士学位。主要从事数据库技术、软件系统开发领域的教学研究工作。主要讲授《面向对象程序设计》、《数据结构》、《信息资源管理》和《管理信息系统》等课程。主持参与各级科研项目十余项，发表论文十余篇。",
    "C_course-v1:JNU+077901mc08+2018_T3": "《生物医药实验室安全知识》是讲解化学、生物学、医学、中药学、药学和与之相关学科如食品、材料、环境等专业的实验室安全知识，以及防范措施和救助方法。课程首先介绍了实验室通常存在的安全隐患，然后对一般性安全知识、电安全、水和气安全、火安全、化学试剂安全、生物试剂安全、生物用品安全、实验用动物安全、中药制备安全等涉及生物医药及其相关领域的安全知识进行了全面培训，并进行防火灭火演习训练，以及危险应急预案等相关知识教育，使学生安全防范和处理危机能力增强，减少实验中事故发生和灾害危害。",
    "C_course-v1:YLVTC+2018111301X+2018_T2": "本课程以企业市场营销活动过程为导向，力图综合描绘市场营销的核心理念与基本技能框架。课程以消费者需求为中心，从营销理念、市场调研开始，进行互联网时代营销环境分析及企业战略分析，把握目标客户真实需求，进行互联网时代产品、营销渠道、价格及促销策略分析，并能够灵活应用营销策略，重视加强营销管理保障营销效果，以期达到客户、企业、社会多方共赢。",
    "C_course-v1:IMUN+5016105+2019_T1": "  “中国古代文学史”是汉语言文学专业本科生的专业基础课。本课程旨在使学习者掌握先秦两汉魏晋南北朝时期的社会状况和文学成就，了解这一时期文学发展的脉络，线上课程主要涉及到先秦文学中的《诗经》、《楚辞》、诸子散文和历史散文的代表作品，秦汉文学中的《史记》、乐府民歌和汉赋的创作概况以及魏晋南北朝文学中的建安文学、正始文学、陶渊明和谢灵运等。学习者应深入了解并掌握重点作家如屈原、司马迁、陶渊明等人的生平与创作，以及重点作品如《诗经》、《离骚》、《战国策》、《史记》等的思想内容和艺术成就。",
    "C_course-v1:HLJUX+1811012013+2018_T2": "我国自古就有诗词吟唱的传统，《诗经》《楚辞》、汉乐府、唐诗、宋词、元曲，都是配乐的唱词，吟唱行腔抑扬顿挫，文体与曲体高度统一，具有极强的音乐性。课程以吟唱为视角，梳理了中国古代文学史上诗词与音乐的关系，总结了《诗经》、楚辞、汉乐府、唐诗、宋词的音乐特点。课程负责人将其还原吟唱的古诗词吟唱音、视频穿插于课程之中，更增添了课程的美感。  课程主讲人黑龙江大学古典文献学博士生导师刘冬颖教授，是国内古诗词吟唱的代表人物，致力于古乐谱唱诗的发掘、抢救、整理与传播。2016年开始，刘冬颖教授主持国家艺术基金项目“古典诗词吟唱的新媒体传播”，带领项目团队从《瑟谱》《白石道人歌曲》《九宫大成》《魏氏乐谱》《碎金词谱》等20余种古乐谱文献中，辑录出原汁原味的古人歌诗曲调，同时，参考古典诗词吟诵名家作品，积极整理、保存、传承当代名家曲调，通过现代的记谱方式和专业的音乐编配、制作模式，以及“文人唱诗”的演绎手法，使其重新绽放艺术的美感。在国家艺术基金项目理论与实践两方面成果积累的基础上，“中华诗词经典吟唱”课程，采取“讲”与“赏”相结合的方式，将大家带入到中华古典诗词的优美意境中来。",
    "C_course-v1:GIT+0500002402+2018_T2": "电路原理是电类、信息类专业学生接触的第一门专业基础课，是研究电路理论的入门课程，通过本课程的学习，使学生掌握电路理论基础知识、电路分析方法，具备分析和解决电子、电气工程基础问题的能力，为后续专业课程准备必要的知识储备，对整个专业学习起着至关重要的作用。",
    "C_course-v1:BNU+CSL21126882+2019_T1": "《应用语言学理论与实践》这门课在语言学理论知识的基础上，将理论与实践相结合，着重讨论语言教学，尤其是汉语第二语言教学中所涉及的语言教学理论、二语习得理论、教学法流派、语言教学中的文化等理论知识，并与教学实践相结合，帮助有志之士、二语教师和研究生成为合格的汉语二语教师，为其进行相关的语言教学实践和教学研究助力。",
    "C_course-v1:SWPU+3615001035+2019_T1": "《钻井与完井工程》是西南石油大学石油工程专业本科生核心主干课程，课堂教学内容主要包括井身结构设计、钻井液、钻井液工艺技术、岩石与钻头、钻井工艺技术、井控技术、井眼轨迹测量与控制技术、固井、完井方法以及储层保护技术、环境保护及HSE等。同时，《钻井与完井工程》是国家级重点学科“油气井工程”的重要支撑课程，本课程的改革内容为教育部“面向21世纪石油主干课程体系和教学内容改革”项目中“石油工程专业的改革与建设”项目的重要内容之一。本课程的前身曾经是5门专业课：《固井与完井》、《钻井工艺》、《岩石力学与钻头》、《泥浆工艺原理》和《储层保护技术》。将这5门课程进行重组和整合，形成了覆盖一个油气井工程学科的专业课《钻井与完井工程》。通过多年来的教学与实践，现有的《钻井与完井工程》课程内容有较大幅度更新，在强调应用基础理论、设计理论与方法的同时，重点突出理论联系实际，适当介绍油气井工程方向的最新工程技术。课程注重内容的基础性、系统性、完整性和实用性，便于引导式教学和学生自学。本课程立足于转变教育思想，更新教育观念，同时与石油工程专业人才培养目标和模式，教学方法和教学手段现代化的改革同步，为学生提供较宽的知识基础和再学习环境，培养学生在工程平台上解决问题的能力。为了实现该目标，与该课程配套的教学环节有实习、开放实验和工程设计，相应的配套教材有《钻井与完井工程生产实习指导书》、《钻井与完井工程开放实验指导书》和《钻井与完井工程设计》。",
    "C_course-v1:BNU+2017112001X+2019_T1": "《史学名家的治史历程与方法》课程由北京师范大学历史学院副院长姜海军主管负责建设，历时三年之久。该课程一共分为五个部分。  第一部分为“陈垣生平”。本部分的主讲人陈智超老师是陈垣先生之孙，自小受家风浸染，接受史学熏陶。陈智超老师曾主编《陈垣全集》，发表了一系列陈垣研究的相关论文，在推动陈垣研究方面做出了扎实的贡献。本课程是陈智超老师对他的祖父陈垣先生生平的介绍。  第二部分为“白寿彝的史学成就和治学风格”。本部分主讲人是北京师范大学历史学院瞿林东教授，他是白寿彝先生的首批研究生，多年来一直传承着白寿彝先生学风，并在白先生之后，开辟了中国古代史学批评这一崭新的研究领域。  第三部分为“刘乃和”。本部分主讲人周少川老师是刘乃和先生的第一届研究生，现任北京师范大学古籍与传统文化研究院教授，著有《弘扬励耘精神 开创史学新风——浅谈刘乃和先生的史学成就》等回忆刘乃和先生的文章。本课程是周少川老师对他的老师刘乃和先生的高尚品格与优良学风的介绍。  第四部分为“何兹全与大时代”。该部分由何兹全先生博士生、北京师范大学中国古代史教研室主任宁欣教授讲授，通过回顾何先生的生前经历和主要事迹，生动展现了大时代下何先生的学术选择和人格坚守，完整呈现了何兹全先生立体而又饱满的“爱国一书生”的形象。  第五部分为“刘家和先生历史比较研究的思想与方法”。该部分由刘家和先生的博士生、北京师范大学历史学院蒋重跃教授讲授，通过回顾刘先生的求学、工作和研究等事迹，系统地介绍了刘家和先生历史比较研究的思想与方法的萌发、形成与成熟阶段，并通过具体的案例分析展现了刘家和先生的学术特点与方法。  考核机制：在观看完整视频的基础上，完成各章节测试，满分100，获得60分即为通过，85分为优秀。",
    "C_course-v1:SHZU+Z104021+2019_T1": "《药物分析》是我国药学专业设置的一门核心专业课程，随着生命科学、生物学、信息科学、计算机技术的发展与引入，它在科研、生产和生活中发挥着越来越重要的作用，尤其在新药研发以及药品生产等方面扮演着重要的角色。 《药物分析》是石河子大学第一批校级精品课程，该课程面向药学、临床药学、制药工程等专业学生开设，同时也作为公选课面向全校学生开放，每年授课人数约五百人左右。《药物分析》是一门理论联系实践的课程，除了理论课程的学习，我们也计划将线下实验课程建设成慕课形式，与理论课互为补充，让学生更好的掌握该门课程的学习。该门课程是很多医药院校药学类专业研究生入学考试的必考科目，也是国家执业药师资格考试的考察内容之一。考核机制：在完整学习课程视频的基础上，章节测试、期中+期末试题各占总成绩的80%和20%，总成绩60即为通过。 ",
    "C_course-v1:TsinghuaX+60700052X+2019_T1": "本课程作为数据科学的先导课和认知类课程，致力于以形象生动的教学模式为学生普及数据挖掘、大数据相关的基础知识、核心概念和思维模式，从工程技术、法律规范、应用实践等不同角度描绘数据科学的美好蓝图。",
    "C_course-v1:LinuxFoundationX+Linux001+sp": "本课程将帮助你掌握Linux主要发行版本相关知识 并熟练使用各版本图形界面及命令行。Linux系统正为世界上所有的超级计算机 驱动互联网的大多数服务器 全球大部分金融贸易 以及20多亿台安卓设备提供支持 简而言之 Linux无处不在 无论是大型机 服务器 台式机 移动设备 还是其它各种硬件 都可以与之兼容。此外 80%的招聘人员报告称 他们会优先考虑Linux方面的人才 47%的招聘人员则表示 自己更倾向于聘用拥有Linux资格证书的求职者。本课程的主要内容包括Linux系统管理员及终端用户在日常工作中常见的工具与常用技巧 无论你以前是否接触过Linux 也无论你现在在个体环境或企业环境中工作 只要你能熟练使用计算机 都可以学习本课程。本课程学习结束后 你将能够熟练掌握Linux主要发行版本的图形界面及命令行操作 不管你以后只是Linux用户 还是从事系统管理员 或程序员的工作 都将从这些知识中获益。我们的课程已经拥有80多万名学员 快来加入我们 开启属于你自己的Linux之旅吧",
    "C_course-v1:TsinghuaX+70150104X+2019_T1": "工作机械在运转中会发出各种包含工作机械内部状态信息的动态信号，它们大都是随机的，携带的信息可能是时变的，也可能是时不变的。本课程讲授动态信号内积变换原理，从原理上教会你如何正确地分析这样的动态信号，并从中提取有用信息，以监控工作机械的内部运转状态，分析问题存在的原因，预警潜在的故障。对动态信号进行内积变换，也是一种“测量”，只不过使用的量具是函数。内积变换是将动态信号与特定的函数进行比对，借助于函数提取信号中的状态信息，也就是动态信号的“测量”结果。用内积变换来描述动态信号分析，会给分析带来诸多好处。首先，它淡化了信号分析中繁杂的数学关系，突出了信号与函数之间的比对关系，更加有助于对分析结果的深入理解。再者，内积将定积分与和式统一在同一个数学形式中，使得二者混合运算及其推演变得异常方便和简洁，更加有助于信号分析结果的理解和运用。纵观动态信号分析发展的各个阶段，包括傅里叶级数、傅里叶变换和小波变换，无一不是信号与特定函数的比对，而内积变换则是这些信号比对方法的统一形式。",
    "C_course-v1:TsinghuaX+70150104_2X+2019_T1": "工作机械在运转中会发出各种包含工作机械内部状态信息的动态信号，它们大都是随机的，携带的信息可能是时变的，也可能是时不变的。本课程讲授动态信号内积变换原理，从原理上教会你如何正确地分析这样的动态信号，并从中提取有用信息，以监控工作机械的内部运转状态，分析问题存在的原因，预警潜在的故障。对动态信号进行内积变换，也是一种“测量”，只不过使用的量具是函数。内积变换是将动态信号与特定的函数进行比对，借助于函数提取信号中的状态信息，也就是动态信号的“测量”结果。用内积变换来描述动态信号分析，会给分析带来诸多好处。首先，它淡化了信号分析中繁杂的数学关系，突出了信号与函数之间的比对关系，更加有助于对分析结果的深入理解。再者，内积将定积分与和式统一在同一个数学形式中，使得二者混合运算及其推演变得异常方便和简洁，更加有助于信号分析结果的理解和运用。纵观动态信号分析发展的各个阶段，包括傅里叶级数、傅里叶变换和小波变换，无一不是信号与特定函数的比对，而内积变换则是这些信号比对方法的统一形式。",
    "C_course-v1:BNU+GOV21089621+2019_T1": "《定性研究方法》（校内称《质性研究方法》）是一门适用于所有社会科学研究者和学习者的研究方法课程。课程负责人面向北京师范大学政府管理学院的学术性硕士研究生开设本课程，作为公共管理一级学科的学位基础课，每年修课学生人数约25人；并作为团队成员面向北京师范大学所有硕士生/博士生开设本课程，作为其公共选修课，每年修读学生人数限选20人，实际参与人数约35人。在校内已分别开设2轮次。本门课程最大的特点是不仅传授研究方法的知识，更重要的是强调学生通过参与式学习习得定性研究方法的应用能力，并培养其定性研究思维。课程对调动学生的参与积极性和自主性要求较高。学生对课程学习效果较为认可。本门课程将探讨定性研究理论问题，培养定性研究实践能力，塑造定性研究思维方式。学习本门课程，将解决如下问题：定性研究是一种什么样的方法？定性研究与定量研究是什么关系？如何应用定性研究方法开展一项具体的研究工作？",
    "C_course-v1:SDSNAssociation+ASD+sp": "Sustainable development is the most urgent challenge facing humanity. Its fundamental question is: How can the world economy continue to develop in a way that is socially inclusive and environmentally sustainable? This course provides a broad overview of the interactions between the economy and our environment and humanit",
    "C_course-v1:WUT+WUT2016001+2019_T1": "现代社会存在着形形色色的网络，如万维网、社交网、交通网等，人与人互相交互、影响，产生了各种各样有趣的问题。   有人说“朋友的朋友是朋友”，那么“朋友的朋友的敌人的朋友”是敌人还是朋友呢？为什么只要你愿意，想认识任何一个陌生人最多只需要通过六个人。”，在这些社会现象的背后，是否还隐藏着我们不知道的规律呢？    当我们精心挑选好自驾线路，却身陷堵车或者更堵车的高速公路的时候，究竟是埋怨社会资源的匮乏还是怪自己读书少，不知道在线路的选择中其实还要用上博弈论。    美国选举，驴象之争，台湾投票，蓝绿混战，我们除了看热闹以外，怎样还可以看到选举背后的门道。    《网络、群体与市场》这门课程从交叉学科的角度出发，综合运用经济学、社会学、计算机科学，以及应用数学的有关概念与方法，分析与推理现实经济社会生活中的若干典型问题。帮助学生体会学科交叉的内涵，培养学生以“计算思维”的观念，解决社会学与经济学问题的能力。    老子说甘其食，美其服，安其居，乐其俗。邻国相望，鸡犬之声相闻，民至老死，不相往来。这种小国寡民的时代远去了。弹指一挥间，世界皆互联。让我们深入其中，探究高度互联世界的行为原理与效应机制。",
    "C_course-v1:WUST+20180821002X+2019_T1": "《创业学》是系统阐述创业基本理论与实践的大学基础课程。通过讲授商业创意的发掘与评估、创业计划撰写，新企业创建、融资与成长管理等内容,使学习者了解创业的过程、相关任务以及需要汲取的知识；认同、理解并体验创业者的行事、思考、感知、沟通、组织和学习方式；激励学习者建立自信去应对不确定性问题,提升认知认识能力,培养人际交往能力，成为知识发掘者、学习主导者以及创业扮演者；在职业生涯中产生创业精神的动力,清楚自己的相对优势,即使不能成为一个好的创业者,也可以成为一个优秀的“内创业者”。人人都有创业潜能，人人都有成功机会。人人都应该把自己看作一个“企业”，需要具备大量的技能、素质和经验，都应该成为自己的CEO。拥有创业素质就是为自己创造人生机遇！受过创业教育“熏陶”的人，在任何单位和机构工作都会表现非凡、出类拔萃，都能更好地适应未来社会需要，在不断追求和创造人类美好生活中发挥不可估量的作用。",
    "C_course-v1:BNU+2018091301X+2019_T1": "想要减脂塑形，需要提高身体的基础代谢，就是通过运动增加肌肉含量。肌肉含量高可以提高基础代谢，在一定的时间内，肌肉含量较高，可以燃烧更多的卡路里。此课程适合不经常运动、基础代谢比较慢的人，他们通常是久坐不动、长时间伏案学习的学生和长期加班熬夜作息不规律、饮食不规律的上班族。在课程中，我们会根据男性、女性生理和需求不同的情况分别讲不同的训练方式和计划，以及一部分训练的动作，带领同学们走上正确的锻炼道路，让同学们在训练中减少受伤，同时能有更好的效果。除了实操的部分也会有一些理论知识，例如肌肉的讲解，让同学们知道每块肌肉长在什么部位，具有哪些功能，锻炼的好处，以及在做动作练习该块肌肉时用到的是哪些功能。最重要的一点是通过课程可以根据自己的训练目的去设定所需的重量、组数和次数，合理科学的制定健身计划，最后完美的达到目标。",
    "C_course-v1:BNU+2018091303X+2019_T1": "《运动与慢病防治》共分为十一章教学内容，其内容主要为颈腰椎疾病、肥胖症及其他代谢综合征、心脑血管疾病、骨质疏松、过敏性哮喘、慢性胃肠道疾病、经前综合症、抑郁、社交障碍等常见慢病的原因、表现及如何通过合理运动辅助疾病的预防和治疗，通过学习从而提高学生的健康素养、提高学生的科学运动能力，从而塑造其健康生活方式。",
    "C_course-v1:JNUX+2018120406X+2018_T2": "本课程自2006年在暨南大学开课以来，累计超过3000人选修，选修学生在全国大学生数学建模竞赛中，获得国家一等奖25项，国家二等奖51项。本课程以通俗易懂、案例引导、注重实践为特点，以讲授数学建模方法和技巧为定位，以在校大学生及社会学习人士为主要选修对象。本课程主讲教师，曾获得“全国大学生数学建模竞赛优秀指导老师",
    "C_course-v1:NEU+20181206X+2018_T2": "本课程是材料学专业的重要课程，主要包括材料研究中最常用的材料X射线衍射分析和材料电子显微分析两大部分。本课程具有难度大、学生理解困难的特点，是材料学专业中最为抽象的课程。本课程采用多种教学方式，特别是在课件和讲解上下功夫，采用平面、立体图形及动画形式结合，使教学内容生动，易于理解。对材料研究中所涉及的具体实例讲解分析测试方法，并力求简明、实用。通过多年来的教学效果来看，得到学校教学督导、学生的好评，被评为东北大学的精品课程，2018年东北大学材料学院优秀教学课程。本课程的讲授教师在x射线衍射、电子衍射分析及材料的微观组织分析方面有着多年的实践经验，所以对课程内容可以做到全面把握，深入浅出的进行教学。",
    "C_course-v1:QHU+20180419+2019_T1": "本课程为人文素质选修课，共有丝路与丝路南线、丝路南线民间文学的基本知识、丝路南线上的多民族神话、神话符号在丝路南线上的衍化、丝路南线上的民间传说、丝路南线上的民间故事、丝路南线上的民歌“花儿”、丝路南线上的民间谚语八章内容。",
    "C_course-v1:BNU+2018091304X+2019_T1": "本课程针对当前大学生日益严峻的体质健康状况，通过视频的教学形式图文并茂、生动形象地向学生群体介绍和讲解体力活动、体能与健康的概念、体力活动的监测与评价、体能的训练方法和评价等理论与实践知识。《运动与能提升》课程主要想解决两个问题：1.解决大学生心肺功能（有氧耐力）差的问题2.解决大学生力量和柔韧素质较差的问题",
    "C_course-v1:BNU+2018091305X+2019_T1": "本课程共由“中国武术之十用”、“中国武术之近身十战”、“中国武术之远身十战”等三部分共30个易学易练的实用精华构成。 通过本课程的学习，使学生熟悉并掌握中国武术“踢、打、摔、拿”等武术实用技法，提高学生应对侵犯和有效规避伤害的风险意识与实战能力。通过对中国武术博大精深的文化内涵作深入浅出式的介绍，提高学生群体对武术拳种的实用动作和武术散打格斗实战的了解掌握，拓展对于日常生活中可能遇到的伤害与风险的防范意识与识别能力，拓宽学生知识面；培养学生对武术与民族传统体育项目的文化认识和精神传承。 课程既授锻炼强身之方，亦解防身避险之法。全面促进研究生群体掌握运用中国武术技术锻炼身体的方法与手段；提高学生群体有效动用自身肢体进行自我保护的能力；建立学生群体面对各类社会风险灵活处理问题的防范规避意识。同时培养文化自信心，弘扬民族精神，发挥武术传统在文化建设中的作用。",
    "C_course-v1:ZZU+2018032501X+2019_T1": "我们生活在一个信息时代，信息技术已经进入社会的各个领域，成为我们生活当中必不可缺少的一部分，在教育教学中也引发了一轮又一轮的应用热潮，对教育教学带来了变革性的影响。该课程紧跟信息技术的最新应用，在真实情境中通过任务驱动的方式，让你在体验式学习中理解信息技术、掌握信息技术、运用信息技术，帮助你转变学习理念，提高信息素养，具备21世纪的信息技能。",
    "C_course-v1:BNU+2018091302X+2019_T1": "本课程将人体最为容易出现问题的颈椎关节、肩关节、腰椎关节、髋关节、膝关节和踝关节作为重点关注对象，从了解关节结构、机能入手，教授大家简便、易行、科学、有效地促进关节健康的运动方法。使学生了解人体主要关节的结构、功能及自行检测方法，并能根据自身状况及需求，选择促进关节健康的运动方法，并将其运动融入日常的生活之中，切实促进关节健康。",
    "C_course-v1:TsinghuaX+80240372X+2019_T1": "本课程完整覆盖数据挖掘领域的各项核心技术，包括数据预处理、分类、聚类、回归、关联、推荐、集成学习、进化计算等。强调在知识的广度、深度和趣味性之间寻找最佳平衡点，在生动幽默中讲述数据挖掘的核心思想、关键技术以及一些在其它相关课程和教科书中少有涉及的重要知识点。本课程适合对大数据和数据科学感兴趣的各专业学生以及工程技术人员学习，不追求纯粹的理论推导，而是把理论与实践有机结合，让学生学到活的知识、有用的知识和真正属于自己的知识，特别是数据分析领域的研究方法和思维方式。",
    "C_course-v1:SDSNAssociation+PB+sp": "A thriving global society relies on the stability of the Earth and its resilience across oceans, forests, waterways, biodiversity, the atmosphere and more. So how do we shape sustainability at a global scale? The boundaries set by the planet’s natural resources, the resilience of those resources, and the human activities that impact sustainability all come into play. In this massive open online course, see the rapidly evolving trends in global environmental change and the responses aimed at slowing or eliminating these changes. Get an overview of what is seen by some scientists as our current geological epoch – the Anthropocene, or an age of global change driven most significantly by humans. Learn how unsustainable patterns of production, consumption and population growth have challenge planetary resilience, all in support of human activity – and how our societies can develop in a just and safe way within the planet’s boundaries.",
    "C_course-v1:HNU+20180529001+2019_T1": "本课程主要以人类设计历史，尤其是过去250年中发生的重大历史事件为线索，梳理设计在国家发展过程中产生的重大影响。在当前我国实行经济转型、自主创新的过程中，设计对改变中国制造的形象以及真正成为创新型国家所发挥的创新引领作用显得尤为重要。",
    "C_course-v1:TsinghuaX+01510192X+2019_T1": "清华大学《创业导引——与创业名家面对面》课程是由清华大学教务处、基础工业训练中心、校团委合作开设的学分选修课。课程通过邀请创投圈名家与大家交流，帮助各位同学了解创业入门级知识，愿大家成为未来的创新创业之星。大咖亲临：邀请创投圈、创业圈的成功导师程方、郭宇航、李竹、林森、罗键霆、马东、沈博阳、盛希泰、宋鹤、杨歌、朱波等大咖和同学们坐而论道热点分享：分享站在过风口浪尖上的创业前辈们有过哪些心得值得借鉴？投资人怎么看待创业者？如何从人性出发设计出用户需要的产品？好产品如何才能凭借极有限的资源推广并竖立品牌？初创公司的企业文化建立的重要性？人生就是一场创业课程面向对创新创业有志向，或者愿意学习成功前辈经验的本科生和研究生以及早期创业项目的创业者！期待与你的一段创新之旅！",
    "C_course-v1:qhnu+20181212x+2018_T2": "本课程作为藏语言文学专业的基础课程，在国内率先创建，在校内开设多年，在校外讲授数场次，成为藏语言文学专业的一门新兴学科，受到学界关注，同行称赞。先后受邀到川、甘、青等地和西藏大学等高校讲授近二十余场次，得到喜爱，是现阶段广大师生青睐的一门新课程。   藏语形态丰富、结构严谨、语音优美、表达力极强，现行的藏文始创于公元7世纪，至今已沿用了近1400年，是中国境内现存印度系统字母中使用时间最长的一种，在我国乃至世界文字上占有重要的地位。本课程以历史为线索梳理藏文的发展历程，讲述曾经在藏民族历史上产生并使用过的各种与语言并行或辅助语言的广义文字，界定真正用来记录语言的现行藏文字符，划分藏文发展的历史时段，介绍藏文字母的分组、排列、搭配、书写等知识。   主讲教师执教经验丰富，从事藏语言文字研究与教学长达三十余年，著作颇丰。主讲人素有研究，自然能够驾轻就熟。本课程具有前瞻性和权威性，课程内容丰富，知识新颖，例举真实，讲解清楚，层次分明，字幕藏汉对照，容易掌握，学习效果好。为广大藏语爱好者或关注藏语言文化的各层人士提供良好的知识平台。",
    "C_course-v1:CIE+CIE2016005+2019_T1": "这是一个团队为王的时代！创业尤其如此！无论是美国的苹果、微软、雅虎、谷歌，还是中国的联想、华为、阿里巴巴、腾讯、百度、小米、美团等等，无一不是团队创业的典范。柳传志总结联想成功三要素：搭班子、定战略、带队伍，其中两项是关于团队建设，团队也是企业组织能力的核心和持续发展的基石。 马云说：世界上最好的团队是唐僧团队。唐僧是领导，也是最无为的一个，唐僧迂腐得只知道“获取真经”才是最后的目的，孙悟空脾气暴躁却有通天的本领，猪八戒好吃懒做但情趣多多，沙和尚中中庸庸但是任劳任怨挑着担子，这样的团队无疑比“一个唐僧加三个孙悟空”的团队更能够精诚合作、同舟共济。马云说出了一个成功团队的4个关键要素：第一是要有优势互补的人才，第二要有明确的目标，第三要有良好的制度，第四要有卓越的文化。马云的观点与美国宇航局（NASA）原天体物理部门主任查理·佩勒林博士不谋而合，佩勒林博士以科学家的视角和领导者的经验，在NASA成功开发出“4D卓越团队建设系统”，通过在线测评（个人发展测评IDA和团队发展测评TDA）、工作坊、团队教练流程，帮助团队成员认识天生性格特点、团队文化特点、项目任务特点，实现心态改变和8项行为改变，从而打造高绩效团队的“第五力”环境！ 2007年，“4D卓越团队建设系统”获得国际教练联盟（ICF）大奖，成为国际上团队建设的一门明星课程。2011年以来，徐中博士和佩勒林博士在中国展开合作，成功举办多次公开课程工作坊和100多场内训工作坊，走进中国电信学院、阿里巴巴、招商银行等领先企业，受到企业界的广泛欢迎。",
    "C_course-v1:CIE+CIE2017005+2019_T1": "1998年，刘强东创业，在中关村经销光磁产品。2004年，因为非典，京东偶然之下转向线上销售。2014年，京东市值已超400亿美元，跻身全球前十大互联网公司之列。这是一个听起来很传奇的创业故事，但只有当事人了解创业维艰。刚转向电商时，传统企业前景光明，而电商看起来前途未卜，京东如何能毅然转型并坚持到底？资金匮乏的时候，京东靠什么说服投资人？在强大的对手面前，京东靠什么反超并一路领先？需要管的人增至几千甚至几万时，京东如何变革管理？当企业发展开始用制度来规范的时候，又如何保持创业型企业对市场变化的敏感度、以及快速而强大的执行力？以新的消费需求为导向，不断做出突破性的商业模式创新，说来容易，如何将它落到实处？作为一个曾经不受行业欢迎的“搅局者”，京东彷徨过，焦虑过，甚至四处碰壁。历经外界的不断质疑，京东最终成为互联网+的成功实践者。这其中的不断创新、突破，乃至颠覆，为传统行业的企业转型升级提供了经典的范本。 -------- 28年，从3个人到15万人，从2.1万元到2880亿的世界500强公司。华为，凭什么成功？凭什么决胜全球市场？凭什么成为西方企业家眼中最害怕的“中国企业”？英国《经济学家》认为：“华为的崛起，是外国跨国公司的灾难。”美国《时代周刊》惊呼：“这家公司已重复当年思科、爱立信这些卓著的全球化大公司的历程，如今这些电信巨头已把华为视为危险的竞争对手……”“大市场、高技术、高成长、高利润”的 ICT行业无疑是华为创业的绝好历史机遇，但华为在千军万马中决胜的关键不是外在的机会，而是基于“坚持以客户为中心，以奋斗者为本，长期艰苦奋斗”的企业文化，将15万个“秀才”造就成具有同一价值观和统一意志的“战士”，同时又避免将“战士”扭曲成“奴才”的强大的组织能力。任正非说：我们没有任何背景，也没有任何资源，我们除了拥有自己，其实一无所有……华为成功的关键是人的激活，人的激活的关键是有效的人力资源管理和强大的企业文化。 -------- 想了解和学习更多有关京东、华为成功的道与术吗？京东大学前执行校长马成功老师、华为国际咨询委员会委员田涛老师为你权威解读！ ",
    "C_course-v1:ZZU+20180116001+2019_T1": "科举被誉为中国古代第五大发明，是中国贡献给西方最珍贵的知识礼物，诗歌是唐代具有标志性的文学样式，当二者相遇又会体现出什么样的魅力呢？《科举与唐诗》将带您穿越时空，与那些科举名人、诗坛大咖同喜同悲，在了解科举文化、唐诗艺术的同时，为我们的学习、生活带来一定的启示。课程内容共包括十个单元二十二节，分别介绍了唐代以诗取士的原因、唐代应试诗的形式与命题、唐代的行卷诗、成功的喜悦、落第的悲哀、《游子吟》的内涵与外延、同“诗“不同”命“、卢肇的科举故事、《文选》、中原文化与科举诗、科举诗里的唐传奇。课程中有跨越时空的历史关怀，有超越自我的人文情怀，更有古为今用的价值取向。考核方式：平时作业60%，期末考试40%。",
    "C_course-v1:CIE+CIE2017008+2019_T1": "今天我们面对的未知和不确定越来越多，前不久阿尔法狗大败李世石让让雷军大呼意外，我相信很少人敢说：“我可以预见五年以后人工智能会发展到什么程度。”所以今天任何人想扮演先知，很快就会打自己的脸。今天的企业家不能奢望一个终级药方，“按照我的药方吃药病一定会好”在今天是一种幻想。在私董会的逻辑里没有人可以给你任何答案，但是私董会有一套专业的、已经验证行之有效的方法，帮助你探索适合自己的答案。在这样的时代背景下我们看到企业家的几大痛点：1、时间越来越碎片化企业家越来越追求在有限的时间里用最快速的方式解决问题，过去的方式虽然能够让他们在短时间内获得大量的知识点，但是无法消化，没有转化为解决问题的能力。2、对速度和效率的追求比工业时代高很多我们帮助企业家打开脑洞，但最关键的是打开脑洞之后要和高管团队达成共识，进入上下同理、万众一心的状态，对每一个企业来说最重要的就是15个人，我们不仅要解决开脑洞的问题，还要解决最后一公里，怎样让开脑洞的主意和想法落地。3、传统的经验不再有效过去我们谈领导力就会说通用电器，一讲二十年，一个字都不改；去年讲小米，今天就不好意思讲小米了，因为“小米也不行了”，哪怕是去年的经验，今年都不一定适用，因为产业环境变化太快，仅仅依赖经验已经不能看清未来，就像“U”型理论所指出的，把企业家的思考方式从过去转向未来，向未来学习，去感知未来，和团队一起创造未来，这才是今天最重要的学习和思考方式。怎样满足企业家的这些痛点？这就要求企业家的学习方式更实在、更高效，而且更混合，用培训圈专业术语来讲就是“翻转课堂”。私董会就是创造一个场域，让企业家和团队一起，在这个场域里一起感知、一起连接、一起创造未来，这样就找到了创新的源头，带来源源不断的创意。",
    "C_course-v1:XJTU+2018121301X+2018_T2": "牙周病是口腔常见的疾病之一，累及牙齿支持组织（包括牙龈、牙周膜、牙骨质和牙槽骨），是造成我国成年人失牙的首要原因，同时还与全身健康有着千丝万缕的联系。牙周病学是口腔医学中一门独立的专门学科，主要是研究牙周组织的结构、生理和病理变化，以及牙周病的诊断、治疗和预防。在这门课程中，我们将介绍牙周组织的解剖生理、牙周病的病因、诊断、治疗和预防的相关知识，希望为学习者提供专业、有深度的牙周病学知识。 ",
    "C_course-v1:CIE+CIE2016004+2019_T1": "在联想的柳传志看来，员工可以犯错误，但以下两类错误除外：第一是涉及原则、底线或生死存亡的重大错误,第二就是自己曾经犯过的错误。联想选择干部的标准之一是“有很强的总结反思能力”，其基本要求就是“不犯曾经犯过的错误”，也就是一定要有复盘的意识、掌握复盘的方法，能够在工作中不断把经验转化为能力。“复盘”，围棋术语，指对局完毕后，对弈双方复演该盘棋的记录，以检查对局中招法的优劣与得失关键。复盘并不是简单的将对弈的表面过程重复一遍，而是在复演的过程中，重新审视对弈中的思维过程与逻辑依据。柳传志先生在2001年联想投资成立之时，正式提出“复盘”这一概念，并在年的联想文化作用机制报告中明确把复盘作为联想的核心价值观和重要方法论，并且体现出极强的操作性和实践性。万达创始人王健林给“复盘”定了调子：核心就是“复盘既是研究创新，也是管理推动”。他明确指出：希望今后每年至少选三到五个项目复盘总结。“复盘”不仅仅是一种价值观和方法论，更多的是一种学习能力的体现，通过开放心态，坦诚表达，实事求是，反思自我，集思广益而不断地提升自我，提升业务能力。事实上，不仅在联想，西点军校、英国石油、万达集团等大型企业和组织都非常重视复盘。互联网时代的创业环境中，产品、服务、商业模式、品牌等都处于快速迭代的模式之中，随时随地的复盘正是个人和组织能力紧跟时代步伐，进而领先竞争对手的的不二法宝！",
    "C_course-v1:CIE+CIE2017004+2019_T1": "好的商业计划是你企业发展的基础，不仅能为你吸引到优秀人才，促使你获得投资人、合作伙伴和更多资源的支持，还能辅助你勾勒出企业发展的路线图，令你创业有据，帮助你的企业迈出走向成功的第一步。如何写好一份商业计划书？如何陈述好你的商业计划？如何评价并不断完善你的商业计划？都是你作为创业者应当关心并着重思考的话题。学堂在线中国创业学院频道《商业计划书开发与陈述》课程，将与你共同探讨这些话题！本课共有三个部分，分别针对以上三个话题。授课嘉宾包括：张帏，清华大学经济管理学院长聘副教授、清华大学创意创新创业教育平台创始主任、清华大学中国创业研究中心副主任，指导了多支学生创业团队在各级创业计划大赛上获得多个金奖；雷霖，清华控股副总裁、清控资产管理集团总裁、启迪创投创始合伙人，全面负责清华控股金融投资业务运营和资产管理工作，资产管理规模超过200亿元人民币；田雨，启迪创投投资总监，参与了对多家企业的直接股权投资，同时帮助多家公司设计和完成债权融资计划，包括电旗通讯、沃尔德、沃捷传媒、宏邦节水、SolarVista、中文在线等；徐中，学堂在线中国创业学院院长，领导力学者，首届“挑战杯”中国大学生创业计划竞赛金奖团队队长，多次担任中国最高级别大学生创业计划赛事的评委。",
    "C_course-v1:WUT+1022817X+2019_T1": "让我们看看互联网上一分钟发生了什么？全球IP网一分钟传送639TB，发送2亿封邮件，Facebook新增27.7万用户，发生六百万次访问，Google发生2百万次搜索查询，Flicker有2千万次访问照片，Twitter新增10万条信微博，Youtube上载30小时的视频，发生130万次观看，2015年的你要用5年时间才能看完在互联网上一秒中所传的视频。数据正以前所未有的速度在不断的增长和累积，大数据时代已经来到。如何从数据中发现有趣的知识，并将其应用到具体的领域之中？数据分析与挖掘技术让你通过纷繁复杂的现象，看到背后隐藏的规律和模式，修炼一双在信息时代的慧眼。《互联网大规模数据分析技术》这门课程从大数据的基础技术入手，首先介绍大数据处理平台Hadoop和Spark、非关系数据库NoSQL、MapReduce分布式并行编程模型等；然后重点讲解数据挖掘中的经典算法。接下来解剖信息检索和推荐系统两大Web主流应用的原理和模型，并通过例子加深对这些问题的理解。同时推荐Lucene和Mahout两个开源工具包，可以快速搭建属于自己的全文搜索引擎和商品推荐应用系统。最后给出了信息过滤系统的评价体系，便于从学术的角度对系统性能进行分析。",
    "C_course-v1:CIE+JD_2017+2019_T1": "“咱们创业吧”已经成为中国时下最流行的一句话，推进“大众创业、万众创新”，是发展的动力之源，也是富民之道、公平之计和强国之策。 创业离不开创新，创新是创业的灵魂。我们能在夜晚灯火通明，是因为富有创新精神的爱迪生发明了电灯，我们能在世界各处分享彼此的生活，是因为富有创新精神的伯纳斯·李发明了万维网……创新让生活更加丰富多彩，而技术的产业化让生活更加便利。在国内，曾经一度领先的龙头民企几十年后仍然在生产电风扇，告诉我们创新与否的重要性。在国际上，发明了数码相机的百年老店柯达最终败亡于数码相机业务，启发我们不光要做好创新，还要做好创新管理。想知道什么是创新？怎么去创新？如何让技术更好地产业化吗？且听清华大学经济管理学院吴贵生教授为你讲述《创新总论与技术产业化》。",
    "C_course-v1:MITx+15_390_2x+2019_T1": "不要在意你的客户能为你做什么——而是要关注你能为你的客户做些什么。在《创业101》中，我们已经学会站在客户的立场去观察这个世界——这是一个非常棒的视角！但我们的课程远未结束。目的地就在眼前，虽然近在咫尺，但我们还要继续学习。创造出一个能满足客户需求的伟大产品和找到目标客户同样重要。然而客户如何获得你的产品呢？产品又是如何满足客户需求的呢？你的产品将为客户带来哪些价值？你的秘诀又是什么？面的市场竞争你会如何积累优势？在中小企业市场营销、城市设计、语言教育、医疗以及企业支持服务这些形态各异的领域中，我们将利用深度的案例研究来探讨它们是如何构建产品概念、满足客户需求、树立明确的价值定位并从中提炼出商业秘诀，理解它们之间的竞争。课程还要继续。你准备好了吗？客户在等我们呢。",
    "C_course-v1:CIE+CIE2017002+2019_T1": "今天，几乎在所有的工作领域，将工作细化为一个个相对独立的“项目”的趋势越来越明显。企业制胜的关键在于一个又一个项目的成功，项目的选择、评价和项目的管理在西方发达国家应用十分普及，它的理论和方法从根本上决定了企业的经营成败和运作效率。很多时候，成功的关键并不在于你的工作是否努力，而在于你能否有效地参与工作。为了使每一位创业伙伴能更高效地参与并完成企业的经营管理工作，把握每一个项目所带来的机遇。中国创业学院邀请了清华大学经管学院的李纪珍老师担任本课的主讲嘉宾，与同学们分享项目管理的相关知识体系与方法论。课程系统梳理了项目管理的历史脉络与发展状况，归纳总结了成功项目管理的四个方面和八大要素。愿每一位同学能在课程理论的学习与自身工作的实践中，不断提高项目管理水平，为自己的创业成功打下坚实的基础。",
    "C_course-v1:CIE+CIE2017001+2019_T1": "创新的灵感到底从何而来？为什么创新需要心理学？创业者在创业维艰的过程中，如何保持一颗积极、乐观、坚韧、自信、坦然的心态？当你思考上面的问题时，你就需要这门课！让最受欢迎的心理学慕课课程导师、清华大学心理学系主任，美国伯克利加州大学终身教授彭凯平老师，为你揭秘创业成功背后的创新密码，让你找到打开创新创业大门所需的心理学钥匙。我们相信，任何事情，一旦让你产生浓厚的兴趣，使你沉浸其中，物我两忘，你就能去不断地为之奋斗、创造和探索——在此过程中，你将感受到一种发自内心的兴奋、喜悦、感动和升华。你所获得的，不仅将是一种幸福的体验，还将是事业上的全新高度。希望你能在工作生活中灵活运用积极的心理学工具，不断迸发创新的灵感，为你企业的发展挖掘出来自人性深处的源动力！ ",
    "C_course-v1:CIE+CIE2016002+2019_T1": "从世界范围内看，创业成功的概率低于5%，三分之一的企业创立之后的2年就死亡，50%的企业存活时间不超过5年，而企业最终是上市或者被收购的概率不到1%。2015年下半年以来，资本寒冬不期而至，中国兴起的第四次创业大潮呈现“冰火两重天”的状态，“创业失败”几个字眼的出现频率越来越高。人们常说：“失败乃成功之母”。失败并不可怕，可怕的是不知道为什么失败。如何避免失败？成功的创业难以复制，创业失败的原因却往往大同小异，有着相似的规律。 林嵩博士是中央财经大学最年轻教授之一，长期致力于创业失败的研究，总结出了一套创业失败的规律和走出失败的四步法。本课程一方面通过剖析创业失败的经典案例，寻找创业失败的典型原因，使创业者正确认识创业失败的基本规律，另一方面帮助创业者梳理如何应对失败、实现发展的路径和方法，进而为创业者揭示战胜失败、走向成功的可行道路。 ",
    "C_course-v1:BNU+GE410081071-01+2019_T1": "课程 《循环经济与可持续发展型企业》围绕循环经济专题，以物质在人类社会经济系统中的循环流动为核心，采用讨论式教学法，模拟科学研究与应用管理过程，分享可持续发展管理、物质循环流动、循环经济实施、可持续发展型企业构建与管理等基本内容。共14讲，32学时。提升学生认知与科研能力，培养文、理、工复合型创新人才。",
    "C_course-v1:HIT+HIT2016001+2019_T1": "十六世纪冰壶运动起源于苏格兰，是当时冬季人们在结冰的江河或池塘上玩的一种溜石游戏。由于项目自身所具有的独特魅力，很快在欧美许多国家流行起来，目前冰壶运动已发展成为全球性运动，并且作为正式比赛项目出现在奥运会上。1995年冰壶传入我国并很快发展起来。截止目前，我国女子冰壶队多次在世锦赛上获得奖牌、奥运会曾夺得铜牌，男子冰壶队也取得世锦赛和奥运会第四名的优异成绩，标志着中国冰壶跻身世界冰壶强队之列，受到世人的瞩目。冰壶课程主要内容包括：冰壶运动起源与发展、冰壶场地与器材、冰壶技术原理、冰壶教学、冰壶战术、赛事欣赏以及国内外赛事介绍等。通过幕课教学过程，使学生了解冰壶运动历史、传统和项目特点，树立终身体育观念；掌握冰壶基本的比赛技、战术知识和相关比赛规则，为实践操作和观赏比赛打好坚实基础。",
    "C_course-v1:BNU+ENV21105101+2019_T1": "课程以认识固体废物的基本特性为基础，通过对固体废物处理与处置单元的技术原理、工艺方法、设备装置的讲授和工程实例的探讨，使大家总体上把握固体废物处理与处置技术基础理论知识，具有实际从事固体废物处理处置设计与过程操作的基本技能。  曾获北京师范大学精品课程，北京师范大学通鼎青年教师奖，北京师范大学教学成果二等奖，北京师范大学第12届青年教师教学基本功大赛三等奖，北京师范大学第1届多媒体教学软件比赛优秀奖。  校内春季开课，已连续讲授15年，针对环境工程专业本科生。本课程讲授深入浅出，理论联系实际深受学生喜爱，每年教学评价4.9分以上。  考核机制：在完整学习视频课件的基础上，章节测试和期末测试分别占总成绩的60%、40%，最后总分60即为通过。",
    "C_course-v1:TsinghuaX+00510663X+2019_T1": "本课程从行业、企业和个人三个层面，引导学生观察、理解商业世界、企业经营的基本逻辑，对企业的创立、成长、挫折、持续成功等有更深入的了解，并对企业管理的各类工作组成——如战略、组织、领导、创新等建立初步认识。课程适合于没有相关领域知识基础、但对商业社会有兴趣的学生。课程会围绕与商业社会运营相关的、最重要的十个核心概念展开。每一次课程会梳理一个基本概念，十个概念前后相接，形成一个关于商业社会基本运作的、逻辑完整的知识体系。",
    "C_course-v1:TsinghuaX+00690242X+2019_T1": "中国考古学是以往100年中发展最为迅速的领域之一，大批珍贵文物的出土，不断刷新人们对文化中国的认识。本课程以4-6件（组）精品文物作引子，将学术界探索中华文明的过程作为线索，介绍古代中国在造船、玉器等诸多领域的杰出成就，其中不乏学术前沿的考古发现与研究成果，内容精彩纷呈，雅俗共赏，学生可以藉此获得对文化中国全方位的、直观而深入的认识。",
    "C_course-v1:FZXY+20171127004+2019_T1": "《灾害风险管理》课程简介 灾害风险管理是运用现代风险科学原理和方法来研究人类为了减小灾害的潜在危害及其造成的生命、经济和环境损失，对不确定性灾害事件进行系统管理的创新课程。灾害风险管理是近年伴随国际减轻各类灾害风险、防范巨灾风险的进程中，逐渐发展起来的一门综合性多学科交叉学科。灾害风险管理的形成和发展，一方面拓展了灾害科学的内容，使人们对灾害问题的认识添加了防患于未然风险管理思想；另一方面也使灾害管理学在更为战略和前瞻的基础上得到了发展。这对于人类减轻灾害风险，实现人类社会的可持续发展，具有重大的理论与现实意义。灾害风险管理课程内容由灾害风险评估和处置两部分组成。灾害风险评估以灾害风险分析为核心，包括灾害风险识别、灾害风险估计和灾害风险评价的理论方法和实践应用，主要分析致灾因子与脆弱性关系、灾害损失定量与定性方法、可接受风险评价和风险管理决策问题；灾害风险处置以风险控制和风险转移理论与实践为依据，主要分析灾害风险控制措施的目标、机制和效应；巨灾保险及证券化等灾害风险转移措施的创新应用。 本课程分为四篇，每一篇具体章节安排如下: 第一篇 灾害风险管理基础，具体分为四章：第一章 风险；第二章灾害风险；第三章 灾害风险管理；第四章 灾害风险管理流程。 第二篇 灾害风险分析，具体分为5章：第一章 灾害风险识别与度量；第二章 损失分布与风险估计；第三章 区域自然灾害风险评估模型；第四章 生命统计价值评估；第五章地震灾害风险分析。 第三篇 灾害风险评价与决策，具体分为2章：第一章 灾害风险评价；第二章 灾害风险管理决策。 第四篇 灾害风险管理与保险，具体分为4章：第一章 灾害风险管理控制；第二章 巨灾保险/再保险；第三章 巨灾风险证券化；第四章地震巨灾风险管理框架（计划）。 本课程的学习不仅为学习其它防灾减灾相关专业课程建立理论基础，而且能够掌握灾害风险分析工具，用来认识和理解现实中的灾害风险问题。 ",
    "C_course-v1:TsinghuaX+00040132X+2019_T1": "宝玉石的基本概念、属性、分类和地质成因，人类宝玉石文化的历史。宝玉石的自然特性：颜色，光泽、透明度、色散、多色性、折射及双折射、特殊光学效应（星光、猫眼、变彩、变色效应等）、硬度、韧性、解理和断口、密度。宝玉石的常规鉴定方法。影响宝石品质（价值）的因素：品种及档次，质量、重量、款式、艺术及工艺。钻石、红宝石、蓝宝石等20几种单晶质宝石的品种、特性、地质产状、产地及有关文化历史。和田玉、翡翠、玛瑙等10几种多晶质宝石（玉石）的品种、特性、地质产状、产地及有关文化历史。琥珀、珊瑚等几种有机宝石的品种、特性、产地及有关文化历史。",
    "C_course-v1:TsinghuaX+00691153X+2019_T1": "【国家精品课】本课程在艺术史、美学理论、思想史和文化史的交叉融合的基础上，通过对经典艺术作品的比较和分析，帮助学生系统了解中西艺术史的发展和特点，梳理中西艺术的艺术观点和美学理论。在课程安排上，抓住重点，以点带面，尤其注重处理中国和西方、传统与现代的对比，力求使学生不同艺术形态的转换有完整的认识。其目的最终落于教学的出发点，即提高学生的审美判断力、欣赏力，涵养艺术趣味，培养具有人文情怀的专业人才。",
    "C_course-v1:TsinghuaX+10800163X+2019_T1": "通常的艺术史及艺术创作课程，会引导人们了解过往的文化，会指导人们体验曾经的艺术，前者侧重理论研究，后者侧重创作实践。但无论是理论，还是实践，都并不容易介入人们的生活，它们只是生活的样板和艺术的楷模，而不是生活和艺术的本身。虽然我们不是因为艺术而活着，但艺术确是由于我们才存在。《艺术的启示》这门课致力于消除艺术与生活的隔阂，消除艺术与公众的隔阂，让艺术像阳光、空气和水一样，蕴育和滋养我们社会中的每一个人。本门课程在引导学生敬仰艺术、热爱艺术的同时，更注重学生独立思考能力的引导，更注重学生思辨能力的培养。从阅读、欣赏优秀的艺术作品开始，学生要学会判断、学会分析、学会质疑。从参与、制作自己的艺术作品开始，学生要体会创意、体会创作、体会创新。我们研究艺术的目的，终究还是为了研究生活。我们通过艺术去体会纠结，通过艺术去应对烦恼，通过艺术去寻求创造，并且最终达到心灵的和谐、精神的和谐。在这里，艺术的理论+艺术的实践，等于“艺术的生活”！",
    "C_course-v1:TsinghuaX+00670122X+2019_T1": "中国文人生活的厅堂之雅，在宋代已形成“文人四艺”的琴棋书画，和“生活四艺”的插花、点茶、焚香、挂画。经过数千年的传承与发展，生活四艺不仅是技艺，更可从中领悟人与天地自然合一之妙，体验一种智慧、高雅、优美的生活方式，借以修身养性，渐而入道。   生活美学系列课：  1.插花之道：以插花为主线；  2.花香茶之道：延伸到园艺、香之道、茶之道等内容。课程将邀请有关的业内嘉宾，以及爱好者一起来互动与分享。  插花是将鲜切植物素材（枝叶花果等），配以合适的器皿，经过一定的修剪技术和造型艺术，重新创作出一件抒情表意的精致艺术品。通过插花的仪式和创作过程，放下杂念，让心得以宁静，体悟天地自然之性情，之花道。课程首先梳理东西方插花的发展脉络，从插花看中国、日本以及西方花文化的不同特征，以及相互影响和融合的过程；然后进入到插花的操作层面，如植物知识、色彩构成，东方插花构成等。在此过程中，认识和亲近植物花卉，关注内心体验，平衡心理，培养优雅的生活方式和社交礼仪。 授课教师：刘惠芬特邀嘉宾：陈含章：中国新闻出版研究院副研究员 相忘于山水（文）；感受四季清华（文）任珊珊：山东省民政厅公务员生活美学如咖啡中的奶和糖王诗琪：英国帝国理工博士生生活美学课结缘两年刘霖林：中信证券研究员更优化的大学生活张培力：中国女摄影家学会会员、美国摄影家学会会员花仙子毕鲜荣：清花道插花老师自由式花型示范朱丽红：清华大学生物医学院博士新年花型示范施文荻：清华大学硕士研究生王钰欢：清华大学硕士研究生插花练习与示范慕课设计制作  编导：刘惠芬  助教：施文迪，王彩臻",
    "C_course-v1:TsinghuaX+30806872X+2019_T1": "本课程以贾玺增博士主讲的清华大学精品课程《中国服装史》内容为基础，邀请中国最优秀史学专家、收藏家和复原团体，通过大量丰富的考古实物、图像资料，从物质生活、社会审美风尚变迁的角度，解读中国服装历史发展演变、文化内涵与象征意义，对比展示中国传统服饰的艺术风格、服装式样、裁剪结构、工艺细节，分析中国传统服饰元素时装转化的技巧与路径，海量举例名师大牌历史元素时装设计的成功案例，在中国服装史与时装设计之间搭建桥梁，对学习中国传统服装史、理解中国古代流行时尚，以及有效利用中国服装史元素，活学活用、学以致用地进行时装设计具有极大的现实意义和参考价值。",
    "C_course-v1:SDSNAssociation+CSN+sp": "The time to address climate change is now. The mean surface temperature of the Earth has risen dangerously and spurred devastating impacts – and not just on natural ecosystems worldwide, but on daily human life. We are currently on pace towards a temperature increase of 4°C or more this century, while scientists and policymakers propose targets of just 1-2°C to avoid the total destruction of the planet. In this course, learn solutions to mitigate the effects of the global greenhouse gas emissions causing temperature rise, and how to apply these solutions in different national contexts improvements.",
    "C_course-v1:SDSNAssociation+ECD001+sp": "What does a successful early childhood care program look like? How has a child’s brain developed at the age of 3? How does nutrition impact the future well-being of a child into adulthood?Learn the answers to these questions and more in The Best Start in Life: Early Childhood Development for Sustainable Development. With leading experts in the field – hailing from Harvard University, New York University and UNICEF, among other institutions – we’ll explore how neuroscience, sociology, anthropology and other studies have influenced our understanding of early childhood development",
    "C_course-v1:SDSNAssociation+C21001+sp": "According to the United Nations, urbanization and population growth could result in an increase of 2.5 billion people into urban populations by 2050, with associated impacts ranging from increased transportation needs to more building. How do we make cities sustainable to support this growth? In this mini-series, learn the challenges of local governments to adapt to new technologies, energy systems, modes of transportation and more in order to build the sustainable cities of the 21st century. This mini-series is a companion piece to the SDG Academy's full-length Sustainable Cities course.",
    "C_course-v1:SDSNAssociation+TOW001+sp": "In this course, learn all about the 17 Sustainable Development Goals (SDGs). In September 2015, the world’s leaders signed on to this new agenda, answering the call for a global vision of important social, economic and environmental needs to support the planet and its people in long-term prosperity and survival. The goals include a set of key areas of focus, as well as detailed targets to put our planet on track for this continuing sustainability through 2030 and beyond. Sustainable development is not just a problem for future generations. It is a shared global responsibility now and forevermore to be thoughtful stewards of our entire world – from developed countries to developing countries, from high-level policymakers to individuals.",
    "C_course-v1:SDSNAssociation+SC001+sp": "Did you know that experts estimate an additional three billion people will live in cities by 2050? What will the impact be on the current world population – half of which currently lives in cities and contributes to about three-fourths of global economic output? The opportunities are vast but so, too, are the potential issues. In Sustainable Cities, you will learn about the major challenges currently faced by urban areas around the world – including poverty, unemployment, poor housing infrastructure, and constraints on productivity – and the extraordinary potential of these areas to enable change in the future. From infrastructure to culture to economic opportunity, learn how harnessing the power of urban development for global progress is imperative. This course examines how urban sustainability can be delivered with increasing productivity and reduced inequality; provision of universal basic services and infrastructure; protection of the urban environments; and other solutions and investments, both speculative and in action around the world. You will emerge from this course understanding how governments, private stakeholders and other actors can improve urban development to heed the call of Sustainable Development Goal 11 – making cities and human settlements inclusive, safe, resilient and sustainable by 2030.",
    "C_course-v1:TsinghuaX+10800032X+2019_T1": "本课程为清华大学人文素质核心课程。自从地球上有了人类，工艺美术也就开始产生了。一部工艺美术史，实际上也是人类文明不断发展，演变和进步历程的形象记录。上下百万年，人们创造的分布在世界各地、难以数计的工艺美术作品，无一不是人类文明高容量的载体。外国工艺美术史研究是人文学科中的重要环节。它对培养国人的文化素质，提高我国综合素质教育质量，完善人文学科，树立学术形象，提升综合学术地位，皆有重要意义。",
    "C_course-v1:TsinghuaX+00670122+2019_T1": "中国文人生活的厅堂之雅，在宋代已形成“文人四艺”的琴棋书画，和“生活四艺”的插花、点茶、焚香、挂画。经过数千年的传承与发展，生活四艺不仅是技艺，更可从中领悟人与天地自然合一之妙，体验一种智慧、高雅、优美的生活方式，借以修身养性，渐而入道。  生活美学系列课： 1. 插花之道：以插花为主线； 2. 花香茶之道：延伸到园艺、香之道、茶之道，以及礼仪化妆等内容。课程将邀请有关的业内嘉宾，以及爱好者一起来互动与分享。授课教师 主讲：刘惠芬 特邀嘉宾： 张智慧： 清华大学土水学院教授普洱茶的生活潘江琼： 清华大学园林工程师清华园景观植物介绍沙垚： 清华大学学生茶文化协会创会会长品茗美学罗子杰： 中国非遗协会香文化委员会副主任沉香与香席高佳逸： 中国非遗协会香文化委员会委员沉香与香席冷帅： 北京天福茗茶文化中心文化总监评茶与品茶张琳： 北京同可轩茶艺师评茶与品茶陈晨，佳丽宝化妆品培训经理化妆技巧与实操赵清华，佳丽宝化妆品培训经理化妆技巧与实操张东，佳丽宝化妆品彩妆师化妆技巧与实操张海静：深圳公务员香烛DIY  田慧： 北京IT从业中国十大名花体验Elizabeth Gasson：英国剑桥大学博士生英式下午茶体验邓俊辉，清华大学计算机系副教授书法作品高榕：书法作品蒋茹茹： 清华大学新闻与传播学院学生书法作品施文迪、刘书田、范煜群、孙子涵、冯真真、吴淑平、田力等： 清华大学在校生课程互动慕课设计制作 编导：刘惠芬 助教：马思冰，施文迪，王馨逸，张蓉 资料：张然然，刘梦洁，宋钰，马姚姚，孙子涵，范煜群，杨茂艺 录制：王建一，李御龙，韦颔龙，吕子涵，田力，刘新华图像与动画：马海博，范雅頔，高天仪，刘明惠 清花道编辑：饶饶，张然然，孙滢滢，刘梦洁，刘书田 清花缘书法：李哲，朱旭，蒋茹茹，安小展  线下活动：邱静，毕鲜荣，年英梅，饶饶 特别致谢原创图片分享： 清华大学教师摄影协会： 吴倬，郭泓，景纬，张军生活美学慕课花友： 何柳霓湖南青竹天津静文武汉陈纯丁厦门张小梅西安李月星西安冯真真北京感谢清华大学教工摄影协会的支持！ 感谢“现代生活美学”选课同学的互动参与，作品分享！ 感谢慕课学员们的互动参与，作品分享！ ",
    "C_course-v1:TsinghuaX+THU201605X+2019_T1": "“信息素养——学术研究的必修课（通识版）”是一门让学习者终身受益的关于方法与技能的课程，无论你处于哪个年龄段，无论你拥有何种专业背景。课程开篇会有人与你聊聊他对信息素养的认识，聊过之后你可以顺便测一测自己的信息素养水平，包括在很大程度上决定你信息素养水平的信息检索与利用的能力。如果你希望继续学习，接下来的内容包括：① 文献信息检索的基础知识；② 信息检索的误区和常见问题；③ 从检索案例出发，探讨信息源的利用、检索方法与技巧；④ 利用参考工具检索各类数据与事实；⑤ 享用一切可以利用的网络信息资源；⑥ 认识学术交流模式，学习学术规范；⑦ 做好知识与文献管理，利用现代技术与工具提高工作效率。",
    "C_course-v1:TsinghuaX+30805743+2019_T1": "艺术对于不同的人、不同的时代有着不同意义，艺术家对大自然和周边事务的感受和描述亦会不同。传统美学遭到挑战，传统定义的美也已经不是人们普遍认同的标准。我们试图将历史，人文的环境暂时抛开，先将艺术的形成部分抽象的分解开，从而一步步的去了解艺术的成因，得出自己的、有时代印记的、有创造性的艺术定义，建立起你自己的视觉艺术体系和风格。这门视觉语言课将让你对形成视觉艺术的基本规律有一个新的认识，课程要求学生初步了解艺术史，有兴趣探索视觉艺术新的可能性。我们期待着你的参与，共同推进视觉艺术的发展。",
    "C_course-v1:TsinghuaX+40510293X+2019_T1": "本课程内容包括三部分，各占1/3课时：一是金融工程的金融学原理。这部分内容介绍新古典理论即无摩擦条件下的资产定价模型，包括CAPM、无套利定价理论以及因子模型。我们还将讨论在有摩擦市场条件下新古典模型的适用性。二是金融衍生品定价方法。我将介绍金融衍生品的定价原理即无套利定价模型。我将主要采用二叉树方法讨论金融衍生品的风险特性和对冲决策。三是如何采用结构化金融产品设计用于解决企业风险管理、投融资决策等实际问题。我将采用案例教学方法，运用典型案例分析金融工具如何在不同商业环境中为企业解决实际问题。参考资料:1、Option",
    "C_course-v1:TsinghuaX+30670043X+2019_T1": "传播学是一门探索和揭示人类传播的本质和规律的科学。也是传播研究者在最近几十年对人类传播现象和传播研究成果进行系统分析和有机整合而发展成的知识体系。它包括对传播活动的描述、对传播关系的分析、对传播行为的约定、对传播难题的探讨。与社会学、心理学、政治学等相比较，传播学是一门位于诸多学科交叉地带的具有一定应用性的新兴独立学科。",
    "C_course-v1:TsinghuaX+00740123X+2019_T1": "课程目标：掌握Java的基础语法、面向对象的程序设计方法；初步了解GUI程序开发方法；主要受众：程序设计初学者。无先修课程要求，如有一点编程基础更好。主要内容：1、Java语言基础知识；2、类与对象的基本概念；3、类的方法；4、类的重用；5、接口与多态；6、输入/输出流；7、Java集合框架；8、图形用户界面；",
    "C_course-v1:TsinghuaX+2018031901X+2019_T1": "本课程是在清华大学公开课《中国国情与发展》的基础上，结合最新的党的十九大提出的习近平新时代中国特色社会主义思想，对以人民为中心的新发展理念特别是五大发展的进一步解读和阐释，校内讲授学时为12学时。课程从以人民为中心的新发展理念的发展沿革出发，系统地讲述了紧紧围绕以人民为中心的五大发展理念。课程内容共分为六讲：以人民为中心的新发展理念、创新发展、协调发展、绿色发展、开放发展、共享发展。通过课程的学习，学生将对中国共产党始终以人民为中心的核心思想有一个系统和全面的了解，学习和体会以人民为中心的社会主义现代化内涵，理解创新、协调、绿色、开放、共享的深刻内涵和现实实践，进而对中国特色社会主义道路有更深刻的认识和理解。本课程不但适合于高年级的本科生以及硕士生、博士生学习，也适合于各级党政领导干部等感兴趣的人员学习。考核机制：除课程视频学习外，本课程设置了考核环节，总分计100分。其中每一讲将设置测试题，占总分的40%；结课考试占60%，由单选题、多选题、判断题、主观题组成。测试题和结课考试的加权分数为最终成绩，60分以上合格，85分以上优秀。",
    "C_course-v1:HNU+GE14068+2019_T1": "《孙子兵法》是中国古代军事谋略的集大成之作，蕴涵着极为丰富的认识论、方法论，是历来兵家、商家、政治家、外交家特别推崇的一部经典著作。本课程集中精讲《孙子兵法》的历史价值、地位影响、现实意义、基本内涵、思想特色，及其若干基本思想等，有助于在深入了解我国优秀传统文化过程中提升大学生的综合人文素养，培养他们独立分析问题和解决问题的能力，是适合全体文、理、工科学生选修的文化素质课程。",
    "C_course-v1:TsinghuaX+10691113X+2019_T1": "如果对人类历史做一个大致的划分，那么它可被分为古代社会与现代社会。不管是古代社会还是现代社会，都与人类的思想密切相关。人类社会的真正改变是由思想的改变引导的，并且是由思想确立的原则塑造的。古代社会之为古代社会，就在于它是奠定在由古代思想确立的五大原则之上：一，目的论原则；二，善高于一切的原则；三，责任与服从优先的原则；四，统治的合法性来自人之外的超越者的原则；五，集体优先于个人的原则。这些原则都是通过兑换成责任原则得到贯彻与落实。所以，古代社会首先是以责任原则去规定人与人之间的关系，并借此构建人间秩序。“启蒙运动”通过对人类个体自由的深度自觉与系统论证，为现代社会确立起不同于古代社会原则的一系列基本原则：1.自由优先原则；2.个体先于集体原则；3.权利与责任并行原则；4.统治的合法性来自于被统治者的授权与认同的原则。这些原则可归结为权利原则，现代社会是以权利原则去构建人间秩序。这门课将通过讨论以下问题来展示上面这些主题内容：人类思想是如何为古代社会确立起那些构成其秩序基础的基本原则？如何放弃和改变这些古代原则？又如何确立起那些把人类带进现代社会的基本原则？人类个体为什么有责任？又为什么有权利？",
    "C_course-v1:FJNU+5000320201+2019_T1": "《走进性科学》是大学生科学文化素质教育课程，以性生物学、性心理学、性社会学和性教育学等研究性科学发展规律的学科为理论基础，从人类性的生物属性、心理属性和社会属性等三个角度，联系学生生活实际，对大学生进行系统的性教育过程。通过系统教育，让学生走进性科学，揭开性的神秘面纱，使学生初步掌握性的基本知识，消除性愚昧和性无知，预防性传播疾病，促进性生理和性心理正常发育，促进健康人格的形成；指导人们树立健康的性观念和性形象，规范人们的性行为，建立和谐的人际关系，并为恋爱、择偶、婚姻家庭生活作好准备，促进人格全面发展，提升社会文明进步。",
    "C_course-v1:HUBU+20170227X+2019_T1": "葡萄牙语是世界第六大语言，在亚、非、欧、美等四大洲的葡萄牙、巴西、安哥拉、莫桑比克、佛得角、几内亚比绍、圣多美和普林西比、东帝汶以及中国澳门等国家和地区都以葡萄牙语为官方语言，全世界有近2亿人口讲这种语言。巴西葡语和以葡萄牙为代表的欧洲葡语在语音、词汇、语法等方面都稍有区别，本课程葡语发音以巴西葡语为主，从生活、学习、工作中的日常内容着手，深入浅出的传授语音、词汇、句型等语法知识。针对每个话题，提供对话和课文对应的中文翻译，对每一课重点词汇与句型进行讲解，还会穿插巴西和葡萄牙等葡语国家的文化小常识。通过学习本课程，学生能够运用葡语进行日常会话，具备扎实的基础葡语语法知识。",
    "C_course-v1:TsinghuaX+00510133X+2019_T1": "会计学原理讲解会计的原理性知识，包括会计的基本理论、基本规则和基本方法，这些原理性知识是人们通过长期实践、从感性到理性的不断总结，概括出共同的、带有规律性的内容而形成的。通过本课程学习，你可以了解会计工作的一般规则，理解主要财务信息的基本含义，看懂财务报表的主要指标，在此基础上能够进行通用财务比率计算和财务状况与经营成果分析。学完本课程如果你对会计学产生了浓厚的兴趣，那么这为你在会计学领域继续深造奠定了基础。本课程主要以财务会计为核心，讲解会计的基本概念、核算方法、会计原则、主要经济业务的处理、财务报表的编报和通用财务比率的计算与分析，其中包括会计业务涉及的企业组建、投资融资、资本市场、税收制度等方面的相关知识，围绕这些核心内容再将管理会计、公司审计和内部控制联系在一起，使你建立起市场经济条件下的会计整体观念。课程章节第1讲  绪论• 会计的概念• 企业的组织形式和经济活动• 会计对象与会计要素• 会计等式与会计事项• 主要财务报表第2讲  会计核算基本方法• 经济业务对会计等式的影响• 会计科目和账户的设置• 借贷记账法第3讲  会计核算实务• 会计凭证• 会计账簿• 财务报表• 会计循环与会计核算形式第4讲  会计的概念框架和会计规范 • 会计目标和会计原则• 会计假设和会计计量模式• 会计规范第5讲  货币性资产• 货币资金• 应收款项• 交易性金融资产第6讲  存货• 存货成本与销售成本• 存货的记录制度• 存货的确认与计量• 发出存货与库存存货成本的确定• 货物的保管与报告• 涉及流动资产的财务比率第7讲  固定资产与无形资产• 固定资产及折旧• 无形资产及摊销• 相关财务比率分析第8讲  长期负债• 货币的时间价值• 长期借款• 公司债券• 涉及负债总额的财务比率第9讲 所有者权益和长期投资与金融工具 • 所有者权益 • 长期股权投资• 金融工具概述• 持有至到期投资• 可供出售金融资产第10讲  流动负债和收入、费用与利润• 流动负债• 收入与费用的确认和计量• 利润与净利润• 若干财务比率分析第11讲  现金流量表及合并报表• 现金流量表• 合并财务报表• 财务报告之审计与内部控制第12讲  国际财务报告准则和管理会计基础• 会计准则的国际趋同• 国际财务报告准则的主要内容• 管理会计的主要内容• 成本性态及成本分解• 本-量-利分析• 资本预算与投资管理",
    "C_course-v1:TsinghuaX+00720091X+2019_T1": "足球运动是世界上开展最广泛、最受人们喜爱的体育运动项目之一，被称为世界第一运动。现代足球运动的科技含量、文化价值和社会影响与日俱增。足球的影响已经超越了运动的范围，融入政治、经济、教育、文化等各个领域。本课程通过网络学堂，结合教师的讲解、比赛视频画面分析及动画等手段将足球运动的基本知识和所蕴含的科学理论详尽的展示给同学们。使学生从全新的视角学习、理解、掌握足球运动的基本知识和科学规律，感受足球运动的独特魅力，激发学生热爱足球运动，积极参与足球运动的热情、增强体质，陶冶情操，促进学生的身心和谐发展。授课内容如下：第一章：足球运动简介及历史；足球技术；足球运动的物理规律第二章：足球战术；足球运动的统计学；教练员第三章：足球运动中的体能（机能、身体素质、身体形态）；足球运动中的生理学；足球运动中的对抗及运动损伤与预防第四章：足球的社会意义和人文价值；足球运动中的体育精神；足球运动中的心理学第五章：足球竞赛规则及裁判；场地设备；足球运动的设计第六章: 现代足球运动的技术、战术的发展趋势",
    "C_course-v1:TsinghuaX+30240532X+2019_T1": "本课程是“程序设计基础”的后续课程，重点在于提升和强化学习者的抽象思维能力，培养对于变与不变的深刻理解。课程将以C++语言为媒介，以任务驱动为手段，引领学习者掌握如何用C++语言提供的各种技术手段来对复杂世界及其蕴含的关系进行描述。本课程希望学习者已学习过一门高级语言，已掌握了一些基本的编程技能，也适合于那些希望了解C++语言并运用C++语言进行高质量程序设计的学习者。课程使用的语言是C++，在通过一定篇幅介绍C++的主要语法知识后，将重点围绕什么是接口、怎么设计、实现和使用接口、如何在程序设计中体现“开闭”原则，以及如何实现数据表示与操作的分离等内容展开介绍和讨论。课程除了介绍传统的面向对象程序设计的基础知识，还会讨论如何进行基于接口编程，如何进行泛型程序设计，还会讨论到C++语言的标准模板库的核心内容。",
    "C_course-v1:YSU+20180301002+2019_T1": "线性代数是高等院校理工科和经管类各专业必修的一门重要基础数学理论课程。线性代数理论始于17世纪，19世纪后期已经发展成为数学的一个重要分支，它是研究有限维线性空间的线性理论与方法的一门学科，其理论和方法已经渗透到数学的很多分支，在数学、自然科学和工程科学中起着至关重要的作用。随着科学技术的发展，在实际问题中我们不仅要研究单个变量之间的关系，还要进一步研究多个变量之间的关系，各种实际问题在很多数情况下可以线性化处理或用线性模型近似处理，线性化了的问题都可以计算出来，线性代数正是解决这些问题的有力工具。如今，线性代数已被广泛地应用于计算机科学、物理学、经济学、工程学、生物学、统计学、系统控制、通信及航空等学科和领域。线性代数课程主要包含行列式、矩阵、向量与向量空间、线性方程组、相似矩阵、二次型、线性空间和线性变换。通过本课程的学习，使学习者掌握线性代数的基本理论和基本方法，培养学习者严谨的逻辑推理能力、运算能力及综合运用所学的知识分析和解决实际问题的能力，从而为其进一步学习后续相关课程和提高数学素养奠定必要的基础。",
    "C_course-v1:MUC+24040004+2019_T1": "“唐史四讲”是为高校学生（以专业为基础者兼及其他爱好者）旨在提升人文素养而开设的课程。本课程由《唐朝的疆域与疆域观念》、《唐朝的南北兼跨及其限域》、《粟特及后裔墓志铭文书写的程式意涵》和《墓志铭映印下的唐朝河北粟特人地著化问题》等构成。为保证学术质量，本课在增进人文情怀的基础上选择讲者从事的专题性研究作为重点内容予以讲授，涉及到唐朝疆域构成的特点、唐朝南北的统合、粟特人从外来者衍化成本土在地人的过程及其墓志铭书写的范式意涵等，试图以点带面地阐释唐朝社会的若干面相和特点。通过讲授、与听者互动等方式为阐扬人文主义精神做出自己的奉献。 第一讲《唐朝的疆域与疆域观念》，系从王朝国家的视角理解唐朝的疆域、人群、统治权等概念及其特点，具体阐释其构成、演变和规律。重点突出时代性与古今之差异，认为历史问题只有置放在与其相随的时空架构下解释才能恰切，倘若缺乏明确的辨别，就会导致古今混淆，影响判断的精准性。 第二讲《唐朝的南北兼跨及其限域》，旨在揭示建基于中原农耕地区的唐朝如何步入草原建构南北跨越性王朝的动机、军事政治能力和经济支撑等要素，尤注重解释其统辖维系50年而解体的限制及其内存的脆弱性，以此因应北方势力（元、清）旋后建构一统化王朝的成功要旨所在。  第三讲《粟特及后裔墓志铭文书写的程式意涵——以三方墓志为样例》，以粟特族系康婆、康庭兰和曹闰国三方墓志为例，通过对墓志内容的具体分析，解释其记载的倾向与所处社会之间的关联，认为墓志的书写受到朝廷为代表的主流社会意识形态的支配和影响，官员墓志的书写更直接由官方机构的规范所主导，士人阶层的墓志间接受其制约，墓志的“真实”反映的乃是官方意识形态风向的真实。 第四讲《墓志铭映印下的唐朝河北粟特人“地著化”问题——以米文辩墓志为核心》，通过粟特族裔米文辩家族自西向东迁转的路径，指明该家族以京西北三水为族系彰显之地，河东是其家族仕职的“荣显”之始，进入河北藩镇之后转入了“土著”之列，透过这一个案分析了外来粟特人羼入本土变迁的具体过程，进而揭示那了一特定时代特定地区的整体风貌及其变迁的动向。 考核方式：在视频学习的基础上，视频下的配套练习题和期末考试各占总成绩的60%、40%，满分100，60分合格，85分优秀。",
    "C_course-v1:TsinghuaX+20150001+2019_T1": "你在为发表论文发愁吗？你知道写作一篇科研论文应从何开始吗？从文章题目，关键词，一直到结论，文献，该如何正确的组织文章结构？期刊主编都看重什么？文章发表后如何获得关注以及如何推广你的文章？学术出版道德相关的基本原则是什么？学术出版中都有哪些“雷区”?本课程邀请到清华名师以及Elsevier出版人，为你讲述论文写作的原理，内容架构，技巧及学术伦理道德，并邀请优秀学生分享他们发表论文的宝贵经验，帮助你更有效地写作和发表学术论文。",
    "C_course-v1:TsinghuaX+00612642X+2019_T1": "《资治通鉴》是北宋司马光主持编纂的著名编年体史书、传统史籍“通鉴体”门类的开山之作。该书以政治、军事为记述主线，上起公元前403年，下迄公元959年，以294卷、300多万字的篇幅，系统展现一千三百多年间华夏大地波澜壮阔的历史画卷。该书问世以来，不但以其不可替代的史料价值为历代学者所重视，更以其资政育人、总结历代治乱兴衰之道的根本动机与高卓史识为后世所称道，呈现出超越时空的巨大生命力。然而《资治通鉴》篇幅浩瀚、内容复杂，加以历史文献自身的时代特点，非文史专业出身的广大青年学生难以通读并领会其要旨。“《资治通鉴》导读”课程作为一门人文通识课程，目的即在于消除专业壁垒，引导同学直接感受这部中国伟大史学著作的魅力。课程主讲张国刚教授潜心研读《资治通鉴》数十年，通过精心选取其中的经典人物言行与历史场景，钩沉发覆、条分缕析，以现代思维总结文化精髓，以生动语言阐发历史智慧，尤其侧重其中修身、齐家、治国的现实意义。通过“《资治通鉴》导读”课程的学习，同学们不但可对战国至五代之间中国历史发展演化的基本脉络产生较为全面的把握，还可领悟到如何从传统文化汲取现实营养的基本方法，为终身学习国学经典开辟道路。",
    "C_course-v1:MUC+2018031801X+2019_T1": "本课程主要讲授影视人类学的学科发展历程、代表性人物与影像民族志作品，基本理论与方法以及影视人类学在当代社会的重要价值等，对学习人类学、民族学、影视学和传媒学等有较高的价值。 考核机制：在课程视频学习后，完成六个章节测试和期末考试，分别占比60%、40%，满分100，60分合格，85分优秀。 ",
    "C_course-v1:TsinghuaX+70612463X+2019_T1": "统计学是现代科学的通用语，是现代研究一项不可缺少的工具。社会科学与经典统计学原理结合，形成了一套使用统计测量体系研究社会环境中人类行为的方法论体系。这套体系不仅局限于深奥的数字、表格和公式，更是一种逻辑思维方式；它提供给研究者的不仅是收集、分析、理解数据的基本技能，更是一种从证据到结论的科学推论过程。统计分析可分为探索性数据分析和推断性统计方法两部分，概率论则是连接两者的桥梁。本课程将借助开放源统计软件R语言所带来的强大功能，介绍探索数据的必备技能。接着，我们将对抽样分布、估计以及假设检验等统计学核心理论进行讲解。最后，我们将结合来自社会学、心理学、教育学等学科的研究实例，对多元回归、逻辑斯蒂回归、多水平模型等高级统计方法在社会科学中的应用进行探讨。即使你以往的数学学习困难重重，也并不意味着你在这门课的学习中将处于劣势。我们相信，逻辑思维的训练比计算能力更重要。课程结束，你将对如何提炼纷繁数据中的有效信息有更好的感觉；别人研究中的统计分析将不再是你的阅读禁区；你将学会如何作为统计学原理的消费者，将统计思维应用到自己的研究中去。",
    "C_course-v1:TsinghuaX+00690863X+2019_T1": "本课程系王步高教授主持的“唐宋诗词鉴赏”国家精品课程、国家资源共享课系列课程之一。课程从词的定义、词的起源开始，较系统地讲授唐宋词的代表作家、代表作品，重要流派；以讲作品为主，兼及作家、唐宋词史以及宋代的历史、民俗及人文精神；通过本课程的学习，使学生对唐宋词有较为全面系统的了解，同时能提高其诗词阅读鉴赏及批评能力。主讲人王步高教授为词学大师唐圭璋入室弟子，协助唐主编过《唐宋词鉴赏辞典》，长于诗词写作，词学领域著作颇丰，该课程是清华大学、东南大学最受学生欢迎的课程之一。",
    "C_course-v1:TsinghuaX+00612643X+2019_T1": "《资治通鉴》是北宋司马光主持编纂的著名编年体史书，其自问世以来，不但以不可替代的史料价值为历代学者所重视，更以资政育人的根本动机与高卓史识为后世所称道。在该书294卷、300多万字篇幅中，隋唐五代史部分跨越近四百年沧桑，独占118卷，以无可替代的史料价值，成为整部《通鉴》最重要的内容。“《资治通鉴》导读之《大唐盛衰》”，接续自2014年开设以来广受好评的《&lt;资治通鉴&gt;导读》课程，主讲张国刚教授潜心研读《资治通鉴》数十年，通过精心选取其中的经典人物言行与历史场景，钩沉发覆、条分缕析，以现代思维总结文化精髓，以生动语言阐发历史智慧，尤其侧重其中修身、齐家、治国的现实意义。通过课程学习，同学们不仅可以掌握隋唐五代历史发展基本脉络，在小说影视演绎之外，领略更生动真切的隋唐风情；更可以走进原始记载，感受中国伟大史学著作的独特魅力，领悟从传统文化汲取现实营养的基本方法，为终身学习国学经典开辟道路。",
    "C_course-v1:MUC+050104+2019_T1": "该课程在国家级精品课《神话与人类》基础上进行精编与重建，重点讲解我国55个少数民族神话蕴含的思想内涵、艺术风格以及中华民族多元一体、美美与共的民族精神。本课程自2014年至今在本校讲授4年，学生主要为全校各个专业的本科生 ，学生对该课程评价为优秀。该课程的优势是以中国55个少数民族神话为中心，同时还融入汉族神话与外国神话案例，通过跨民族、跨文化的视角，解析中国少数民族神话的思想内涵与艺术风格，让同学们在富有启迪又饶有趣味的少数民族神话语境中，领略55个少数民族神话之博大精深，体悟中华民族神话多元一体、美美与共的民族精神。 考核机制：在完整学习课程视频的前提下，视频匹配测试题和期末考试各占总成绩60%和40%，总分100分，60分合格，85分优秀。 ",
    "C_course-v1:UQx+Think101x+2019_T1": "我们将对日常思考进行研究：为何人们会相信奇怪的事物，我们如何形成并改变我们的观点，为何我们的期望会偏离我们的判断，以及我们如何做出更好的决策。我们将对医疗诊断、超常现象、安慰剂、奇迹等话题进行研究和讨论。你将学习如何评价要求、理解证据，并了解我们为何常会做出非理性抉择。你将开始依赖费时费力、慎重逻辑分析的思考方式，而不是草率、自动、本能情绪化和程式化的思考模式。本课程会提供若干工具帮你如何独立思考，如何有所怀疑，如果根据个人经验衡量数据的价值。我们将研究人们使用和误用的心理捷径、经验法则，并将这些知识 运用于日常情景中，帮助我们做出更好的决策。   Think101小组不远万里，拍摄到与部分非常天姿颇高的人们的谈话，其中包括：曾获诺贝尔经济学奖的 Daniel Kahneman，对虚假记忆进行前沿研究的 Elizabeth Loftus，甚至还有《流言终结者》节目中对说法的测试和对事实与虚构的区分。我们会见了世界各地21位著名思想者，整理了数百小时的谈话内容、示范说明、评价评估，做成短片，帮助了解如何评价要求，学习更好地记忆信息，并改善日常思维。",
    "C_course-v1:KMUSTX+1193004+2019_T1": "3ds Max是三维建模、渲染和动画制作软件。凭借理性化的系统设计、强大的多边形建模功能，以及众多插件的支持，被国内外学者公认为，易学、易用且性能强大的三维软件，有着广泛的使用人群。在游戏制作、虚拟现实、室内设计和影视动画等领域，掌握3ds Max还是公司入职的必备条件。   这套教程中，我们总结了一些3ds Max中最实用的方法和一些小技巧，希望通过本套教程的学习，帮助同学们快速、高效的掌握3dsMax的基础知识，学会解决问题的思路和方法，为后续的课程奠定基础。   ∷第一章会告诉你在3dsMax中必备的操作方法，让你能够灵活的控制对象。   ∷ 第二章会介绍三种超实用的建模方法，帮你轻松驾驭简单的模型。   ∷第三章带你了解光的特性，学会选择与设定灯光参数，渲染输出自己的作品。   ∷第四章帮助你了解材质，轻松实现想表现的物体质感。   ∷第五章我们学习控制关键帧，实现一些简单的动画效果。   ∷第六章我们聊聊其他软件，让你轻松制作虚拟现实（VR）和增强现实（AR）作品。   ∷第七章 让大神告诉你什么是BPR。   后续我们为你准备了：极速悟透三维建模，让你深入了解三维角色建模的核心技法；极速悟透Unity3D游戏开发体验，让艺术类学生也能轻松做游戏。如果你想更深入的学习这些课程，本套3dsMax基础课程将会是你开启它们的钥匙。还等什么呢，赶快开启我们的虚拟之旅吧。  ",
    "C_course-v1:KMUSTX+1153036+2019_T1": "中华民族素有“礼仪之邦”的美誉，礼仪文化源远流长。礼仪能有效地展现施礼者和还礼者的教养、风度与魅力，体现着个人对他人和社会的认知水平、尊敬程度。礼仪不是财富和知识积累后的必然，而是发自内心对所有生命的尊重，是正确的人生观和世界观的自然表现。礼仪是人际交往活动中不可缺少的润滑剂，是学生通往职场必备的一项职业技能。《职场菜鸟礼仪指南》课程结合学生今后在现代社会活动的实际需要，从基础知识到综合技能，挑选出职场中最常见的商务场景，将课程分为十大模块——绪论、职业形象礼仪、仪态举止礼仪、位次排列礼仪、会面交往礼仪、沟通联络礼仪、商务宴会礼仪、接待拜访礼仪、求职面试礼仪和商业演讲礼仪。每个模块包含多个任务，以任务为目标，以知识点为导向。课程遵循“实用为主，适用为变”的原则，采用“双题目”的方式，以礼仪谚语为引论，小贴士为结尾，并采用了理论概述、实操演示、行为纠错、动作示范、启发引导、案例分析、情景模拟、角色扮演、嘉宾座谈等丰富多彩的课程展示形式。通过课程的学习，使学生掌握并得体的运用礼仪，助力未来职业发展。本课程适合： 1. 所有专业的大学生； 2. 将要进入职场的职场新人； 3. 对礼仪和职场礼仪知识感兴趣的人。",
    "C_course-v1:KMUSTX+2018091101X+2019_T1": "儿女永远是父母的宠儿，独生子女时代，许多家庭的悲剧就是由于不懂感恩所导致；随着社会的进步，“望子成龙，望女成凤”，来自学校或社会的压力，使得许多年轻的生命早早凋零；国家二孩政策的实施，许多家庭将迎来新的成员，从而也面临着许多高龄产妇和中年父亲成为普遍现象；我国地区经济发展不平衡，不发达地区的早婚现象，由于对孕育宝贝知识的缺乏，使得年青的父母“一失足成千古恨”。本课程从生命的意义，恋爱时的择偶到健康的两性知识入手；从孕前准备，孕期的各种状况应对到激动人心的分娩；从孕期孕妈的生理变化深入到心理转变；从孕期的营养到科学的胎教；从常规的产检到现代的无创DNA和羊水穿刺；以全新的视角和社会的需求为出发点。由昆明理工大学医学院联合其附属云南省第一人民医院的最具实力的专业老师主讲，以爱为主线，运用动画、病例和生活实例展现专业知识，力求做到使呈现的内容比科普更专业，比专业更科普……让学生们学会珍惜生命，让儿女们学会感恩，让高龄的孕妈们不在害怕，让年青的父母们胸有成竹，让所有的家人为孕育健康宝贝共同努力；让每个家庭拥有健康宝贝不是梦，为孕育和培养祖国中国梦的接班人贡献一份力量。 ",
    "C_course-v1:LZU+2018122505X+2018_T2": "马克思主义是培养自由全面发展的人的科学。 提起马克思，你会想到什么？一个大胡子，一种主义，或者一位千年伟人……2018，马克思已经200岁了。今天，带你走进马克思，让你认识一个不一样的马克思，说说那些年他和恩格斯的故事以及他们的“主义”——马克思主义。",
    "C_course-v1:XJTU+2018122507X+2018_T2": "肺为娇脏，清虚而娇嫩，吸之则满，呼之则虚，为脏腑之华盖，百脉之所会。呼吸系统疾病的历史和人类的历史一样久远。无论在医学尚不发达、传染病肆虐的过去，还是在大气污染、吸烟、人口老龄化的今天，呼吸系统疾病始终都是多发病、常见病，严重危害人们的身体健康。《呼吸系统疾病》是内科学中重要组成部分。现在呼吸病学的范畴不仅包括呼吸系统各种疾病的诊断、治疗和预防，更包括了流行病学、病因学、发病学、康复学、社会心理学等；所承担的任务不仅是直接救治呼吸系统疾病患者，更承担着呼吸道传染性疾病防控与治疗、公众戒烟控烟的宣传教育、慢性呼吸道疾病的健康管理等社会责任。   本课程不仅知识内容丰富，还借助于大量的图片、真实的病例、直观的视频、动画，真实的音频，讲者深入浅出，多样有趣。从流行病学特点、病因、发病机制、临床表现、辅助检查、诊断、鉴别诊断及治疗等方面，全面系统地讲解了呼吸系统常见疾病。课程不仅重视知识点的讲解分析，在诊断、鉴别诊断的过程中注重医学逻辑思维的建立，特别注重医学人文的培养，普及预防及保健康复知识。   如果你想要知道呼吸系统常见疾病的特点和诊治规范是什么？   如果你想要知道吸烟会有哪些危害，如何才能成功戒烟？   如果你想要成为一名优秀的呼吸科医生？   请和我一起走进呼吸系统疾病的课堂吧。",
    "C_course-v1:YIT+2018122509X+2018_T2": "“大学计算机基础与应用”课程是非计算机专业学生的第一门计算机基础课程，是一门必修的公共课程，也是一门伴随您一生的实用性课程。主要讲述计算机基础知识和基本理论，系统地介绍计算机的基本概念，强调文化与信息的意识，突出体现计算机的基础性。主要内容包括计算机基础知识、操作系统技术基础知识、计算机网络基础与网络信息应用、Office办公软件的使用方法、多媒体技术应用基础等。",
    "C_course-v1:TsinghuaX+400182X+2019_T1": "作为最优秀的综合性大学之一，清华大学有责任有义务培养深谙现代生命科学研究的医师科学家。他们不仅具备扎实的临床技能，在病床旁表现优秀，而且能够自如地运用现代生命科学的新知识和新工具创造性地解决临床问题，在转化医学研究的实验室中一样表现优秀。清华大学医学院培养的医师科学家与其他院校相比有哪些不同之处?清华大学如何发挥综合大学的优势来实现这一目标？我们的课程对医学实验班独特的3+2+3的八年制特色培养计划进行了详细的解读，通过本课程的学习，可以对清华大学医师科学家的培养体系有大致的了解，并对医学院的各个科研方向有更深刻的认识。学生不仅可以了解到医学学科的特点，而且会对医学院各基础学科，例如免疫、传染性疾病、神经科学、干细胞、结构生物学等形成初步的认识，此外课程也会对临床医学进行概要性的介绍。完成本课程后，学生对清华大学医学院培养的医师科学家会有更深入的了解和认识，他们首先是医生，但不是仅仅具有高尚的医德、精湛的医术，还具备强大的科学研究能力，能为现代医学指明方向、开拓创新，是国际医学界的领军人才。",
    "C_course-v1:YLVTC+2018122511X+2018_T2": "本在线课程有40段视频，主要有四大模块，包括植物组织培养的基本原理，基本操作技术，组织培养快繁技术和脱毒技术，并对重点地实践操作作了演示，为高职学生和植物组培种苗生产者提供学习指导。",
    "C_course-v1:CWU+2018122606X+2018_T2": "《家庭理财》在线课程，做为中华女子学院全校自由选修课程，可以不限制选课专业和年级，课程采用项目管理式教学模式，将同学自由分组，以案例讨论、理财情景模式、理财方案解析、理财技能比赛等多种教学模式，让同学线上学习理财知识，课堂扮演理财师角色，增强互动交流和理财技能提升。",
    "C_course-v1:BUCM+2018122604X+2018_T2": "北京中医药大学护理学院循证护理教学团队集全院力量经多年培育，由院长带队，两名循证医学博士作为主讲，已完成三轮循证护理学课程的教学，得到学生的一致好评。同时，作为主编单位，编写人民卫生出版社十三五规划研究生教材《循证护理学》，参编国际护士会Sigma Ta To出版的《TransformingNursing Through Knowledge》。同时将循证护理作为北京中医药大学护理学院学科建设的重点工作。2013年11月护理学院成立了循证护理研究中心，致力于从事循证护理教学、研究和实践。目前循证护理研究中心下设两个循证护理合作中心：澳大利亚JBI（Joanna BriggsInstitute）循证护理合作中心和加拿大安大略省注册护士BPSO（Best Practicespotlight organization）循证护理合作中心。",
    "C_course-v1:HBPU+20181226006X+2018_T2": "本课程在关注重心上做了大胆改革，本课程的重心是现实环境中的各类数据对象，并通过恰当的方法来存储数据、处理数据。本课程在后几章中强化了对C语言的函数、指针、字符串、结构体、动态内存分配这些知识点的训练，引导学生由浅入深掌握对各种类型数据的操作，掌握结构化程序设计的思想，为后续数据结构、操作系统、数据库、组成原理等课程的学习打下了良好的基础。",
    "C_course-v1:TsinghuaX+00310222X+2019_T1": "课程包括三部分内容：（1）主讲者参与拍摄的《走进科学》《原来如此》等栏目，介绍其中的道具设计和实验过程；（2）展示趣味科学游戏的设计及现象；（3）教授AutoCAD基础设计，利用激光切割机设计制作有趣的小装置（10个原创的装置，从简单到复杂）。",
    "C_course-v1:qdu+2018122608X+2018_T2": " 《电工电子技术》是高等院校理工科非电专类业的一门专业基础课程。本课程是电工电子国家级实验教学示范中心(青岛大学)承担的主干课程，于2007年被评为国家级精品课、2016年被评为国家级优质资源共享课。希望我们为您提供的学习资源与学习环境，能够帮助您掌握电工电子技术必要的基本理论、基本知识和基本技能，了解电工电子技术的应用，增强自身使用现代工具和自主研学的能力。",
    "C_course-v1:BNU+2018122603X+2018_T2": "《篮球——基本技术》分为准备姿势与移动技术、接传球技术、运球技术、投篮技术、持球突破技术、篮板球技术和身体素质练习七章教学内容。课程内容分为基本技术动作的概念与作用、技术动作讲解与示范、练习内容与方式三部分，以此来帮助学生了解篮球技术相关理论知识，明确篮球技术动作的结构及特点、运用时机、关键环节，并能运用所教授的内容进行科学、有效的学练，促进自我篮球运动技能水平与身心健康的全面提升。学生在进行学习时，请遵循以下学习的步骤：1.认真观看每节教学视频，了解该技术动作的价值，明确各技术动作的要点，建立正确的技术动作表象；2.根据每节教学视频中提供的练习方式，进行技术的练习、并与同学相互交流练习过程中遇到的问题及练习经验、。在练习过程中，应注意实时纠正错误动作，随着动作的不断重复和技术细节的不断改进，达到动作定型；3.在完成学习并自我感觉已正确掌握某一技术动作时，找一个合适的观察评价者，如老师或技术正确娴熟的同学，对自己的技术进行评价，以找出技术动作存在的问题，巩固完善所学知识，为更好的开始下一阶段的学习奠定基础。",
    "C_course-v1:TsinghuaX+60250131X+2019_T1": "本课程以一系列大数据讲座为主线，突出实战性，激发学生学习兴趣和动力，促进学生理论与实践相结合，启发学生技术创新。注重结合应用实例融会贯通大数据中的理论方法和系统知识（平台、模块、工具），体会运用大数据技术解决实际问题的思路和效果。本课程兼顾信息类和非信息类学生。",
    "C_course-v1:TsinghuaX+80590892+2019_T1": "在课程设计上，本课程讨论公共事务的制度伦理及公共管理者的道德选择困境两个方面。以案例结合情境实验为依托，以经典文献为引导，以对话为学习方式，剖析特定制度安排及道德选择背后的伦理观念，以及观念内在的逻辑，进而围绕公共性目标，帮助课程参与者梳理、反思自己的价值体系，学习与不同的观念进行理解、分析、对话，从而培养公共管理者对公共价值的意识自觉、观念认知、逻辑理性和实践能力。整个课程的特点结合伦理学的学科特色，以对话和讨论的形式进行，主要的目的是通过质辩推演，帮助每个学员梳理和丰富自己的伦理观念及逻辑。伦理学有关对错的判断，它没有标准答案，但是有对自身观念的目的认知、逻辑认识，以及思想丰富和包容度的不同，这便是伦理课程学习所要提供的。本课程在清华大学公共管理学院自2013年开始开设，每年春季学期，面向MPA学员开设，亦为学术研究生的方向性选修课、本科二学位的限选课，每年三个班总选课人数在150-200名，教学评估在全校前5%。英文课程Public and Corporate Ethics在苏世民书院开设，自书院建成目前已开设两届。",
    "C_course-v1:TsinghuaX+34000888X+2019_T1": "医学，从诞生之日起，就因为浓郁的宗教背景而被蒙上了一层神秘的色彩。但是，人们对医学的探究却从未因此而停止。怀着对健康的渴望以及对永生的向往，人类把一切的聪明才智和科技成果都运用到了医学领域。当你用鼠标点开《走进医学》这门课程，我们将带你进入一个全新的世界，他是那样的广袤无垠，却又妙到豪巅。我们的课程将带你探寻从宏观的环境与健康的关系，到微观的疾病发生的分子学原理。如果你是一名有一定医学教育背景的医学生，或者是一名对医学感兴趣的大学生，那么欢迎你进入到我们的课堂。我们的老师既有从事医学基础研究的教授，也有战斗在临床一线的专家，我们将以独特的视角向您展示疾病的发生、发展以及人类与疾病斗智斗勇的抗争过程。开设这门课程，主旨是希望学习者通过这扇门，来了解什么是健康、如何做到健康、疾病是怎样发生的以及如何战胜疾病，使大家在学习之后能够对医学产生一定的兴趣，并掌握一定的医学知识，树立健康的生活方式，在周围人群需要健康指导的时候能够施以援手，贡献自己的一份力量。",
    "C_course-v1:HUBU+HU08002X+2019_T1": "《运动与健康》课程以人文社会科学的视野，将体育人文社会科学、运动人体科学和医学等相关学科有机地结合起来，系统、全面地阐述体育运动与健康的关系、如何向体育运动要健康、不同运动项目的健康机制、运动损伤的预防与处理等基本内容。《运动与健康》祝愿每一位同学掌握科学锻炼的方法，每天锻炼一小时，健康生活一辈子！健康是人类发展永恒的主题，追求健康是人们共同的愿望，拥有健康是人人享有的权利，维护健康必须走科学的道路，增进健康应遵循自身的规律。《运动与健康》这门课程将带领大家为健康而运动。在这门课程里，你可以领悟到运动对机体的神奇影响；你可以寻找到科学健身的方法；你可以欣赏到精彩的运动视频；你还可以学会运动损伤的初步处理；你会在运动误区的解释中豁然开朗！ ",
    "C_course-v1:HNU+AR03015+2019_T1": "“建筑是石头的史书”，也是古人留下的艺术作品。建筑中还包含着哲学、政治、宗教、文学艺术、生活方式等等各种精神的、物质的文化内容。遍布全国各地的古建筑不仅是弥足珍贵的中华民族的优秀文化遗产，也是我们今天旅游观光，丰富的文化生活中不可或缺的一部分。在旅游观光的时候我们怎样看懂古建筑，欣赏古建筑，这就要求我们具有一定的相关知识。此课程主要以图片的形式介绍了中国古建筑的一般特点，分门别类解说了宫殿、园林、寺庙、书院、祠堂、会馆、民居等等各类古建筑。总之，学完此课程让我们能够看懂古建筑，欣赏古建筑。这是一门面向全社会的普及性课程，不论文、理、工、农、医哪个学科的人都可以学。虽然古建筑属于建筑学的学科门类，但是本课程重在通俗性、知识性和趣味性，基本不涉及建筑学专业技术问题。",
    "C_course-v1:TsinghuaX+00740043_1x+2019_T1": "C++是从C语言发展演变而来的一种面向对象的程序设计语言。面向对象的程序设计方法将数据及对数据的操作方法封装在一起，作为一个相互依存、不可分离的整体——对象。对同类型对象抽象出其共性，形成类。类通过外部接口，与外界发生关系，对象与对象之间通过消息进行通讯。这样，程序模块间的关系简单，程序模块的独立性、数据的安全性具有良好的保障，通过继承与多态性，使程序具有很高的可重用性，使得软件的开发和维护都更为方便。由于面向对象方法的突出优点，目前它已经成为开发大型软件时所采用的主要方法。而C++语言是应用最广泛的面向对象的程序设计语言之一。本课程是一门面向广大初学者的入门课程，自1999年开始在清华大学开设，本课程的教材已经在清华大学等一百多所学校的不同专业中使用，取得了良好的教学效果。本课程将C++语言作为大学生的计算机编程入门语言，不仅详细介绍语言本身，而且介绍常用的数据结构和算法、面向对象的设计思想和编程方法。课程以面向对象的程序设计方法贯穿始终，每一章都是首先阐述面向对象的程序设计思想和方法，由实际问题入手，然后引出必要的语法知识，在讲解语法时着重从程序设计方法学的角度讲述其意义和用途。",
    "C_course-v1:CQU+2018122703+2018_T2": "《基础会计》是会计专业的专业基础课，也是经管类其他专业的基础课。课程具有理论性、实践性和技术性的特点，是学习其他会计相关专业课程的基础。对其他经济管理类专业来讲，本课程是了解会计基本理论、基本方法的途径，有助于完善学生的专业知识结构，增强学生了解企业财务状况和经营成果的能力，扩大学生的知识面。《基础会计》主要阐述会计的基本理论、基本核算方法和基本操作技能。通过本课程的教学，使学生理解会计的定义、职能、任务、对象、要素等会计基础理论，掌握设置会计科目和账户、复式记账、填制和审核会计凭证、登记账薄、成本计算、财产清查和编制会计报表的操作技能。",
    "C_course-v1:BFU+2018122709+2018_T2": "《风景园林艺术原理》主要内容包括：风景园林的概念，传统园林艺术概况，现代风景园林艺术概述，风景园林规划设计程序，风景园林空间构成，风景园林与自然系统，风景园林与人类社会。通过本课程中的学习，可以为后继的风景园林规划设计系列课程奠定必要的专业理论基础。",
    "C_course-v1:nxu+2018122711+2018_T2": "西夏是由党项族建立的多民族政权，虽偏处西北，但却创造了我国历史上一系列辉煌，如世界上最早的活字印本，我国最早的图像版《西游记》，我国历史上第一次尊孔子为文宣帝，都是出自西夏。教育部“长江学者”特聘教授杜建录带领宁夏大学西夏学研究院的学术团队，为同学们解读诗一样的西夏。",
    "C_course-v1:TsinghuaX+00740043_2x+2019_T1": "C++是从C语言发展演变而来的一种面向对象的程序设计语言。面向对象的程序设计方法将数据及对数据的操作方法封装在一起，作为一个相互依存、不可分离的整体——对象。对同类型对象抽象出其共性，形成类。类通过外部接口，与外界发生关系，对象与对象之间通过消息进行通讯。这样，程序模块间的关系简单，程序模块的独立性、数据的安全性具有良好的保障，通过继承与多态性，使程序具有很高的可重用性，使得软件的开发和维护都更为方便。由于面向对象方法的突出优点，目前它已经成为开发大型软件时所采用的主要方法。而C++语言是应用最广泛的面向对象的程序设计语言之一。本课程是一门面向广大初学者的入门课程，自1999年开始在清华大学开设，本课程的教材已经在清华大学等一百多所学校的不同专业中使用，取得了良好的教学效果。本课程将C++语言作为大学生的计算机编程入门语言，不仅详细介绍语言本身，而且介绍常用的数据结构和算法、面向对象的设计思想和编程方法。课程以面向对象的程序设计方法贯穿始终，每一章都是首先阐述面向对象的程序设计思想和方法，由实际问题入手，然后引出必要的语法知识，在讲解语法时着重从程序设计方法学的角度讲述其意义和用途。",
    "C_course-v1:BSU+BSU001+2019_T1": "本课程将全面系统地展示冬季奥林匹克运动从历史渊源直至现代发展的优美画卷，从中感受到冬奥会的丰富内涵和独特魅力。",
    "C_course-v1:TsinghuaX+40809644X+2019_T1": "本课程是界面设计的入门课，面向初学者，通过全面介绍界面设计领域的发展现状、应用领域和趋势，帮助学生建立一个较完整的知识框架，丰富视野，并从GUI和H5网页设计与制作方法这两个知识点入手，循序渐进地教学生学做简单的网页GUI设计，体验一个完整的设计过程，学生通过这种带有实践性的学习体验，可以对界面设计有一个初步的认识和了解，为将来的深入学习和自我提高做好铺垫。",
    "C_course-v1:SCUT+2018122802X+2018_T2": "中国也在实施新一代人工智能技术的发展，并推动人工智能应用到各行各业中。本课中完成课程后，学生将具备以下能力：1） 能够了解人工智能行业的最新应用和发展趋势；2） 能够从数据，算法和计算力三个方面来理解人工智能的发展；3） 能够体验和理解深度学习的原理，例如 CNN（卷积神经网络），图像风格迁移技术，RNN（循环神经网路） 等神经网络架构；4） 能够用行业或生活例子来理解/比喻深度学习的特点：输入层/隐藏层/输出层/学习速率/过拟合/欠拟合/反向传播/梯度下降等；5） 能够用行业/生活术语来比喻人工智能的概念和原理；6） 能够用人工智能思维的本质：F(X)=Y 来描述人工智能的各种算法设计原理、各种应用；7） 能够领会抽象思维（计算思维的核心本质）在人工智能领域的作用；8） 能够区别人工智能之机器学习的三个方向：监督学习、无监督学习、强化学习；",
    "C_course-v1:TsinghuaX+20220332X+2019_T1": "在中国近代史发展的进程中，日本超过世界上任何一个国家，成为了对中国影响最大的国家。日本文化对中国青少年的性格形成乃至文化认同感、价值观塑造方面所起到的影响不容小觑。从日本社会生活现象中学习并反观中国社会。重新认识日本国和日本人，从中日两国现代交往的种种矛盾现象中看清楚“岛国根性”与“大陆农耕民族”最根本的差异所在。对于一个国家的了解、与其交流或者认知，掌握这个国家、民族的文化甚至比单纯掌握这个国家的语言更为重要。在日语基础的学习过程中，比以往课堂教学更多地揉入对日本社会生活中的文化现象予以介绍和分析。语言部分预计学习指定教材的1-9课，学习日语的语音；基本句式；用言的词尾变化；助词、助动词的使用等。完成本课程后可以达到掌握日语自学基础。课程共计12个单元。本门课程线上与线下学生所用时间预计分别占20%和80%。日本文化和日语基础将由不同教师担任。",
    "C_course-v1:TsinghuaX+40140632X+2019_T1": "本课程讲解水轮机、水泵、风机、阀门等典型流体机械的基础理论知识及其工程应用方法。内容含流体机械的定义、应用、分类和最新发展概况；典型流体机械结构和工作原理；转轮能量转换原理及其他流道部件对能量转换的影响；相似理论和无量纲参数工程应用；空蚀、磨蚀与腐蚀；性能曲线和运行特性；多相流动多场耦合特性综合分析；标准化、质监与工业流程分析等。本课程紧密结合工程应用，理解分析最新的多相流动多场耦合特性研究进展，通过大量图片、影像资料和工程问题实例介绍，形象生动地阐述流体机械的基础理论知识。",
    "C_course-v1:TsinghuaX+30240233X+2019_T1": "本课程是一门计算机专业的基础课。课程以C/C++语言为工具，通过编写程序解决问题，培养学生的计算思维，掌握程序设计的基本概念、基本算法思路与基本设计方法，为学习后续课程打下扎实的基础。课程主要内容包括：(1) 程序设计语言和程序设计的基本概念，C/C++程序的基本结构；(2) 基本的问题求解思路，包括变量与数据类型，循环与分支，枚举法的算法思路，逻辑思维与问题求解；(3) C/C++语言的基本数据结构及操作方法，包括数组、结构、链表等；(4) 基本的算法思想，如排序、查找、筛法、递推、递归、动态规划等；(5) 文件创建与读写操作，以及各种应用。本课程在教学过程中，将采用任务驱动方式，培养学生用程序设计语言解决实际问题的能力；强调在解题实践中掌握程序设计的基本概念、基本思想和基本方法；突出对编程思想的阐述和计算思维的训练；平时作业与测验考试均使用上机解题，以程序运行结果是否正确为评判标准；要求学生养成良好规范的编程习惯。",
    "C_course-v1:TsinghuaX+20220214X+2019_T1": "电路原理课程是电类各专业最重要的一门学科基础课，后续各专业基础课和专业课都建立在这门课程的知识体系之上，因此是电类专业本科生的“看家 课”之一。电路原理课程的主要内容包括：线性电阻电路分析、非线性电阻电路分析、动态电路的时域分析和正弦激励下动态电路的稳态分析4大部分。清华大学电 路原理课程的教学包括电路分析基本方法、当代电路元器件、电路原理的实际工程应用等，为学生提供了扎实的基础和丰富的应用。为方便至只有中学知识的学生学习，电路原理MOOC专门利用第0周准备必要的微积分、线性代数和大学物理电学的基础。我们有信心：你能领悟电世界的奇妙。",
    "C_course-v1:HUBU+20170914001+2019_T1": "《房地产开发与经营》是工程管理、房地产管理专业学生必修的专业课程，也是进入房地产市场从事房地产策划、房地产销售、房地产评估等从业人员的基础培训课程。是一门理论系统性与实践可操作性相结合的课程，是《房地产法律法规》、《房地产营销》、《房地产策划》、《房地产会计》、《房地产金融》等专业课程的前期引导课程。课程培养学生从专业的角度了解我国房地产发展的背景，掌握房地产开发的程序，熟悉房地产经营的环节；训练学生进行房地产市场调查、可行性研究、风险分析、营销策划的能力；指导学生根据我国房地产业发展现状，运用房地产开发与经营的专业知识，思考、研究和了解房地产市场。",
    "C_course-v1:TsinghuaX+40050444X+2019_T1": "《大气污染控制工程》是环境工程、环境科学等相关专业的主干专业课。本课程旨在向学生全面讲授大气污染的来源影响、传输扩散和控制技术，重点介绍大气污染控制的基本原理、主要大气污染物的控制工艺和特点、典型工艺的基本计算方法和应用范围、以及相关技术的国内外最新研究进展。近年来，大气污染日益突出，严重威胁公众健康，成为人类面临的共同挑战。《大气污染控制工程》的授课内容紧密结合大气污染控制工程实践和学科发展前沿，重点培养学生分析和解决大气污染控制工程问题的能力，为大家进行大气污染控制工程设计、科研及技术管理打下必要的基础。该课程是清华大学第一批校级精品课程。2004年，该课程成为全国首门“大气污染控制工程”国家级精品课程。2013年，该课程成为中国大学精品资源共享课。目前该课程由清华大学环境学院王书肖教授、郝吉明教授共同讲授，教学团队包括吴烨教授、段雷教授、段凤魁博士以及5位助教。我们课程组将竭力为同学们服务！欢迎所有对大气污染控制感兴趣的同学加入我们的课堂。让我们一起学习《大气污染控制工程》，了解并掌握大气污染控制的原理和方法，共同为环保事业奉献自己的一份力量！",
    "C_course-v1:HEBUT+20180301001+2019_T1": "本课程重点讲解工程建设基本程序、工程进度控制、质量控制、成本控制的方法以及安全管理、环境管理、合同管理等相关知识，为培养优秀的专业管理人员打下良好的基础。通过学习本课程，可使学生了解工程建设基本程序，掌握建设工程项目管理的基本理论和方法，具备应用本课程所学工程项目管理思想、理论知识、技术、方法解决建设工程项目管理实际问题的基本能力。为学生毕业后从事有关的工程建设管理工作奠定坚实的基础。",
    "C_course-v1:TsinghuaX+70000662+2019_T1": "大数据时代将对各学科研究领域的数据收集与利用、分析方法与研究手段带来革命性的改变。当前城市大数据对城市物质和社会空间进行了深入的刻画，亦提供了客观认识城市系统并总结其发展规律的重要依据。本课程将结合中国城市规划以及其技术发展的特点进行讲授，讲解数据技术的研究方法，以及城市系统和规划设计领域的应用。教授内容主要涵盖了数据获取、统计、分析、可视化，城市系统分析，各个规划类型的应用，以及最新前沿介绍等内容。在经过本课的学习之后，同学们预计将收获以下主要内容：1.数据方面，本课提供了一套完整的北京旧城城市空间新数据；2.方法方面，掌握基本的数据抓取、分析挖掘、可视化等操作；3.思维方面，培养利用新数据、量化研究方法和先锋技术手段认识城市和规划设计城市的思维方式；4. 研究方面，在数据获得、方法掌握和思维熟悉的基础上，提高利用城市空间新数据的研究能力。欢迎对大数据、城市和城市规划感兴趣的用户选课。欢迎选用2019年1月中国建筑工业出版社出版的《城市规划大数据理论与方法》配合本MOOC课程学习（已经全网上线，https://item.jd.com/41422586456.html）。",
    "C_course-v1:TsinghuaX+2017091801X+2019_T1": "PPP（Public-Private-Partnership）直译为公共部门与私人部门的伙伴关系，简译为“公私合作”，在中国，自从2014年以来政府通过政策文件统一其称谓为“政府和社会资本合作”，其中社会资本包括国有企业，这是我国的一大特色。PPP项目有很多可选择的操作模式，包括委托运营（O&amp;M）、管理合同（MC）、建设-运营-移交（BOT）、建设-拥有-运营-移交（BOOT）、建设-拥有-运营（BOO）、转让-运营-移交（TOT）、改建-运营-移交（ROT）和政府购买服务等，可按照项目属性（包括经营性、准经营性和非经营性）来选择不同的模式。近年来，我国越来越多学者在从事PPP相关的研究，我国的PPP项目实践也正呈现加速的趋势。本课程将由来自PPP业界不同领域的八位讲师分别讲授八堂课程，包括基本概念、政策环境、风险管理、立法探讨、经济评价、PPP实践、国际PPP发展借鉴、项目管理等，让学生对PPP相关领域既有一个基本的了解，又有一个深入的感知。 教学目的：本课程对培养学生在PPP（公私合作）方面的兴趣有重要的作用，通过本课程的学习能使学生在PPP基本概念、理论框架与研究现状、政策环境、实践现状与趋势、现存问题和探索等方面有所了解，从而能提高学生在PPP相关领域中的认识、感知和思考水平，本课程拟组建的师资队伍代表了我国PPP领域的最高水准，他们的授课会对学生和中国PPP产生深远影响。",
    "C_course-v1:BIFT+2018122901X+2018_T2": "《服装大师的设计历程》这门课程主要讲述了三个国家12位设计师：4位英国服装设计师：Charles Frederick Worth高级定制之父；Alexander McQueen时尚设计鬼才；John Galliano浪漫主义大师；Vivienne WestwoodWestwood “朋克”之母。5位法国设计师：Gabrielle Chanel，奋斗传奇的一生，Christian Dior四十岁开始创业，天才设计师；Karl Lagerfeld时尚界的凯撒大帝，Yves Saint Laurent时尚设计奇才，Giorgio Armani优雅设计大师。3位意大利服装设计师：Ottavio Missoni针织品掌门人，Valention Garavani天才设计师，Martin Margiela低调的解构怪才设计师。   如果你想了解更多，请走进《服装大师的设计历程》，教师用浅显易懂的英文讲述着一个个服装大师的故事，服装专业知识与语言的融合，使你们在学语言的同时对服装设计流程，服装设计元素，秀场等概念有初步的了解，普及服装方面的知识，拓宽学习者的知识面，对服装领域有个总体的概念从而激发后期对服装品牌设计的再思考。",
    "C_course-v1:BIFT+2018122902X+2018_T2": "《服装CAD应用》带您掌握服装CAD的基本概念，了解服装CAD的系统配置和当前国内外服装CAD的开发应用状况。通过操作实践，掌握典型二维服装CAD软件和三维服装CAD软件的主要功能与应用。",
    "C_course-v1:TsinghuaX+2018011901X+2019_T1": "本课程依次介绍Petri网系统、Petri网理论和应用实例。 网系统包括基本网系统（EN-系统）、库所/变迁系统（P/T-系统）、谓词/变迁系统（Pr/T-系统）、有色网系统及C-net系统。这些系统构成一个自然层次，本课程从底层的基本网系统开始依次给出它们的定义、性质和分析方法，突出其层次特征，包括结构特征和动态特征，特别是给出了顺序、并发、冲突和冲撞等基本现象的准确定义。 Petri网理论包括同步论、并发论、网逻辑、网拓扑及信息流系统。本课程主要介绍同步论和信息流系统。同步理论是BPM建模的理论基础。 Petri网的应用实例包括：哲学家就餐问题、N部电梯控制问题、业务流程管理问题和过程挖掘。本课程详细介绍了这些问题的关键点分析和解题全过程。 最后，本课程Petri网的四季模型和我国传统的八卦图联系起来分析，得出了一些有趣的结果。作为科学研究的过程示例，这些结果及分析过程期待同学们的批评。同时传达“书上写的，老师说的不一定对”这一思想，鼓励同学们独立思考。",
    "C_course-v1:UIR+2018040201X+2019_T1": "《大学生国家安全教育》课程具有以下特色：一是课程内容丰富。课程以习近平总体国家安全观为主线，凸显国家安全战略、国家安全管理和国家安全法治等内容，向大学生展现了一张宏伟的国家安全蓝图，激发大学生的爱国主义情怀。二是强化案例教学。课程以鲜活的安全案例来阐述国家安全理论，如“从新疆暴恐案件看政治安全职能”、“从美国介入南海问题看军事安全职能”、“从‘雷达专家威廉•贝尔案’看情报人员的招录”等等。大学生可以从鲜活的案例中学习国家安全知识，提升国家安全管理能力。三是一流教学团队。该课程负责人为2017“国家精品在线开放课程”《解码国家安全》课程负责人，课程主讲教师除毕雁英教授外，其余两位教授都是《解码国家安全》课程的主讲老师。一流的教学团队为良好的教学效果提供了夯实保障。考核机制：在课程视频学习的基础上，习题作业及期末考试各占成绩的50%，满分100分，60分合格，85分优秀。",
    "C_course-v1:CSU+CSU002+2019_T1": "本课程是面对医学各专业（临床医学、药学、护理、口腔医学、精神卫生、预防医学、检验、麻醉等）、各层次（本科生、8年制、研究生等）学生开设的一门公共基础课。每年春秋季授课，选课人数达到1000人。主讲教师全部由教授或副教授担任。   本课程主要讲解医学信息检索的基础理论、基本知识和基本技能，中文医学文献数据库检索，PubMed检索，Web of Science检索，参考文献著录与管理等核心课程内容。旨在培养学生的信息意识和思维能力，掌握从浩如烟海的文献信息中获取知识和信息的技能，提高学生独立提出、分析和解决问题的能力和主动学习能力，培养学生数据库使用以及参考文献著录与管理的能力，提升学生的信息素养。     本课程主要采用多媒体教学、案例教学、PBL教学、科技查新大赛、课外兴趣活动小组等多元化教学方法和手段。教学内容丰富经典，讲解深入浅出，视频生动直观且富有趣味性，并编有《医学信息检索实习指导》和相关试题库，课堂教学深受师生好评。考核机制：除视频学习外，5次章节测试的得分和为总成绩，60分合格，85分优秀。",
    "C_course-v1:HQU+20180307009+2019_T1": "随着市场经济的不断发展，礼仪在人们的社会交往中发挥着越来越重要的作用，遵循礼仪规范已成为商务组织超越同行、保持领先的重要战略。在现代交往中，商务礼仪是最核心、最具有适应性和通用性的礼仪要求，也是适应和促进现代社会多向沟通、高效交流的重要规范与保障。掌握必要的商务礼仪不仅对商务人士走向成功起到重要的助推作用，对现代社会每一个人更好地营造良好的人际关系、促进沟通与交流、打造团队、融入群体等也都具有重要的作用，更是当代大学生融入社会、走向成功的必备通行证。本课程主要讲授求职应聘、个人仪表服饰、商务会谈、商务通讯、会面和名片使用等实用礼仪知识，注重从同学们的实际需要出发，通过大量丰富精彩的案例分析，使不同专业的同学都能经过学习，切实提高自身的沟通技巧与综合素质，增强在现代社会中高效交往，形成良好人际关系和人际互动，不断竞争获胜的能力。",
    "C_course-v1:SXPI+20170828001x+2019_T1": "本课程从职业岗位要求出发，基于工作过程整合了传统《电机与电控》、《PLC》、《变频器》、《电力电子》、《自控系统》等课程部分或全部的理论和实践环节，成为装备制造类电气自动化专业的核心专业课程。   针对教学实施提供课程资源，针对学习提供学习资源，针对职业特性提供素材资源，资源的表现形式多样，实现共享。 本课程教学内容的选择结合电气类企业岗位需要，基于生产流程，以“任务驱动”形式，在教学实施过程中采用“资讯－计划－决策－实施－检查－评价”六步骤教学法，以学生自主学习为主，使学生有计划的学习，有目的的学习，有评价过程的学习，由简单到复杂的完成工作任务，，使讲授、示范、训练同步进行，通过若干实训任务完成技能训练，逐步形成职业能力。   具有教学目标定位准确；教学模式、方法与教学内容紧密结合；教学手段多样，教学资源丰富；实训条件良好；教师队伍结构合理等特点。   将实际案例引入教学中，每个知识点均与实际应用结合。采用案例教学法、启发引导法，通过精心准备项目内容，预设问题，引导学生思考、讨论，除了给学生必要的提示外，其他的内容留给学生自己查找相关资料，以减少讲课时间，提高教学效率，培养学习能力。   与国内同类课程相比，课程在教学理念、内容选取、内容组织、教学过程设计、教学方法应用等方面具有明显优势，处于同类课程建设前列。 考核方式：作业40%+期末考试60%",
    "C_course-v1:SXPI+40281x+2019_T1": "本课程以欧姆龙CP1E型PLC为例，按照项目引导，任务驱动教学方法设计，内容包括6个项目，按项目任务对教学内容进行序化，以基于工作过程的思想组织，把PLC应用技术的基本知识及基本技能项目化和任务化，分解到6个项目21个工作任务中，每个工作任务技能训练项目中，将技能训练效果进行记录，并量化考核，使学生完成搜集资讯、计划、决策、实施、检查、评估一个完整的工作过程。将职业素质和职业道德培养落实在每个教学环节中，采用教、学、做一体化现场教学模式，使学习者在做中学，学中做，做学结合，在完成任务的过程中掌握PLC应用技术的基本知识，训练PLC的基本技能，培养学生的职业素质能力。通过一系列项目的学习与训练，使学习者逐步掌握欧姆龙CP1E型PLC控制系统设计、安装与调试。 ",
    "C_course-v1:LUIBE+2018080602+2019_T1": "《会展策划与管理》是会展经济与管理、会展策划与管理等会展类专业重要的专业核心课程，也是面向社会会展从业人员开设的业务培训课程。本门课程授课团队具有职业会展资质和丰富实战经验，并有多名会展企业人员参与课程设计与研发工作，实现了课程内容与行业企业标准完全对接，教学过程与业务流程完全对接，学习目标与岗位任务目标完全对接，让你轻松掌握会展项目前期筹备、组织实施与后期管理相关的基本知识和技能，快速胜任会展项目策划和管理工作，成功晋升高级会展项目管理者！",
    "C_course-v1:LUIBE+201808064+2019_T1": "该课程是一门特色鲜明、彰显爱国主义的思想政治教育类课程。课程通过百年旅顺的屈辱历史和沧桑巨变，折射近代以来的中国社会变迁。学生通过课程的学习，不仅了解旅顺的沧桑往事和历史变迁，更能够透过旅顺这座露天的历史博物馆，透过一处处历史遗迹，透过一个个中国故事，深刻理解一个地区的兴衰与国家的兴衰紧密相连的道理，从而进一步激发大学生自强不息、强国报国。",
    "C_course-v1:LUIBE+2018080601+2019_T1": "该课程为辽宁对外经贸学院公共基础选修课； 校内讲授时间为两年；学生类型为全校本科生，人数三千人； 学生通过本课程的学习，理解电影作品的艺术特色，领略电影艺术作品的恒久魅力，潜移默化地激励学生的精神，启迪学生的心智，温润学生的心灵，提高学生的影视艺术鉴赏能力，提升学生的审美水平和艺术修养，培养学生形成正确的人生观、价值观。 本课程精选中外优秀电影作品，按照表现主题的不同，分成八大模块。力求从电影艺术的基本特征、著名导演、演员的艺术个性、电影作品的艺术特色领略电影艺术作品的恒久魅力。 ",
    "C_course-v1:LUIBE+201808063+2019_T1": "本门课程借助丰富翔实的图片和视频资料，生动、系统地分析解读中国人生仪礼、岁时节日、生产、饮食、服饰、居住、交通、游艺、信仰等各类民俗事象的产生、发展及其在当今社会的形态。通过学习，您可以深入了解中国民俗文化的发展与变迁，认识中国不同特色的风俗、习惯、心态、制度等，充分感受中国民俗文化的恒久魅力及其在社会生活中的广泛影响，进而提升对中国传统文化的认知与热爱，增强民族自信心和责任感，更好地保护、传承和弘扬传统文化。 ",
    "C_course-v1:snnu+20180920X+2019_T1": "思维来自实践，又指导实践。而各项思维能力中，最重要就是逻辑思维能力，如同写文章，没有逻辑的文章就会凌乱不堪。逻辑学是一门高度抽象的科学，也是一门实践性极强的科学。许多优秀的文学作品中蕴藏着逻辑推理。文章写作需要逻辑思维。因此，本课程旨在探讨逻辑思维与写作，对强化思维能力，提高写作水平是很有实际意义的。   通过逻辑思维与写作课程的学习，要求学生掌握逻辑学的基础知识、基础理论，提高学生的思维能力。加强逻辑思维的训练，提高学生分析问题与解决问题的能力，为学习其他知识打下坚实的基础。本课程在教学设计上，以传统逻辑为主，同时兼顾逻辑思维在写作中的应用。通过它的体系架构和内容设置，使学生达到以下学习目标：   首先，针对逻辑基础知识，能够熟练掌握和运用最基本的逻辑技术和技巧，学会运用逻辑知识分析和解决实际问题，以达到提高逻辑思维能力和培养良好的思维素质的目的。已知的信息定义、分类、归纳，以及信息之间关系的把握，这一点则需要对于命题关系进行学习。   再次，针对写作方法，知道怎么写，掌握基本的推理类型和因果关系，以及论证方法和规则的熟悉运用。结合逻辑关系，一方面是指前后语句的联系，以及事情之间具有前因后果的关系；另一方面，在论证过程中，结论由前提按照推理的一般规则从论据中合乎逻辑地推理出来。即在论证过程中，论据与论题之间存在逻辑关系，从论据能够合理地推导出论题。   最后，本课程旨在培养学生的高水平逻辑思维，从而梳理对知识的敏感性，帮助学生掌握如何用严谨的思维和科学的方法去论证事实、说明观点。",
    "C_course-v1:SXPI+20180919X+2019_T1": "1. 认识创新，了解创新意识，激发创新意识； 2. 熟悉创新思维相关知识，能够突破创新思维障碍，展开创新思维训练； 3.掌握创新方法，提升创新能力，了解创新成果相关知识，具备成果保护意识； 4. 熟悉创业基本知识，激发创业灵感，明确创业者和创业团队所需具备的素质； 5.熟悉创办新企业流程，实践创业想法，具备创业计划书等重要文书的撰写能力； 6.熟悉新企业管理相关知识，具备管理新创企业的基本能力，能够对新创企业进行管理。 7. 培养创新创业意识，强化创新思维，全面提升创新创业素质和能力。 ",
    "C_course-v1:CSU+2018020101X+2019_T1": "属于思想政治理论课系列的文化素质课程。本课程旨在促进青年大学生顺利适应大学生活，增强心理保健意识，为把大学生培养成新时代创新型人才打下良好的心理素质基础。叶湘虹博士和唐海波博士用40个视频，带领你学习绪论和八个专题内容，在心理健康的海洋里遨游。本课程会让你在了解绪论大学生心理健康标准的基础上，学习1.自我意识发展，2.情绪情感调节，3.人际关系调适,4.性心理与恋爱心理维护,5.学习与创造心理,6.健康人格塑造,7.生命教育与心理危机干预,8.大学生生涯规划等八个专题内容，掌握基本的心理调适方法与技能，充满智慧地面对压力重重的现实生活，协助你活出多彩而满意的人生。英国哲学家怀特海说：“中学生，他们需要伏案学习；大学生，他们需要站起来四面观望！本课程将为你拨开迷雾，引领航程，协助你站起来四面观望，活出精彩人生。",
    "C_course-v1:TsinghuaX+10421094X+2019_T1": "线性代数是现代数学的基础之一，在物理、计算机图形学、工程、经济学等自然科学和社会科学各领域具有广泛和深刻的应用，同时线性代数是高等学校理工科各专业的一门重要基础课。本课程做为清华大学非数学理工科各专业学生重要的必修课程，介绍求解线性方程组、矩阵理论、向量空间和线性变换等线性代数的基本概念和基本理论，强调线性代数的理论与应用的结合。线性代数（1）围绕求解线性方程组，介绍高斯消元法、矩阵的性质运算和分解、向量空间、正交投影与最小二乘法、行列式的性质与计算、特征值特征向量与矩阵对角化、实对称矩阵的性质等基本知识点及其应用。通过本课程的学习，培养学生的数学逻辑思维和抽象思维能力，使学生具备线性代数的基本理论知识，熟练掌握求解线性方程组和矩阵运算、矩阵分解的基本方法，掌握英文数学术语和表达规范，为后继的学习和提高奠定数学基础。",
    "C_course-v1:CSU+20180910X+2019_T1": "  本课程是面向医学各专业学生开设的一门学科基础必修课，是一门将临床与科研相结合并引导科研入门的课程。主讲教师全部由教授、副教授或相当职称教师担任。  该课程主要讲解医学实验技术与方法方面的进展，涉及医学科研课题实验设计、实验实施和总结、细胞生物技术及临床应用、流式细胞术、分子生物学在临床研究中的应用、免疫组化技术、药物基因组学的临床应用和实验模拟、体内药物分析在临床中的应用以及生物信息学常用数据库和软件等多方面的基础理论讲解及应用，培训其相关实验操作的基本技能，力求培养学生科学严谨的思维方法和主动学习能力，训练其观察记录和分析实验结果的能力，学会实验设计、文献检索与阅读、数据库使用以及实验总结与写作的能力，为进入实验室开展科研实验奠定基础，为实现基础医学与临床医学之间的转化创造条件。",
    "C_course-v1:NJU+2018041201X+sp": "中国传统文化源远流长，博大精深，绵延五千年而未曾断绝，至今仍然焕发着蓬勃的生命力和独特的魅力。在历史的漫漫长河中，中国传统文化虽然与马克思主义、西方主流思想等不断发生摩擦、碰撞和融合，但传统文化中的精髓始终流淌在我们的民族血液中，经久不衰，历久弥新。中国优秀传统文化是实现中华民族伟大复兴的文化根基，特别是在市场经济迅猛发展和现代化浪潮冲击下的当今社会，构建先进文化，重铸中华文明，亟需我们从中国传统文化中，从古代圣贤那里汲取营养。本课程将带领大家以真实不妄的态度“走近”中华优秀传统文化，在先贤与原典的指引下领略传统文化的真正精华，在历史与现实的思考中体会传统文化的优秀理念。本课程分为上下两篇，上篇概论性阐述了中华优秀传统文化的地位、历史发展、主要特征、基本精神和核心理念，并结合当下理论与现实的需要阐明了如何正确认识和弘扬中华优秀传统文化。下篇具体阐释了精忠报国、以民为本、天下大同、勤俭廉政、舍生取义、仁爱孝悌、和而不同、敬业乐群、诚实守信、自强不息、厚德载物、尊师重道等十二个中华优秀传统文化中的核心理念，以经典文本为据，以古今案例为辅，深入浅出，结合日常工作、学习、生活的实际辨析传统文化的独特内涵与当代价值，切实弘扬中华传统文化传承到今的精神内核，捍卫中华传统文化中的优秀理念，筑就每一个中国人挺立的精神人格。",
    "C_course-v1:XIYOU+20180208+2019_T1": "编译技术是计算机科学与技术专业研究生重要软件理论课程，培养学生解决问题的思路和抽象思维的方法。通过本课程的学习使学生对高级语言程序的编译过程及其原理有较全面的了解，从理论和实践上掌握高级语言程序翻译的基本原理，具有系统软件翻译开发的能力，为进行其它软件设计打下良好的基础。 《编译技术》课程的成绩评定及证书要求1.完成所有课程的学习内容、视频、课件等；2.完成所有的单元测验，占总成绩的25%；3.完成所有的单元作业，并完成作业互评，占总成绩的15%；4.参加期末考试，期末考试占总成绩50%；5.在“课程讨论区”中发贴和回贴，根据发帖和回帖数量确定成绩，合计参加讨论问题达到10次及以上为满分，占总成绩的10%。 通过视频学习，完成测试、作业和期末考试。60分-79分为合格，80分及以上为优秀。达到课程要求后，可以获得课程主讲教师签名颁发的合格证书或优秀证书。",
    "C_course-v1:TsinghuaX+laserapp+2019_T1": "课程首先分析了激光与热光相干性差别，其次介绍了在激光器谐振腔内如何基于光与物质相互作用的物理原理选择激光单纵模。介绍激光速率方程组和激活态的相应能级。学生将掌握激光加工过程中激光辐射的基本特性。同时熟悉激光与物质的相互作用、光的传播过程和明白激光加工和激光测量的工业应用情况。首先分析了激光与热光相干性差别，其次介绍了在激光器谐振腔内如何基于光与物质相互作用的物理原理选择激光单纵模。介绍激光速率方程组和激活态的相应能级。学生将掌握激光加工过程中激光辐射的基本特性。同时熟悉激光与物质的相互作用、光的传播过程和明白激光加工和激光测量的工业应用情况。",
    "C_course-v1:HIT+13SC20301820+2019_T1": "“会计信息系统”是会计学专业必修的核心课程。课程使学生掌握会计信息系统的基本理论：会计软件的研发方法与流程、系统设计思想、系统结构和应具备的基本功能，以及数据存储设计，输入输出设计等。掌握会计信息系统的系统划分，各系统的分析、设计以及系统之间的关联。会计信息系统的基本理论、方法和设计思想不会因信息平台的更新而变化。无论网络结构如何变化，是局域网，还是广域网，移动平台、大数据、云计算等等，都不会改变会计信息系统的基本理论、方法和设计思",
    "C_course-v1:CHD+20180622001+2019_T1": "《道路工程材料》不仅是土木类道路桥梁与渡河工程的专业基础课，也是土木类、交通类其他专业的必修课，是培养学生理论基础、实践能力和创新思维的核心课程之一。本课程为国家级精品课程，面向本科生授课（年均440人），校内一般讲授38学时。本课程由公路工程系列课程国家级教学团队、道路工程材料陕西省教学团队的核心成员主讲，教学中将前沿科学和工程实践融入课堂，强化实践教学以锻炼能力，拓展科技创新以开发思维，教学体系完整，教学内容与时俱进、教学资源配套完善、教学方法先进科学，理论与实践教学相得益彰。",
    "C_course-v1:ACCA+MA1_X+2019_T1": " ACCA-X全球在线课程由世界知名在线学习平台edx提供运作，该平台由麻省理工大学和哈佛大学共同搭建。课程内容由伦敦帝国理工学院分支机构Epigeum专业设计开发，旨在帮助有志成为未来商界领袖、会计师和企业家获得入行必备知识及在现实世界里处理财务会计业务活动中所应具备的专业能力。ACCA-X已获全球奖项包括：1.PQMagazine Awards 20172.AssociationExcellence Awards 20173.Internationaland European Association Awards 20164.EducationInvestor Awards 20165.LearningTechnologies Awards 20166.Featuredin the Financial Times 2016ACCA-X全面汉化的中文课程由学堂在线提供运作，学堂在线是清华大学发起的精品中文慕课平台。本课程的互动性非常强，所有的学习活动均经过精心构思和巧妙设计。课程管理团队还将邀请国内财经大咖做精彩的线上线下分享，让您直接地了解财会行业的事，财会行业的人，近距离感受财会的魅力及价值。完成课程的同学，也会获得由学堂在线与ACCA联合认证的证书。本课程：初级管理会计学，是管理会计的基础课程。通过学习管理信息，培养学员在现实环境里处理管理会计业务活动中应具备的基本专业能力。此课程不仅适合在校学生，也可作为从业人员了解企业管理会计的理想入门课程。本课程的学习目标：帮助学员认识并了解如何在组织中将数据转化为信息，为规划和决策提供有效的管理支持。本课程由ACCA New Ventures 特聘专家Barry Walsh先生和Tara Askham 女士提供在线视频授课。Barry是具有专业资质的会计师，在许多不同的行业都有着丰富的经验，他也是一名会计软件咨询师。在过去的15年中，Barry从事专业资质的教材出版和培训工作，也为专业会计师考试编写客观测试题。 Tara在诺丁汉中央学院（Central College，Nottingham）教授簿记课程，在会计专业领域有着丰富的教学，命题和编写教材的经验。通过本课程的学习，您将主要掌握：1.成本和管理会计的本质及目的2.如何记录和分类成本3. 如何使用电子表格 ",
    "C_course-v1:ACCA+MA2_X+2019_T1": " ACCA-X全球在线课程由世界知名在线学习平台edx提供运作，该平台由麻省理工大学和哈佛大学共同搭建。课程内容由伦敦帝国理工学院分支机构Epigeum专业设计开发，旨在帮助有志成为未来商界领袖、会计师和企业家获得入行必备知识及在现实世界里处理财务会计业务活动中所应具备的专业能力。 ACCA-X已获全球奖项包括： PQ Magazine Awards 2017Association Excellence Awards 2017International and European Association Awards 2016Education Investor Awards 2016Learning Technologies Awards 2016Featured in the Financial Times 2016ACCA-X全面汉化的中文课程由学堂在线提供运作，学堂在线是清华大学发起的精品中文慕课平台。本课程的互动性非常强，所有的学习活动均经过精心构思和巧妙设计。课程管理团队还将邀请国内财经大咖做精彩的线上线下分享，让您直接地了解财会行业的事，财会行业的人，近距离感受财会的魅力及价值。完成课程的同学，也会获得由学堂在线与ACCA联合认证的证书。 本课程：中级理会计学，是为内部管理人员使用管理信息用于决策制定设计的课程。作为管理会计的提升课程，如果您已有一定的基础的管理会计和商务知识，可以选择这门课。本课程的学习目标：帮学员了解成本和资金管理基本原理，为规划和决策提供有效的管理支持。本课程由ACCA New Ventures 特聘专家Jayne Howson 和Valli Rajagopal 女士提供在线视频授课。Jayne是一名具有专业资质的会计师，有25年教授ACCA的丰富经验。她专长于财务报告和财务管理课程，也教授税务课程。Jayne为课堂授课设计和编写教辅材料及技术性文章，多篇文章已经在ACCA学员期刊（Student Accountant）上发布。 Valli是一名管理会计作者，同时也是高等教育学院（Higher Education Academy）的研究员。Valli曾有多年在荷兰及中国从事教师，记者和会计工作的经历。作为一名具有专业资质的会计师，Valli也曾服务过多家慈善机构。 通过本课程的学习，您将主要掌握：1.成本核算的作用以及成本分类、成本习性2.现金管理、现金预算的目标、编制和控制机制 3.本量利（CVP）分析  ",
    "C_course-v1:TsinghuaX+10690012+2019_T1": "首席教授将讲授自身学术成长历程、生活和科研工作感悟等，激发学生的责任感、使命感和追求科学、追求真理的志趣和理想。同时，本课程配有一定量的经典阅读、小组讨论和写作环节。通过讲座和经典阅读，进一步丰富学生科学、人文、艺术及工程（特别是它们之间相互关联性）的知识；通过写作与导修环节，提高学生的书面表达和口头表达能力，了解初步的学术规范；小组讨论强调学生间的交流和互动，提高沟通能力和批判性思维的意识。",
    "C_course-v1:BFU+15002360+2019_T1": "一、课程理念创业需要有艺术思维，离不开技术行动。创业既有艺术范儿，更是技术活儿。创业是智圆行方的管理过程。时间是创业管理的基因，创业之路也有春夏秋冬、四季轮回。让我们一起探索有意思和有意义的创业管理金字塔，用24节气的智慧，打通创业路上的节点问题，实现艺术思维与技术行动的共振，奏响属于我们自己的创业管理四季歌。  二、课程内容脉络 序曲。认识创业管理的时间基因、艺术思维与技术行动，学习创业管理金字塔架构。 春种——精益启动板块。学习精益启动核心内涵、主要理念、基本逻辑和常见方法，运用春季6个节气智慧，打通创业者、创业行动、创业想法、创业团队、创业机会和创业资源等节点问题。 夏耕——模式创新板块，学习商业模式创新的内涵体系、核心要素、关键脉络和主要原则，运用夏季6个节气智慧，打通创业决策、创业领导、市场定位、产品开发、商业计划和盈利模式等节点问题。 秋收——价值创造板块。学习价值创造过程中的资源整合、融资获取、价值实现和颠覆创新，运用秋季6个节气智慧，打通新企业生成、合法性获取、创业与公司治理、创业与战略融合、公司内创业和国际创业等节点问题。 冬蕴——永续成长板块。从要素、类型、阶段、周期和重心等多元视角，学习创业成长规律，运用冬季6个节气智慧，打通创业失败、创业制度、创业生态系统、创业伦理、绿色创业和社会创业等节点问题。 三大修炼板块。基于上述四季板块，从“夏练三伏、冬练三九”理念出发，学习技术创新、学术创业和组织变革三大主题，强化创业管理的技术根基、学术延伸和变革本质。 第七篇：展望。着眼企业家精神和可持续发展，展望创业管理趋势动态，总结反思创业管理金字塔和四季歌，启发智圆行方的创业学习。 三、课程内容主题与相关知识点主题1四季歌序曲 从艺术思维与技术行动到不确定性情境主题2创业管理金字塔 二元导向与三类要素 四段进程：四季节气智慧主题3春种板块：精益启动 精益启动核心内涵与主要理念 精益启动基本逻辑和常见方法主题4春季节气智慧与创业节点问题 立春：谁是创业春姑娘；雨水：创业汗水和泪水； 惊蛰：惊醒创业小伙伴；春分：创业想法分水岭清明：机会开发要清明；谷雨：资源胜似毛毛雨主题5夏耕板块：模式创新 商业模式创新的内涵体系（画布与画脸） 商业模式创新核心要素、关键脉络与主要原则主题6夏季节气智慧与创业节点问题 立夏：有破有立的创业决策；小满：永不满足的创业领导 芒种：不能盲种的市场定位；夏至：产品来了 小暑：热火朝天完善计划；大暑：盈利不能头脑发热主题7秋收板块：价值创造 资源整合与融资获取价值实现与颠覆创新主题8秋季节气智慧与创业节点问题 立秋：新企业开门大吉 处暑：合法性谨慎处理 白露：明明白白谋治理 秋分：创业战略分分清 寒露：内创业激活冷冻鱼 霜降：万类霜天逐鹿国际主题9冬蕴板块：永续成长成长规律与要素视角 类型视角与阶段视角 周期视角与重心视角主题10冬季节气智慧与创业节点问题 立冬：直面创业失败；小雪：谁在雪中送炭 大雪：兆丰年的生态系统；冬至：第一桶金的黑与白 小寒：绿色创业提热度；大寒：社会创业是暖流主题11三伏天三九天的三项修炼 技术创新学术创业 组织变革主题12展望 企业家精神 可持续发展与尾声 ",
    "C_course-v1:ZAFU+20171218+2019_T1": "一、课程属性 《管理学原理》作为普通本科院校经济管理类各专业必修的专业基础课，以及非经济管理类各专业的专业拓展选修课或个性发展选修课，具有科学性、艺术性、实践性、综合性、不精确性等属性。二、课程教学目标   本课程的教学目标包括如下三个方面：1. 理论知识目标。系统掌握“管理学”的理论知识，使学员具体扎实、系统、全面的管理学理论功底，为今后的专业课学习打下基础。2. 技能、过程与方法目标。通过“课堂进企业”、“企业家进课堂”等教学栏目，以及案例调查与分析等作业形式，训练学员的管理思维，锻炼和提高他们运用管理理论和方法分析管理现象、解决管理问题的能力。3. 情感态度与价值观目标。从经济人、社会人、自我实现人等管理学假设入手，尤其通过管理伦理的引入，提高学员们对管理目标的全面认识，培养他们的道德情操，建立正确健康的价值评判标准。三、课程教学特点   本课程的教学注重增强实践环节：1. “课堂进企业”：每章的理论讲解视频之后，都安排1段“企业家谈管理感悟”的视频，镜头切入企业现场，由企业家现现身说法，谈自身的管理心得与感悟；2. “企业家进课堂”：安排2个“企业家管理实战案例”的视频，为学员们点拨管理理论如何与企业实践对接与碰撞；3. “案例分析”：每位学员都要完成2次案例分析作业，要求根据事先布置的案例题目进行调查，按照相应的分析范式撰写案例分析报告，提交课程平台后台教师进行评阅。四、教学内容及课时分配：   第1章　管理学导论       5 第2章　管理理论的演进 10 第3章　管理环境         4 第4章 决策           10  第5章 计划            9  第6章 组织结构设计     8  第7章 组织文化        6  第8章 领导理论        4  第9章 激励理论        8  第10章 沟通           7    第11章 控制          5  第12章 管理创新       5  合计               81 五、考核与评价： 1、知识点测试，占30%；知识点测试（采用客观题），每章约20~30题；2、案例分析作业，占20%，2次，每次提交一份案例分析报告；3、期末考试，占50%，其中客观题与主观题各占一半，客观题题型包括判断、单项选择、多项选择等三种，主观题题型包括简答、计算、案例分析等三种；4、上述3项满分为100分，获得60分及以上者即可获得“通过”证书，85分以上者可获得“优秀”证书。",
    "C_course-v1:BNU+0910042801+2019_T1": "“普通化学”是面向理科一年级学生开设的化学通识课，属于北师大通识教育课程类/数理基础与科学素养模块/必修课程，选课人数约500人。校内授课每周3学时，共计48学时。主要内容包括原子结构、分子结构、四大平衡、化学热力学与动力学基础，以及有机化学导论等，同时融入了与生命科学、环境科学、材料科学等相关的化学内容，注意并体现化学与相关科学各专业的联系及应用，激发学生学习兴趣。通过本课程的学习，使学生初步了解现代化学的基本概念和原理，了解现代化学的发展和成就，对化学有一个基础而广泛的认识，并能应用所学知识初步解决一些实际化学问题。考核机制：完整学习课程视频，则章节测试和期末考试各占40%、60%，总分100，60分即为通过，85分为优秀。",
    "C_course-v1:ACCA+FA2_X+2019_T1": " ACCA-X全球在线课程由世界知名在线学习平台edx提供运作，该平台由麻省理工大学和哈佛大学共同搭建。课程内容由伦敦帝国理工学院分支机构Epigeum专业设计开发，旨在帮助有志成为未来商界领袖、会计师和企业家获得入行必备知识及在现实世界里处理财务会计业务活动中所应具备的专业能力。 ACCA-X已获全球奖项包括： PQ Magazine Awards 2017Association Excellence Awards 2017International and European Association Awards 2016Education Investor Awards 2016Learning Technologies Awards 2016Featured in the Financial Times 2016ACCA-X全面汉化的中文课程由学堂在线提供运作，学堂在线是清华大学发起的精品中文慕课平台。本课程的互动性非常强，所有的学习活动均经过精心构思和巧妙设计。课程管理团队还将邀请国内财经大咖做精彩的线上线下分享，让您直接地了解财会行业的事，财会行业的人，近距离感受财会的魅力及价值。完成课程的同学，也会获得由学堂在线与ACCA联合认证的证书。 本课程：中级财务会计学，是针对为企业内部和外部利益相关者以标准形式记录商业交易和编制一系列账表，对于刚开始接触财会行业的人，如果您已有一定的财会与商务基础知识，可以选择这门课程。本课程的学习目标：建立对主要商业交易类型和通用会计准则和概念，了解复式记账法使用和基础财务报表编制的技巧以及编制合伙企业账户。本课程由ACCA New Ventures 特聘专家Jayne Howson 和Valli Rajagopal 女士提供在线视频授课。Jayne是一名具有专业资质的会计师，有25年教授ACCA的丰富经验。她专长于财务报告和财务管理课程，也教授税务课程。Jayne为课堂授课设计和编写教辅材料及技术性文章，多篇文章已经在ACCA学员期刊（Student Accountant）上发布。 Valli是一名管理会计作者，同时也是高等教育学院（Higher Education Academy）的研究员。Valli曾有多年在荷兰及中国从事教师，记者和会计工作的经历。作为一名具有专业资质的会计师，Valli也曾服务过多家慈善机构。 通过本课程的学习，您将主要掌握： 通用会计准则和概念 如何编制试算表、日记账以及分类账目 控制账户目以及现金账对账 如何编制合伙企业账户  ",
    "C_course-v1:ACCA+FA2_X_en+2019_T1": "Intermediate Bookkeeping is part two of a programme designed for anyone who is just starting out on their business, finance or accountancy journey and wants to expand their accounting and finance skills. Building on what you learned in Introduction to Bookkeeping, this free online course from the Association of Chartered. Certified Accountants will: Enhance your finance and accountancy skills, exploring how to prepare financial statements. Arm you with the knowledge you need to take your exam in Maintaining Financial Records (FA2). Prepare you for a position as an accounting administrator or bookkeeper. If you have some basic knowledge of accountancy, business and finance, then this is the course for you. If you do not, then start with the Introduction course. This course does not offer an edX certificate.For learners who would like to earn an ACCA certificate for this course, please register with ACCA as a student. Once you pass ACCA’s computer-based FA2 exam on demand, you will also need to pass the MA2 exam (a free online exam preparation course is available through ACCA-X) and complete an online and interactive module on the \"Foundations in Professionalism.\" Upon completion of this module, you will be awarded the Intermediate Certificate in Financial and Management Accounting from ACCA. What you'll learn: In this course we will guide you on the next step of your finance journey by exploring: Widely accepted accounting principles and concepts. How to account for business transactions and events and prepare financial statements. Reconciliation of control accounts and the cashbook",
    "C_course-v1:BNU+2018011801X+2019_T1": "恢复生态学课程主要讲授生态恢复的原理、技术与方法，国内外最新进展和案例实践。课程大量使用动画、视频、彩图、场景模拟、场景实拍等手段，结合生动细致的讲解，让学员掌握恢复生态学的最新原理、技术和方法。课程适合于环境、生态、地学、农林、资源、管理学、社会学等多个相关专业的学生、教师、科研、管理、技术人员和推广人员学习，同时也适于生态环境保护和可持续发展感兴趣的广大社会有志之士学习。该课程已在北京师范大学教学13轮，学生反响良好。该课程是主讲教师在多年教学和科研工作的基础上，收集大量素材完成的视频公开课程。主讲教师董世魁现为北京师范大学环境学院教授、博士生导师，美国康奈尔大学自然资源系客座教授，美国新校大学中印研究所客座研究员，目前担任国际自然保护联盟（IUCN）生态系统管理委员会（CEM）东北亚地区主席、国家环保部环境影响评估中心常聘专家、中国草学会农业伦理学研究会副主任委员等学术兼职。获国家“万人计划科技创新领军人才”、科技部“中青年科技创新领军人才”，全国来华留学英语授课品牌课程主讲人，北京市优秀人才，北京市师德先锋，北京师范大学“2015年感动师大新闻人物”，获北京市教育教学成果一等奖1项，北京师范大学教学成果一等奖4项，二等奖2项，获北京师范大学本科教学优秀奖，通鼎青年教师奖，获教育部科技进步一等奖1项、二等奖1项，获西藏自治区科技进步奖一等奖1项、二等奖1项，青海省科技进步奖一等奖1项，主持完成国家级项目10余项，发表论文250多篇，主编（副主编）专著、教材13部。考核机制：完整学习课程视频，则章节测试和期末考试各占40%、60%，总分100，60分即为通过，85分为优秀。 ",
    "C_course-v1:BNU+0610073981+2019_T1": "本课程是西方哲学系列课程第一部分，主要内容是对古代西方哲学发展的历史描述和逻辑诠释，从公元前400年的古希腊哲学一直到中世纪经院哲学。 考核机制：除课程视频学习外，2次测试题和期末考试题分别占总成绩的60%、40%，满分100，60分合格，85分优秀。",
    "C_course-v1:BNU+1010070372+2019_T1": "微生物学是研究微生物生命活动规律及其应用的学科，是自然科学的重要组成部分。微生物学对生命科学的发展起了巨大的推动作用。微生物学与医学、工业、农业、林业、食品工业、环境、能源等领域关系密切。 本课程主要讲述微生物的形态结构、生理生化、遗传、生态、传染和免疫及微生物分类等内容。授课方式采用讲述、课堂讨论等方式。讲述中通过巧妙设计问题、应用视频资料等激发学生兴趣，引导学生思考，实施启发式教学。课后布置深入思考和探究的问题，让学生通过查找资料加以解决，培养学生分析问题和自主学习的能力。通过学习，学生既掌握本课程的教学内容，同时可增加对生命科学的深刻理解和思考，理解微生物学与其他学科的密切联系。 考核机制：在视频、讲义学习的基础上，章节测试和期末考试分别占总分的60%、40%，满分100分，60分合格、85分优秀。",
    "C_course-v1:BNU+GE310141091+2019_T1": "作为新闻传播学专业的一门基础课，本课程的定位突出对学生赏析中外经典影像案例以及实践动手能力的训练，强化基础知识传授、提高对经典案例的分析能力、模仿能力以及创新能力。课程主要体现以下特点： 1、本课程把实务教学置于影像传播学领域，用影像传播理论指导实务教学，强化课程的理论性。课程既有对传统平面媒体新闻摄影的组织结构、运作模式、发展趋势上的宏观审视，又有对某个具体新闻摄影事件以及影像叙事文本表达的微观关照。既有按照媒体发展历程中典型案例的纵向梳理，又有对比国外同类媒体运作中典型案例的横向比较。课程具有针对性、实用性、时代性、开放性等特点。 2、在知识传授的基础上注重案例教学和实践教学。本课程采用大量经典案例，通过实践教学强化课程的实践性、实用性和针对性。在移动互联网环境下，采用直接在线视频播放观摩、PPT 演示、现场录像演示、现场拍摄讲解等多种教学手段强化现代教育技术的最新应用。同时对学生学习效果的考核评价方式进行改进和完善，尤其体现在学生的实操作业上，把学生的摄影作品上传展示并在线讲评。  3、新闻摄影最大的好处是它可以讲故事，而新闻摄影呈现的故事很容易让人有生动贴切的代入感。通过新闻摄影作品的代入感，可以制造很好的师生共同讨论的话语空间，同时产生多重对话。我们希望本课程能形成以下四重对话：第一重对话是师生跟当下正在传播的新闻图片对话，看新闻图片，尤其是那些经典的，有影响力的新闻图片本身就会引出话题；通过在线课堂讨论，形成同学之间、师生之间对于知识、理论、传播实践的第二重对话；通过和知名新闻摄影记者以及新闻摄影大家的交流访谈，形成同学受众、摄影专家、主讲教师、影像文本之间的第三重对话；而对于中外经典案例的文化、社会、哲学、美学等层面上的全面解读则是形成文本、前人、学者、教师之间的第四重对话。考核方式：在课程视频学习的基础上，视频后的作业和期末考试各占总成绩的60%、40%，满分100分，60分合格，85分优秀。",
    "C_course-v1:ACCA+MA2_X_en+2019_T1": "Intermediate Bookkeeping is part two of a programme designed for anyone who is just starting out on their business, finance or accountancy journey and wants to expand their accounting and finance skills. Building on what you learned in Introduction to Bookkeeping, this free online course from the Association of Chartered. Certified Accountants will: Enhance your finance and accountancy skills, exploring how to prepare financial statements. Arm you with the knowledge you need to take your exam in Maintaining Financial Records (FA2). Prepare you for a position as an accounting administrator or bookkeeper. If you have some basic knowledge of accountancy, business and finance, then this is the course for you. If you do not, then start with the Introduction course. This course does not offer an edX certificate.For learners who would like to earn an ACCA certificate for this course, please register with ACCA as a student. Once you pass ACCA’s computer-based FA2 exam on demand, you will also need to pass the MA2 exam (a free online exam preparation course is available through ACCA-X) and complete an online and interactive module on the \"Foundations in Professionalism.\" Upon completion of this module, you will be awarded the Intermediate Certificate in Financial and Management Accounting from ACCA. What you'll learn: In this course we will guide you on the next step of your finance journey by exploring: Widely accepted accounting principles and concepts. How to account for business transactions and events and prepare financial statements. Reconciliation of control accounts and the cashbook",
    "C_course-v1:ACCA+FA1_X+2019_T1": " ACCA-X全球在线课程由世界知名在线学习平台edx提供运作，该平台由麻省理工大学和哈佛大学共同搭建。课程内容由伦敦帝国理工学院分支机构Epigeum专业设计开发，旨在帮助有志成为未来商界领袖、会计师和企业家获得入行必备知识及在现实世界里处理财务会计业务活动中所应具备的专业能力。ACCA-X已获全球奖项包括：1.PQMagazine Awards 20172.AssociationExcellence Awards 20173.Internationaland European Association Awards 20164.EducationInvestor Awards 20165.LearningTechnologies Awards 20166.Featuredin the Financial Times 2016ACCA-X全面汉化的中文课程由学堂在线提供运作，学堂在线是清华大学发起的精品中文慕课平台。本课程的互动性非常强，所有的学习活动均经过精心构思和巧妙设计。课程管理团队还将邀请国内财经大咖做精彩的线上线下分享，让您直接地了解财会行业的事，财会行业的人，近距离感受财会的魅力及价值。完成课程的同学，也会获得由学堂在线与ACCA联合认证的证书。本课程：初级财务会计学，是针对会计核算方法和应用实践的基础课程，不仅适合在校学生，也可作为从业人员了解企业会计基本概念的理想入门课程。本课程的学习目标：建立对主要商业交易类型和文件归档方式的认识，理解如何在会计系统中记录交易和存档，并编制试算平衡表。本课程由ACCA New Ventures 特聘专家Barry Walsh先生和Tara Askham 女士提供在线视频授课。Barry是具有专业资质的会计师，在许多不同的行业都有着丰富的经验，他也是一名会计软件咨询师。在过去的15年中，Barry从事专业资质的教材出版和培训工作，也为专业会计师考试编写客观测试题。 Tara在诺丁汉中央学院（Central College，Nottingham）教授簿记课程，在会计专业领域有着丰富的教学，命题和编写教材的经验。通过本课程的学习，您将主要掌握：1.商业交易，银行系统和复式记账法2.工资和分类账目3.试算平衡表 ",
    "C_course-v1:ACCA+MA1_X_en+2019_T1": "Interested in a career in business? Knowledge of accounting will be key to your success. By studying at your own pace, this Introduction to Management Accounting course is an ideal starting point if you want to: Start a career in business, finance or accountancy. Study business or finance at school or college. Launch your own start-up. Prepare for ACCA’s exam in Management Information (MA1) And the best thing is you do not need any previous knowledge of accounting- Simply sign up and start learning straight away. Course discussions will be moderated. This course does not offer an edX certificate. However, you can earn the ACCA Certificate in Financial and Management Accounting by registering with ACCA as a student, passing the ACCA’s exams in Management Information (MA1) and Recording Financial Transactions (FA1) and completing a free online module called Foundations in Professionalism. A free exam preparation course for FA1, called Introduction to Bookkeeping, is also available through ACCA-X. What you'll learn, in this course we will guide you on the next step of your finance journey by exploring: The nature and purpose of cost and management accounting. How to record and classify costs. How to use spreadsheets ",
    "C_course-v1:BNU+PHI2107404101+2019_T1": "课程的主要内容是精读《纯粹理性批判》重要章节，对康德批判哲学有总体的把握。该课程在教学中强调文本阅读，激励学生从知识型学习转变为研究型学习，善于把握和利用文献资料，树立问题意识，将学习过程转变为解谜活动。课程的目标在于培养学生阅读中文西方哲学典籍的能力，特别是对概念、范畴的思辩能力，对问题的深入思考能力。课程要求在课下精读原典，能够明其大要，提出疑难。  考核机制：本课程共分十章内容进行讲授，每章附一份练习试题，共十份练习试题作为平时成绩，占总成绩的60%；另附一份期末试题作为期末成绩，占总成绩的40%。课程满分100分，60分合格，85分优秀。",
    "C_course-v1:BNU+2017001+2019_T1": "课程采用案例教学和讨论式教学，对国内外重大环境突发事件，如松花江水污染事件、莱茵河水污染事件、伦敦烟雾事件、北京雾霾事件及天津大爆炸事件等进行研讨。 对重大环境污染事件产生的背景、原因、生态恢复措施、责任追究、应急处置措施、生态环境影响等多种方式的讨论。课程采用启发式教学，采用教师先介绍事件背景，提出不同的问题，吸引学生思考。然后教师进行归纳解答的方式进行教学。 课程在讲述重大环境污染事件的同时，对我国环境应急管理的内涵、特点、基本原则、应急体系等进行总结，使学员对我国的环境应急管理体制有更深刻的认识。  ",
    "C_course-v1:BNU+0610073991+2019_T1": "作为在线课程，本课程内容以海量信息和严密逻辑为特征、以引发学员思考和学习兴趣为优势。只要学员系统地学习本课程内容，就能够从中获得思想的教益和思维的锻炼。但由于哲学本身的抽象性和理论性特征，本课程更需要学员静心思考，全心感受，这或许对一般学员而言需要更多耐心。 考核方式：在完整学习课程视频的基础上，章节测验、期中考试、期末考试各占总成绩的20%、20%和60%，课程满分100分，60分合格，85分优秀。",
    "C_course-v1:TsinghuaX+80511503X+2019_T1": "在今天的变革时代，不管是谁、不论是什么，都需要营销！如果你想学营销，那么，赶紧一起来学习已有超过360万人次听课，美国营销学会主席、哈佛、沃顿院长等联袂推荐的、全国最受欢迎的营销课！如何营销一个产品？一个品牌？一个理念？甚至，如何向别人营销你自己？如何无需推销就能顾客盈门？这门课程将帮助你掌握营销的重要理念、策略和解决问题之道。关注\\\"MIC营销与创新社\\\"（微信公众号：yingchuangcn）即可加入郑毓煌教授的直播平台，每周观看郑毓煌教授与优秀企业家等各界嘉宾的对话直播！",
    "C_course-v1:ACCA+FA1_X_en+2019_T1": "Interested in a career in business? Knowledge of accounting will be key to your success. By studying at your own pace, this Introduction to Management Accounting course is an ideal starting point if you want to: Start a career in business, finance or accountancy. Study business or finance at school or college. Launch your own start-up. Prepare for ACCA’s exam in Management Information (MA1) And the best thing is you do not need any previous knowledge of accounting- Simply sign up and start learning straight away. Course discussions will be moderated. This course does not offer an edX certificate. However, you can earn the ACCA Certificate in Financial and Management Accounting by registering with ACCA as a student, passing the ACCA’s exams in Management Information (MA1) and Recording Financial Transactions (FA1) and completing a free online module called Foundations in Professionalism. A free exam preparation course for FA1, called Introduction to Bookkeeping, is also available through ACCA-X. What you'll learn, in this course we will guide you on the next step of your finance journey by exploring: The nature and purpose of cost and management accounting. How to record and classify costs. How to use spreadsheets ",
    "C_course-v1:SichuanU+106588020+sp": "巴蜀历史，源远流长。早在上古时期，巴蜀大地就孕育了人类文明，巴蜀文化是华夏史上的一颗璀璨明珠，它萌生于华夏文化，并不断为华夏文化添上浓墨重彩的辉光。一方水土养一方人，都江堰“乘势利导，因时制宜”，哺育着世世代代、智慧勤劳的川蜀儿女，浇灌出五彩斑斓的巴蜀文化长廊。“蜀戏冠天下”，川剧艺术涵盖古今、贯通表里，描绘出精彩纷呈的历史画卷。司马相如一曲《凤求凰》，赢得才女卓文君的芳心，留下以琴结缘的爱情佳话。三星堆一朝出土，金沙遗址重见天日，刷新长江文明的新纪录。",
    "C_course-v1:BurgundyX+82005+2019_T1": "葡萄与葡萄酒线上传播大学面向公众开放。它由勃艮第大学于2015年创立，这曾是葡萄酒线上课程的先锋。今天我们所看到的课程在原有课程的基础上又添加了新的内容，并提供了四种语言版本：法语、英语、西班牙语和中文。在接下来的五周中，参与者们可以通过这个融合了多门学科的课程了解到多方面关于葡萄酒的知识。不仅仅是从葡萄园到酒窖，我们同时还会学习到关于葡萄酒经济、历史以及关于文化交流方面的知识。我们首先会了解到一些关于葡萄酒的基础知识，当然我们也会讨论一些当下关于葡萄酒的棘手的问题，比如说全球变暖对葡萄酒的影响？ 葡萄的病虫害，我们如何改良葡萄园中的土壤？如何酿造一瓶葡萄酒？  接下来我们要学习如何“创造”和“管理”葡萄园的“风土”。在饮用葡萄酒之前，我们先要经历葡萄酒的装瓶和它的陈化。最后，葡萄酒的文化交流将为我们打开新世界的大门。",
    "C_course-v1:HRBEU+2018081301+sp": " 《知识产权法与创新保护》是一门面向法学和非法学本科专业及社会上的法学爱好者、科技人员、创业者的法律类跨学科课程。主要知识点和案例涉及专利法、商标法、著作权法、反不正竞争法、商业秘密法、侵权责任法、商事仲裁与诉讼等，为知识产权扎实基础理论的塑造提供了大量的前沿观点、国内外案例。面对数字时代的科技战争，如何提高风险意识、冷眼思维，以及预警防范能力问题，紧迫也实用。   如果您能够利用碎片化时间，自由自主地学习《知识产权与创新保护》课程，相信您不仅仅是位愿意选择精进的学人，更将会懂得利用知识产权技艺去主动认识五味杂陈的竞争社会。线上见！",
    "C_course-v1:GZHU+136300904+2019_T1": "死亡是什么？人为什么会死？人应该如何死？人临死会是怎样的心理？我们如何对待亲人的死？如何面对自己的死？对我们而言，死亡是那么的神秘而又恐怖。作为国内高校开设时间最长且最为系统的生死教育课程，主要涉及生死本质与尊严，死亡意识（畏死体验、死亡恐惧、濒死体验、临终心理），个体死亡（疾病、衰老、灾难），社会死亡（战争、贫穷、堕胎、死刑、动物生命权），生死两安（临终关怀、伤痛恢复、丧葬礼俗），死亡优化（安乐死、脑死亡与器官移植），自杀问题等内容。本课程以生死为核心概念，以当下生命为立足点，通过解除生死问题的神秘性，赋予生死问题以神圣性，旨在以死观生，优化自我生命。",
    "C_course-v1:XJTU+20171025001+2019_T1": "本课程的学习不仅能掌握化学反应、化学平衡、溶液中的四大平衡、电化学原理等重要知识，而且学会科学地发现问题、分析问题、解决问题的能力，为学生以后从事专业学习、科学研究奠定基础。本课程是西安交通大学自迁校以来一直开设的一门公共基础课程，经西安交通大学基础化学教师几代人的努力、传承、改革、创新、发展至今。本课程授课40学时、实验8学时，总共48学时。主要针对全校理工科近化学和非化学专业的学生学习。本课程的主干内容有五章，分别为：第一章 物质结构基础；第二章 化学反应中的能量；第三章 化学平衡和化学反应速率；第四章 溶液；第五章 电化学基础。本课程注重基础性、原理性、系统性、完整性，淡化专业色彩；注重与新时期高中化学的衔接、与科技前沿进展衔接，强调学生创新思维能力的培养。第一章  物质结构基础第1节  原子结构的近代概念  1-1   大学化学概论1-2   第一章概论、原子结构的经典模型1-3   波粒二相性、德布罗意物质波、海森堡测不准原理、微观粒子运动的统计性1-4   薛定谔方程、波函数、原子轨道1-5   四个量子数1-6   电子云与波函数1-7   能级、能级分裂、能级交错、钻穿效应、屏蔽效应1-8   核外电子的排布、能量最低原理、泡利不相容原理、洪特规则第2节  原子核外电子的排布和元素周期律  1-9   核外电子的排布规律1-10   原子结构与元素周期表的关系1-11   元素性质变化的周期性、原子半径1-12   元素的电离能、电子亲和能1-13   元素的电负性1-14   有关原子结构理论模型的说明第3节  化学键  1-15   化学键以及离子键的形成与特性1-16   离子键的极化 1-17   共价键及其特性1-18   配位键及配合物第4节  共价分子的空间构型 1-19   共价分子的空间构型1-20   杂化轨道理论①1-21   杂化轨道理论②1-22   价电子对互斥理论第5节 分子间力和氢键 1-23   分子间力1-24   氢键 第6节  晶体结构 1-25   晶体与非晶体1-26   晶体的内部结构1-27   晶体的基本类型1-28   实际晶体、液晶第二章 化学反应的能量   第1节  基本概念  2-1   第二章概况和基本概念第2节  热力学第一定律 2-2   热力学第一定理①2-3   热力学第一定理②第3节  焓与Hess定律 2-4   焓的定义、性质2-5   化学反应的热效应2-6   标准态与热化学方程式2-7   标准生成焓、标准燃烧焓2-8   化学反应的热效应计算 2-9   盖斯定理及其应用第4节  熵与熵变2-10   混乱度与熵2-11   熵与熵变第5节  Gibbs函数2-12   化学反应自发的判据2-13   化学反应的吉布斯函数变2-14   吉布斯函数变判据2-15   标准生成吉布斯函数变和标准反应吉布斯函数变 2-16   非标准反应吉布斯函数变第三章  化学平衡和化学反应速率 第1节  化学平衡3-1   第三章概述和理想气体及状态方程3-2   理想气体分压定理3-3   非标准态反应的ΔG3-4   化学平衡①3-5   化学平衡②3-6   多重平衡法则第2节  化学平衡系统的计算3-7   化学平衡系统的计算3-8   化学平衡的移动 第3节  化学反应速率3-9   化学反应速率3-10   元反应和质量作用定理3-11   反应级数和反应速率方程3-12  温度对化学反应速率的影响3-13  催化剂对化学反应速率的影响第四章  溶液  第1节  分散系4-1   分散系-①4-2   分散系-②第2节  溶液4-3   水溶液的特性-①4-4   水溶液的特性-②4-5   稀溶液的通性-①4-6   稀溶液的通性-②4-7   其他溶液的通性4-8   水的解离及pH值第3节  水溶液中的平衡4-9   酸碱理论4-10  一元弱酸解离平衡4-11  同离子效应 4-12  缓冲溶液 4-13  多相离子平衡4-14  沉淀的生成4-15  沉淀的溶解4-16  沉淀的转化4-17  配位平衡第五章  电化学基础 第1节  氧化-还原反应5-1   第五章概述、氧化还原反应5-2   电对5-3   氧化还原反应配平第2节  原电池5-4   原电池的组成5-5   原电池符号、电极及其分类第3节  电极电势5-6   电极电势-①5-7   电极电势-②第4节  电极电势5-8   Nernst方程5-9   原电池电动势与原电池反应的吉布斯函数变5-10   电极电势的应用第5节  电解与电化学技术5-11   电解装置与原理 5-12   电解产物的判断与电化学技术 第6节  金属的腐蚀与防护5-13   金属的腐蚀与防护",
    "C_course-v1:TsinghuaX+20740084X+2019_T1": "Linux操作系统开源的特性使得其获得越来越重要的地位，而Linux系统编程也向C++程序设计者提出了更高的要求。本课程由C/C++语言的共性与特性出发，在深入学习程序设计语言的基础上，进一步强调程序设计语言的适用性，并与Linux系统编程紧密结合，通过大力培养学习者的抽象思维能力和计算思维能力，将学习者对语言作为工具的基本认知转化为动手实践能力，完成从具象到抽象再到具象的思维能力转变。课程内容主要涵盖C++程序设计基本概念、数据组织与算法设计、程序组织、面向对象程序设计方法、泛型编程与模板库以及进程、线程、内存管理、设备驱动程序、网络等Linux系统编程核心主题。",
    "C_course-v1:FAFU+55071003+2019_T1": "寄生虫是一类对人和动物影响巨大的病原，有很多寄生虫都是人畜共患病原，可引起人和动物的寄生虫病。但很多人对这些病原及其造成的危害不甚了解。有必要开展《寄生虫与公共卫生》这门课程，向同学们介绍一些常见的寄生虫及其对人和动物的影响，进而引起人们对此类病原的认识，加强对自身的防护。本课程将向大家讲述寄生虫与公共卫生的概述、食源性寄生虫病、土源性寄生虫病、宠物源性寄生虫病以及旅游相关的寄生虫病。考核：章节测验60%+期末测验40%",
    "C_course-v1:TsinghuaX+80000522X+2019_T1": "建筑室内热环境模拟及应用课程是学习清华大学自主研发的建筑能耗模拟软件DeST（Designe’s Simulation Tool）的一门课程。计算机模拟技术已成为预测、分析和评价建筑热湿环境的主要手段，广泛应用于建筑及空气调节系统设计、运行管理、故障诊断等方面，并取得了极大的成功。本课程以DeST软件为基础，介绍如何应用建筑能耗模拟软件进行：1）建筑及空调系统辅助设计，包括围护结构优化设计、空调系统形式及分区方案设计、空气处理设备校核、冷冻站及泵站设计和输配系统设计等；2）建筑节能评估；3科研领取研究。",
    "C_course-v1:TsinghuaX+40040152X+2019_T1": "地质学与工程地质是水利工程、岩土工程、地质工程等工程类专业重要的一门专业基础课。清华大学《地质学与工程地质》主要内容包括：地质学基础和工程地质学两大部分。其中：地质学基础部分包括地球的形成与演化、常见岩石与矿物、内外动力地质作用、地质年代、地质图、地质构造等，为学生提供了扎实的地质基础知识，同时也可为地质爱好者提供地质专业基础知识；工程地质学部分包括地下水、岩土体的工程地质性质及一些专门工程地质问题分析原理与方法等，为学生提供扎实的工程地质基础与丰富的应用。我们有信心：你能领悟地质学的魅力！",
    "C_course-v1:TsinghuaX+40130653X+2019_T1": "凡存在之物，必以一定的量存在。——美国科学院院士 爱德华·李·桑代克（Whatever exists, exists in some amount—Thorndike, Edward Lee）面向物理世界的知识获取往往从测量开始。测量测试技术是信息技术的基础和源头，测控技术与仪器是信息技术的重要组成部分，是信息技术的基础关键。本课程为仪器仪表类和机械类专业重要的主干技术基础课程和专业必修课。通过测试基本理论、测试手段和测试技术等内容的学习，你能掌握：测试与检测系统的组成及基本原理；测试与检测中所获数据、信号的分析、传输与处理方法；常见物理量的测试与检测理论、方法及实验技术。本课程内容以探索传感器技术机理——揭示信息传输途径——解密信息处理方法为主线。首先，你将学习使用传感器获取信号的方法，尝试对信号进行放大、滤波和整流，以期获得更为准确、噪声更小的信号。其次，你将学习调制解调和A/D、D/A转换，尝试将获得的信号转换为易于可靠传输和计算机处理的信号形式。接着，你将学习各类信号处理的方法，尝试使用计算模块高速准确地处理测量数据、获得信息处理的结果。最后，你将学习信号输出与存储的理论和实践方法。通过该课程的学习，你将学会搭建一个真正的测试系统，同时理解测试系统的动态稳态特性。加入《测试与检测技术基础》课程，和我们一起用专业的眼光测量感知世界。",
    "C_course-v1:TsinghuaX+20240103X+2019_T1": "在清华计算机系，汇编语言程序设计通常作为本科生接触到的第一门计算机系统课程，被定位为该系列的入门课，起到“承上启下”的作用。主要的授课内容包括：（1）汇编语言与计算机系统结构、指令集初步、数制与整数表示、浮点数表示；（2）80x86计算机组织与保护模式、X86指令系统与寻址方式、C与X86汇编、X86汇编编程；（3）MIPS汇编。课程强调汇编语言的软硬件分界与桥梁作用，使得学习者能把程序的执行与计算机的工作过程紧密联系起来，以便深入地感知、理解和体会计算机的逻辑功能以及各种软件系统的原理，逐步形成软件系统功能构筑在其上，硬件系统功能运行于其下的计算机系统思维能力。",
    "C_course-v1:TsinghuaX+THU201606X+2019_T1": "近年来，人工智能技术渗透到行业的不同领域迅速增加。因此，大数据系统是实现当今数据驱动AI的基础，因此变得至关重要。本课程致力于引导学生学习大数据系统的基本概念，涵盖数据如何有效存储，处理和分析。我们从分布式系统设计的一般原则出发；然后我们提供有关如何在大数据系统中扩展存储，计算和网络功能的框架;最后，为了使这些设计原则易于遵循，我们的案例研究使用真实的工业系统来演示基本设计原则如何应用于实际系统以及如何分析其性能和限制。",
    "C_course-v1:TsinghuaX+30260032X_+2019_T1": "本课程全面介绍MEMS的基础理论、分析设计方法、制造技术、典型产品和器件，尝试通过本课程掌握微型化技术。课程内容包括基础力学与物理学、微加工技术、封装集成技术、传感器、执行器、RF MEMS、光学MEMS和BioMEMS与微流体。课程强调设计与制造相结合、前沿与基础相结合；着重提取基础、重点和共性知识，强调基础理论和制造方法在不同领域的应用，并紧密结合前沿的学术研究和工业界的产品发展动态。",
    "C_course-v1:TsinghuaX+60250101X+2019_T1": "发表高质量的学术论文和参与国际学术交流已经成为科学研究必不可少的环节及衡量学术成就的重要指标。清晰的英文表达是国际期刊和会议论文被录用的基本要求。论文投稿和修改，与编辑打交道，熟悉并遵守国际学术规则和惯例十分重要。本课程旨在指导学生如何撰写国际期刊和会议论文，介绍国际学术界的惯例和规则，讨论相关的东西方文化差异，并指导如何正确引用参考文献，尊重他人研究成果，如何参加学术活动如参加学术会议、如何当评审人及如何担任国际期刊编委、国际会议程序委员会委员等学术工作。本课程简短探讨如何选择研究课题和如何申请科研项目。",
    "C_course-v1:TsinghuaX+THU201602+2019_T1": "《创新材料学》按10条纵线介绍各类材料在半导体集成电路、微电子封装、平板显示器（包括触控屏和 3D电视）、白光LED固体照明、化学电池、太阳电池、核能利用、能量及信号转换、电磁屏蔽、环境保护等领域的应用。纵横交叉，旁及上下左右，共涉及百余个重要知识点，力图以快捷、形象的方式把读者领入材料学知识的浩瀚海洋。本课程既不是海阔天空的漫谈，也不是《材料科学基础》课程的压缩，更不是甲、乙、丙、丁开中药铺。在内容上避免深、难、偏、窄、玄，强调浅、宽、新、活、鲜。在汇集大量资料的前提下，采用图文并茂的形式，全面且简明扼要地介绍各类材料的新进展、新性能、新应用，力求深入浅出，通俗易懂。千方百计使知识新起来、动起来、活起来，做到有声有色，栩栩如生。本书可作为材料、机械、精密仪器、化工、能源、汽车、环境、微电子、计算机、物理、化学、光学等学科本科生及研究生教材，对于从事相关行业的科技工作者和工程技术人员，也具有极为难得的参考价值。",
    "C_course-v1:TsinghuaX+40260173X+2019_T1": "本课程主要从晶体管级和电路级讲授数字集成电路的分析与设计。以CMOS集成电路为主，从回顾基本的集成电路器件开始，讲述CMOS反相器、组合逻辑电路、时序逻辑电路分析设计、算术运算逻辑功能部件、互连线模型和互连线寄生效应，并介绍常用数字集成电路设计方法和流程，重点针对数字集成电路基本单元的各种电路类型，从电路结构原理及其面积、速度、功耗等方面进行分析和设计优化。",
    "C_course-v1:xuetangX+MOOC102+2019_T1": "混合式教学（Blended Learning），是指将在线学习与常规的师生面授教学相结合的学习模式，线上学生自主学习，线下师生深入互动适当的混合式教学模式，能够提高学生的学习兴趣和学习投入，提升课程的挑战度，进而有助于提高教学质量、取得更佳的教学效果。混合式教学的推广，对促进以学习者为中心的个性化教学改革，加快价值塑造、能力培养、知识传授“三位一体”的人才培养新模式实施，培养学生主动学习能力具有重要意义。本课从混合式教学的设计着眼，介绍了如何规划线上、线下教学安排、如何设计线下教学环节。来自清华大学各学科的首批混合式教学改革实践教师结合自己的教学经验，为您分享他们的经验。",
    "C_course-v1:TsinghuaX+00510888X+2019_T1": "采用“理论+案例”相结合的形式，由企业家亲自讲授创业方法或案例，教授点评。在学习中，激发学生的创业兴趣，体会远见、冒险、坚持不懈和百折不挠的创业精神；让学生掌握创业机会识别、创业企业设计、创业企业运行等创业阶段的关键要点；并能够运用理论研究、分析和解决创业各阶段遇到的问题。通过本课程的学习，学生将：理解创业的价值，迎接创业时代激发创业兴趣，塑造创业精神了解和掌握创业所需的关键知识和技能了解创业的基本阶段，掌握创业模型",
    "C_course-v1:HEBUT+20180207002+2019_T1": "本课程主要讲述水彩画技法及表现手法。其中包括水彩画简介及工具材料，水彩画写生裱纸方法，水彩画基本技法、特殊技法，水彩静物表现手法，水彩风景表现手法等。",
    "C_course-v1:MITx+15_390x_1+2019_T1": "很多看起来似乎很伟大的想法和科技在碰到一个简单、不可避免的问题时都会突然卡壳。这个问题就是：“谁是你的客户？”多年来，麻省理工学院（MIT）就这个问题不断问询学生创业者，结果很成功。MIT校友们创办的25600家公司产生的总收入是2万亿美元，提供了330万个工作岗位。如果MIT是一个国家，那么它将是世界上第十一大经济体。在你的创业旅途中，你会发现：创业中最重要的资源是客户。赶快加入MIT《创业101》课程，成为这个社区的一员吧！这就是创业，我们每一堂课都会对MIT创业者的实际案例进行专门的深入研讨，这些案例来源具有多样性，包括移动应用领域、3D打印技术、功率电子、国际化开拓和手表制造等。通过这些MIT创业者的创业案例，你会学习怎样从创意/技术到对谁会成为你的客户、为何他们愿意购买你的产品有必要的理解，特别是学习如何：1)识别未来的/潜在的客户；2)访谈未来的/潜在的客户；3)最后，为你的企业选择正确的客户。课程作业将会是面向真实的实践，通过一系列具体、实用、有效的步骤来指导你、帮助你实现创意。同时，你还会在学习过程中获得乐趣！注册后将有更多的惊喜等着你。",
    "C_course-v1:TsinghuaX+60610231_p1+2019_T1": "《工程职业伦理》主要讲授工程中的职业道德问题，培养工程专业学位研究生的工程伦理意识和分析论证能力，本课程为其通论部分。 《工程职业伦理》课程有着广泛的社会需求： 先从《华盛顿协议》谈起 1989年来自美国、英国、加拿大、爱尔兰、澳大利亚、新西兰6个国家的民间工程专业团体发起和签署《华盛顿协议》，针对国际本科工程学历资格互认，工程伦理教育被纳入工程专业教育认证的制度体系中，2016年6月2日中国成为国际本科工程学位互认协议《华盛顿协议》的正式会员。 再谈“美国注册工程师” 1996年开始，美国注册工程师考试将工程伦理纳入“工程基础”考试范围。美国国家工程院的报告指出，“伦理标准是未来工程师具备的基本素质之一”。 最重要的是培养面向未来、面向世界的中国工程师 中国当前的“一带一路”、“中国制造2025”建设，需要有跨文化、全球视野的大量工程师人才，需要工程师具备在不同文化下的工程伦理规范意识。 鉴于此，工程伦理教育受到工程界、教育界和政府相关部门的高度关注，在工程教育中全面推进工程伦理教育成为各界共识，在2015年全国工程专业学位研究生教育指导委员组织清华大学、北京理工大学、北京协和医学院、大连理工大学、浙江大学等多所院校的十几位专家合作编写了《工程伦理》教材同时录制相关的MOOC课程。 该课程不同于传统的工程伦理理论教育，突出强调了工程伦理的实践性。在具体的工程实践中，由于工程活动的复杂性和不确定性，工程师还需要培养良好的工程决策能力，既要把伦理意识和伦理规范具体落实到解决工程实践面临的伦理问题上。由此，工程伦理教育的目标除了培养工程师的工程伦理意识和责任感，引导其掌握工程伦理的基本规范，还需要通过工程伦理教育，提高工程师的工程伦理决策能力，故课程从工程职业伦理和工程实践中的伦理问题两个方面构建课程体系，课程分为“通论”（MOOC课程为《工程职业伦理》）和“分论”（MOOC课程为《工程实践与伦理决策》）两个部分。课程立足于面向中国社会、面向中国现实、面向中国未来。",
    "C_course-v1:TsinghuaX+THU00001X+2019_T1": "你是否为移动互联网时代做好了准备？你是否能看到移动互联网带来的创业创新机会？你是否找到了成为“独角兽”的机会？“真正的创业者，真正的创新者，要学会终局思考。也就是，你要敢于判断五年后的社会趋势与商业脉动。然后，站在未来看今天，很多事情就会一目了然。”创业者如何谋生存求发展？传统企业如何寻求互联网+的创新突破？如何打造出爆款产品？天使投资人如何筛选项目？如何管理你的从0到1？所有这些问题，都是你需要思考的。本门课程由沈拓老师讲授，他长期从事移动互联网商业模式的前瞻研究、企业咨询与创业投资工作，他将带领学员洞察互联网未来、破译商业模式密码，把握企业创新策略，帮你赢得加速成长。本门课程适合创业者、传统企业转型创新相关管理人员、对移动互联网感兴趣的各界人士、潜在创业者、投资界人士学习。",
    "C_course-v1:XAAU+20180411001+2019_T1": "本课程主要是对《统万城》小说中对匈奴民族的辉煌之都与神秘消失的历史描述和合理诠释，以及弘扬汉传佛典翻译大家鸠摩罗什传播文化的精神境界。本课程的主要内容包括：绪论客观简要地还原了统万城以及相关的真实历史概况，介绍了作家高建群和他的小说《统万城》的创作情况；第一章赫连勃勃家世经历，介绍匈奴末代王的出生以及其家族的遭际；第二章赫连勃勃家族复兴，介绍匈奴末代王不惜一切手段实现家族复兴的梦想；第三章赫连大夏辉煌一时，叙述了当年赫连大夏王朝的辉煌；第四章匈奴部族神秘消失，介绍了匈奴末代王赫连勃勃谜一般的消失，坚固的城池被攻破，西方的阿提拉大帝与赫连勃勃相似的经历；第五章赫连勃勃生命中的重要人物，介绍了赫连勃勃生命中最重要的三个人物，即女萨满、鲜卑莫愁、叱干阿利；第六章鸠摩炎出生入世，介绍鸠摩家族的宰相世袭的历史；第七章鸠摩炎弃相东来，阐述了鸠摩炎的理想以及鸠摩罗什神异的传说；第八章鸠摩罗什名震西域，鸠摩罗什在西域的游学、在龟兹国弘法之事；第九章鸠摩罗什东来凉州，写了龟兹国被破，鸠摩罗什随吕光入凉州，驻足十七年，此时王女一直默默地陪伴着他；第十章鸠摩罗什功成草堂，鸠摩罗什在长安受到尊崇，在草堂寺翻译佛典、授徒弘法；尾声邀请专家对《统万城》这部小说的两条线索进行梳理，以及对两条线索的关系进行点评。",
    "C_course-v1:TsinghuaX+80590952X+2019_T1": "本课程2004年起就在清华大学开设，主要面向清华研究生及本科生教学。课程将充分利用现代教学手段，让多学科背景的学习者能初步系统了解和共同研究公共危机的特点、形态、成因和后果及发生发展机理，并深入研究以政府为主的现代公共组织应对危机的有关理念、制度、干预战略策略和方式方法等。特别是通过学习，能增强危机与风险意识、熟练运用风险分析、快速决策、危机沟通与组织协调等方面的专业知识与技能来有效分析、预防与应对各类危机，从而切实提高公共危机管理的研究能力与实践能力，推动公共组织与整个社会健康有序发展。主要内容：第一讲：中国危机形态分析；第二讲：危机与危机管理要义；第三讲：中国危机管理演化；第四讲：风险评估与危机治理；第五讲：社会冲突与危机谈判；第六讲：危机决策与领导力；第七讲：危机协调与组织学习；第八讲：危机沟通与新媒体；第九讲：传统文化与危机管理；第十讲：中国城市危机管理。",
    "C_course-v1:TsinghuaX+20120143X+2019_T1": "工程制图是清华大学的核心技术基础课，在工程学科人才培养体系中占有重要地位，具有优良传统和深厚积淀。课程以现代工程应用为背景，旨在使学生掌握工程设计表达的基础知识和基本技能，是学习工程科学与技术的入门课程，也是培养空间想象能力和创新思维能力的重要载体，是学生认识工程、走进工程的桥梁。课程内容包括：点、线、面、基本体的投影规律及作图方法，轴测图及计算机辅助二维绘图和三维建模，复杂形体（截切体、相贯体、组合体）的构建及三视图，工程制图相关的国家标准，工程中常用的表达方法（多视图、剖视图、断面图、尺寸标注），标准件、常用件、零件图、装配图的绘制及相关技术要求。在投影理论的基础上，将二维视图、轴测草图、三维实体模型等典型构思及表达方法有机地结合在一起，将徒手绘图、仪器绘图与计算机绘图结合在一起，以图形表达为核心、形象思维为主线，培养学生工程设计表达的基本能力和基本素质。",
    "C_course-v1:TsinghuaX+10610193X+2019_T1": "本课程以高校思想政治理论课教材“《中国近现代史纲要》”一书为基础，讲授1840年以来中国人民抵御外来侵略、探索国家出路、争取民族独立、实现人民解放、建立新中国、建设社会主义现代化的伟大历程。本课程以在线教学讲授为主，结合大量视频和文字材料，同时辅以小组讨论等形式，力求关注研究前沿，融时代性、科学性和学术性于一体，培养学生所应具备的历史意识和时代意识，帮助学生更为深入地了解国史、国情，更为深入地了解历史和人民是怎样选择了马克思主义，选择了中国共产党，选择了社会主义道路，选择了改革开放。 ",
    "C_course-v1:TsinghuaX+10610183_2X+2019_T1": "《思想道德修养与法律基础》是一门融思想性、政治性、知识性、综合性和实践性为一体的课程。作为大学生的第一门思想政治理论课程，本课程以马克思列宁主义、毛泽东思想和中国特色社会主义理论体系为指导，传承中华优秀传统文化，借鉴人类文明的有益创造成果，围绕当代大学生在成长成才过程中面对的思想、道德、法律等问题，进行马克思主义的世界观、人生观、价值观、道德观和法律观的教育教学，帮助大学生提高思想道德素质和法律素质，成长为德智体美全面发展的社会主义事业的合格建设者和接班人。",
    "C_course-v1:TsinghuaX+10620204X+2019_T1": "本课程作为一门思想政治理论课和通识教育课程，通过系统地讲授马克思主义产生的社会历史条件、马克思主义的基本理论特征、社会作用和价值追求，讲授马克思主义理论的哲学基础、政治经济学基本规律和科学社会主义原理及其内在逻辑联系，表述马克思主义基本理论的主要内容与马克思主义的基本立场、观点和方法，从而为学生完整、准确的掌握马克思主义理论和树立正确的世界观、价值观和人生观提供理论基础。    本课程强调“教与学相结合、理论与实践相结合、线上与线下相结合”的教学理念，提倡“在比较中学习、在交流中学习、在阅读中学习、在思考中学习”的学习方法。为努力实现教学质量提升的目标，在教学中运用“基于慕课的混合式教学模式”，除了在线课程外，还开设授课教师不同、讲课形式不同、讲授内容不同的线下课程，同时辅助在线阅读、在线讨论、线下讨论课等方式，将传统以“教”为主的模式翻转为以“学”为主的模式，希望学生完成由“被动灌输”到“主动学习”的转化。",
    "C_course-v1:TsinghuaX+00690092X+2019_T1": "“逻辑”一词很常用，但作为一门学科和课程，“逻辑学”涉及的内容范围，比“逻辑”一词日常的用法范围要小得多。它的研究对象是推理，更准确地说，是“有效推理形式”。什么样的是有效推理形式？怎样判定？怎样生成？逻辑学中要给出基本的方法。   作为面向非逻辑学专业学生的逻辑学概论课，本课程的着眼点不仅仅在于讲授逻辑学中的具体内容，而更致力于使学生了解逻辑学的基本思路、准则和方法。能否和如何运用于实践，则有待于我们的共同努力。主要内容包括：中外逻辑发展简史，复合命题的推理，命题演算，性质命题的推理，关系命题的推理，谓词演算概要，归纳推理简介，非经典（非标准）逻辑初步等。",
    "C_course-v1:SCUT+SM001+2019_T1": " 企业战略管理是以提升企业战略制定、实施、评价与控制有效性和效率为研究对象，以构建、保持和发挥企业竞争优势为主要内容，以实现企业健康和持续发展为主要目的一门新兴的企业管理学科。为使学生能够在中国情境下有效掌握和应用企业战略管理的理论与方法，本课程从中国企业所嵌入的情境特征出发，以环境动态化为主要视角，系统整合全球视野与国内情境、企业战略管理的静态模式与动态模式、企业战略思维的产业组织模式与资源基础模式，系统介绍了国内外学者在企业战略管理基本理论、工具和方法上的主要成果。这门课程的主要教学目的是：让学生掌握进行企业外部环境与内部条件分析的模型、过程和方法，使他们能够面临战略决策的时候，能够全面和深入地分析企业所面临的机会、威胁、优势与劣势，并且发现自己的核心专长或者发现建立核心专长的领域；让学生把握不同层次的企业在不同环境下的战略选择、战略手段和进行战略抉择的方法，从而提高他们进行战略决策的能力；让学生熟悉战略实施的管理方法，包括如何建立合适的治理结构、组织结构、领导风格和企业文化以提高企业战略实施能力。 ",
    "C_course-v1:TsinghuaX+44100343X+2019_T1": "本课程为《Web前端攻城狮》系列课程的基础篇，涵盖了Web前端编程的基础知识和核心技能，包括HTML与CSS、HTML5、CSS3、Javascript、jQuery、ES6、NodeJS等。选修后请加老师微信号simbasong007（注明来自学堂在线前端课），领取相关的课件和源码资料，还可加入课程专属微信讨论群。",
    "C_course-v1:TsinghuaX+10610224X+2019_T1": "本课程为思想政治理论课。课程以“历史与理论相结合、思想与现实相结合、线上与线下相结合、高雅与通俗相结合”为特色，讲授马克思主义中国化、毛泽东思想、社会主义初级阶段理论和基本路线、社会主义本质理论、社会主义改革开放理论、建设中国特色社会主义的总布局、根本目的、依靠力量、领导核心等专题，引导学生正确把握毛泽东思想和中国特色社会主义理论体系的基本内容和精神实质，引导学生深刻认识改革开放的必要性、可能性和艰巨性，引导学生牢固树立中国特色社会主义的道路自信、理论自信、制度自信和文化自信。   本课程实施“转客为主”教学模式，即通过设置多重教学环节引导学生由“教学对象”向“教学主体”转化，由“被动性学习”向“主动性学习”转化，由“以听为主”向“听说读写行并重”转化。课程鼓励和引导学生实现“六化”： 一是“化耳为口”，即不仅要听，而且要说；二是“化目为手”，即不仅要读，而且要写；三是“化知为行”，即不仅要求知，而且要践行；四是“化外为内”，即将外在的知识转化为内在的素养；五是“化隐为显”，即将隐性的素质转化为显性的成果；六是“化人为己”，即将他人的素养转化为学生自我的素养。",
    "C_course-v1:TsinghuaX+30640014X+2019_T1": "语言最重要的功能就是交流。在交流中我们要知道如何开始一个对方感兴趣的话题，回答别人的提问，自然、流畅地完成一个对话。本课程选取了8个主题，由50多位来自美国、英国、加拿大、澳大利亚、哥伦比亚、中国的老师及各个年龄段的学生，在真实的场景中，用最地道的表达和最纯正的英语，带你谈论日常生活、学习的方方面面。本课程分为八个单元，每个单元有一个主题，分别是：1、个人信息的介绍与交换2、我们的家人和朋友3、饮食与用餐4、英语学习的目的和方法5、假日活动和难忘的经历6、兴趣爱好7、情感表达8、保持健康每个主题由十余组对话和小组讨论，外籍老师的中西方文化差异介绍，中国老师的重点词汇、句型讲解，听力理解练习和口语测试构成。通过学习和练习，你将可以和讲英语的朋友们自如地交谈、讨论与主题相关的任何问题。本课程的学习方法有很多。英语学习者可以在反复地听和跟读对话的过程中，不断积累语言素材，和你身边的朋友或同课程的学习者进行对话练习；英语教师可以选用本课程中适合的主题，组织学生进行听说训练，组织高效课堂。也许你不能理解每段对话的全部内容，只需听懂大意，随着课程的进展，你听懂的内容会越来越多。让我们一起实现一次英语听说的飞跃吧。本门课程在制作过程中得到了香港伟新教育基金和Google公司的资助，特此鸣谢。",
    "C_course-v1:TsinghuaX+90640012X_1+2019_T1": "语言作为一种载体，渗透在不同学科的学术研究中。掌握学科专业词汇，并且流畅自如地介绍领域学术研究，对于学术研究者来说是必备的一种能力。本课程邀请了来自清华大学不同专业的学生，带领大家一起走进不同学科的英语世界。本课程基于《通用学术英语》的八个单元编写的。8个研究主题，涵盖了文化、生命科学、艺术、自然、社会、技术与工程、心理学、经济与管理几个学科，对应了心理学、机械、人文、电子、能源、建筑、美术、金融等大学常见学科。 这门课程中既有课文的词汇和长难句分析， 通过上下文分析这些词和句子的用法，也有来自美国和英国的外教会讲解学术英语的学习策略。通过清华学生和大家分享他们对课文主题的见解，我们希望帮助大家了解中外不同的世界观、价值观、思维方式等方面的差异，培养学生的跨文化意识，提高学生社会语言能力和跨文化交际能力，使他们能够在日常生活和学习中使用英语进行有效的交流。每个单元中教师的讲解也是模拟小班课的研讨，更多的是国际助教和学生的小组主题研讨、老师主导的专题讨论课和学术微沙龙等模块构成。主题研究部分为来自不同专业的博士研究生、小班课是英语专业本科生和外教的答疑课；各学科最新、最时髦的研究动态是通过国际留学生负责，内容生动有趣；小组主题研讨部分模拟国际学术报告场景，针对主题研究作进一步探讨；情景对话部分在真实生活场景中对主题研究进行演绎，贴近生活；词汇讲解部分涵盖了学术词汇和专业词汇，丰富大家的词汇库；为了提高研究者的科技论文写作能力，我们还设置了学术写作模块，由老师为大家精心讲解学术写作常用方法和技巧。让我们一起感受不同学科中英语的魅力吧！",
    "C_course-v1:TsinghuaX+90640012X+2019_T1": "作为一门语言非常重要的两个方面，阅读可以让我们获取丰富的知识，写作可以让我们表达内心的思想。掌握正确的阅读技巧和写作技巧，能够让我们更好地获取信息和表达信息。本课程由中外教师及清华学生带领大家在真实的生活场景中畅游英语世界。本课程从学习、大学、文化、城市、教育、行为论、人际交流和人生的意义等八个主题展开，每个主题由主题课文（两篇）、重点词句讲解、阅读技巧讲解、嘉宾访谈、作文批改和写作技巧讲解、英语学习方法介绍、文学赏析等模块构成。主题课文模块围绕精心挑选的主题展开，带你体验丰富多彩的文化，拓宽视野，同时配有相应的重点词句讲解，让你的英语知识库更庞大；阅读技巧模块以师生互动的形式展开，由老师和英语专业研究生带大家从学习者的角度一起探讨英语阅读的秘诀所在；嘉宾访谈模块邀请了三位嘉宾老师，分别在学习、文化等方面进行了介绍和分享；写作部分包括作文批改和写作技巧讲解，选取与主题相关的四六级作文考题，并各配以两篇学生真实写作案例，通过批改作文的形式讲解写作技巧；英语学习方法模块以访谈形式展开，由留学生助教为大家分享英语学习经验；文学赏析模块精选了八篇文学名著，让学习者在师生互动中遨游文学的海洋。    和我们一起感受语言的魅力，让我们一起实现一次英语读写的飞跃！",
    "C_course-v1:LUIBE+2018030701+2019_T1": "本门课程以元认知心理干预技术的视角，科学地解释了大学生常见的心理问题与心理障碍，以及天才灵感状态与优秀人格的心理结构，提升大学生对潜意识心理过程的自我认知、监督、反思与调控能力，即元认知智慧。从而切实提高大学生心理健康教育的实效性。 ",
    "C_course-v1:TsinghuaX+01030132X+2019_T1": "人类没有大学，世界将会怎样？怎样解决问题取决于怎样提出问题。这个规律尤其适合我们探索大学的本质、起源、演进和前景。无论你上着、上了还是要上大学，你可好奇“大学”从哪里来、到哪里去？一代又一代“大学人”如何学习、生活和生存？大学到底是什么？大学是常维新的。你可感受到，你和这门课程是多么独特的存在？在此你可以无处不在地学习、享有各类课程资源，你还可以随时随地与老师和来自天南海北的同学沟通研讨。这可是“有教无类”，可是“海内存知己，天涯若比邻”？这种教和学的模式是大学的未来吗？或者，通过数码在线，我们终于回到了过去？千年的大学可拥有共同的目标、共同的方法、共同的群体、共同的未来？你不是一个人，你是古今中外“大学人”共同体中的一员，你本已具有、但尚需明晰你的身份特征和大学赋予你的使命、责任和权益。大学真是个伟大的存在，不然它怎能在地球上千年长存？当今大学的普遍存在仿佛是势所必然、理所应当。真是这样吗？我们不能忽视大学屹立于世的伟大，不能忽视大学在怎样的坚守与变革中才奋斗到了今天。开卷有益、以史为鉴。这是一门中西方教育文化的探索发现课，又是一门自省自强课。诚邀你与我们共渡一段充实又愉快的学习之旅。",
    "C_course-v1:TsinghuaX+80160283+2019_T1": "瓦特看到水蒸汽顶起壶盖，发明了蒸汽机；牛顿被苹果砸中，发现了万有引力定律。长久以来，人们一直迷信于成功的新产品创意来源于冥冥之中的灵光一现。但是，每一项造福人类的重大发明，都是很多人花费数年心血，经历了无数次失败，最终才脱颖而出的技术方案。如何融入技术开发的团队，发掘顾客对产品的真正需求，如何创成一种有竞争力的产品概念，并且确保新产品能够低成本、高质量的制造出来，这些都将是我们面对的挑战。这门课程将告诉大家如何发掘市场机遇，如何不给潜在的竞争对手留下生存空间，如何权衡产品的成熟度和上市时机，如何保护自己的知识产权，带领大家走上系统化设计与开发产品的快车道。",
    "C_course-v1:HEBNU+20180621001+2019_T1": "《高频电子线路》是电子信息工程、通信工程等电子信息类专业重要的专业基础课程，具有很强的理论性、工程性与实践性。本MOOC 由绪论、高频电路基础、高频小信号放大器、高频功率放大器、正弦波振荡器、振幅调制与解调及混频电路、角度调制与解调电路、反馈控制电路等8章组成。  本MOOC通过57个微视频（平均时长7分钟）再现教学之精华。同时在学堂在线平台上，还为学习者提供了教学PPT、随堂测验、单元作业和网上答疑等互动学习体验环节。相信学习者通过“课程视频、同步教材、学习平台”三位一体的学习套餐，会逐步适应和喜欢本课程的。 ",
    "C_course-v1:TsinghuaX+02070251X+2019_T1": "职业的选择与发展是人生的重要主题之一。对于大学生而言，第一份职业的选择并不是一件容易的事，需要经历长时间的职业探索和自我探索，学习有关决策的思维和技术，学习适应自身和外界的快速变化，学习平衡理想与现实，工作与生活的多重角色，掌握求职技巧，并在不断的实践中验证、修订或者更改自己的职业目标。可以说，职业的探索与选择不仅是毕业生的紧急任务，也是普通大学生在学期间的重要任务之一。职业的选择不仅仅是找到一份工作，也是个人在与职业环境的互动中，更加知道“我”想成为一个什么样的人，并且努力完成一系列生涯任务的生命历程。",
    "C_course-v1:TsinghuaX+80590982X+2019_T1": "本课程是公共管理学科的前沿性课程。近年来，全球兴起了一股社会创新的浪潮，本课程通过系统介绍社会创新与社会企业家精神的基础理论、社会创新的发展阶段、工具方法、生态环境与实践知识，增进同学们对社会创新前沿领域的了解，拓展学生的视野和思维。同时，通过学习，让不同背景的学生更深入理解自己在社会创新中的角色。我们有理由相信，当今世界，人类所面临的社会问题能否得到有效解决，最关键的是人，是具有社会企业家精神的人。这就需要同学们掌握公共管理的新理论、新方法、新知识，培养自己的社会企业家精神。只有这样，我们生存的社会环境才会更美好，人类的福祉与文明才能不断提升。",
    "C_course-v1:CQU+2017121401X+2019_T1": "结构力学系列课程是以土木工程专业为主、面向大土木类专业（包括建筑学与城市规划专业、给水排水专业、工程管理专业、建筑材料专业等）本科生的必修专业基础课程，是衔接先修的高等数学、理论力学、材料力学等基础课和后续混凝土、钢结构原理及设计等专业课的重要课程，具有基础理论与工程应用的双重特点，是奠定学生基础力学知识与工程专业技能的重要课程。",
    "C_course-v1:TsinghuaX+00690342X+2019_T1": "本课程面向各专业本科生，通过课堂讲授与课外阅读讨论的方法，把握古希腊罗马哲学家丰富的思想，探讨哲学精神的起源，揭示古希腊民族的精神取向，阐明古希腊民族思维方式的特征，帮助学生把握哲学的基本精神，养成理论思维的能力，培养高尚的情操，提高人文素质。第1讲   导论一：哲学、宗教与文化          1.1:哲学          1.2：宗教          1.3：文化第2讲   导论二：希腊哲学概览          2.1；希腊哲学的生存环境          2.2：希腊哲学的发展阶段          2.3：分期、流派与著述第3讲   求是——理性精神的萌发          3.1：“是”的基本内涵          3.2：向理性思维过渡          3.3：对古代思想家思维方式的分析第4讲   求本——本体论、形上学          4.1：相关词语解释          4.2：寻求本原          4.3：柏拉图寻求本性          4.3：亚里士多德寻求本体第5讲   求知——古代知识论          5.1：相关词语释义          5.2：柏拉图论知识          5.3：西塞罗论知识          5.4：奥古斯丁论知识第6讲   求真——方法论、逻辑学          6.1：相关语词释义          6.2：柏拉图的辩证法          6.3：亚里士多德的逻辑学第7讲   求实——科学精神          7.1：相关词语释义          7.2：科学的起源和发展          7.3：科学的实用化与技术化第8讲   求美——爱的礼赞          8.1：相关词语解释第9讲   求善——伦理思想第10讲  求仁——人文主义第11讲  求义——正义论第12讲  求礼——国家与法制第13讲  求福——宗教的寻求第14讲  求圣——与神合一第15讲  总结：希腊哲学的基本精神",
    "C_course-v1:BFU+15012510+2019_T1": "本在线课程的主要内容是教授现代日语语法。课程根据学习者实际交际的需要，把日语语法分为多个不同的专题（本课程共有10个专题单元），由浅入深、循序渐进，集中地进行日语语法教学。同时，辅以日本文化介绍、难点分析、近义语法辨析、实用情景会话、习题练习等，丰富课程内容，拓展课程深度，学习和实践并重，让语法教学变得更加立体和有趣。本课程的优点是特色鲜明、重点突出。不介绍日本文字、日语五十音图等入门知识，而是直接从交际功能出发分类，集中讲授现代日语语法。单元编排考虑到学习者使用语言交际的不同需要，由浅入深，分类型、分步骤介绍从基础阶段起步的现代日语语法。同时，为了让学习者的学习不局限于语言和语法，课程中还特意加入了内容丰富的日本文化系列讲座，帮助学习者拓宽视野、丰富知识，更好地了解语言背后的文化，提高学习者对日语和日本文化，以及中日异同等问题的认识。本课程不涉及初级日语语音教学和与语法及日本文化无关的日语词汇的教学。 学语法，让你的日语更美妙！一起来当日语学霸！",
    "C_course-v1:BFU+15023710+2019_T1": "中国五千年的传统文化、药食同源的独特理念、绿色食品热潮的全球兴起，使山野菜正成为极具竞争潜力的国际性商品。在生存逆境，多认识一种山野菜，就多一 份存活的希望；在欠发达地区，开发一种山野菜，就有可能搞活一方经济。   本课程分为总论和各论两部分。  总论介绍了我国“药食同源”思想以及山野菜学的形成与发展、山野菜资源特点、古今地域分布、营养保健、绿色食品生产以及保藏与加工的综合开发利用技术等，如何正确开发利用山野菜，保持山野菜的可持续发展等内容。  尤其是在各论中选择了从林下山野菜资源蕨菜、薇菜到全国广泛分布的全草山野菜资源蒲公英、苦菜、鱼腥草等，从以花为食用部位的黄花菜、以果实为食用部位的枸杞到以根为食用部位的桔梗与葛；从沿海滩涂耐盐的盐生植物碱蓬到西北耐旱、耐寒、防风固沙的落叶灌木沙棘，从芳香植物艾蒿到兼顾菜用资源、油脂资源和色素资源的紫苏等山野菜，全面而系统地揭示每种山野菜的生物学特性、营养成分与药用成分、药理学研究与临床应用等；特别是在营养价值、药用价值、工业价值、园林观赏价值等等的综合开发利用方面进行了详细阐述。此外，本课程十分关注山野菜的文化与古今故事，增加了课程的趣味性。",
    "C_course-v1:TsinghuaX+TSINGHUA107+2019_T1": "“人文清华”邀集清华大学最优秀的人文社科学者，阐述经典学说、独特思考和重大发现。选课同学听名师主题演讲，观看学术对谈，在助教带领下精读大师著作，完成课堂讨论与课程作业。 本学期暂定推出七位著名学者的课程，分别是著名作家格非，国学家陈来，社会学家李强，伦理学家万俊人，历史学家彭林，思想史家、文学史家汪晖，科幻作家郝景芳。每位学者一个单元，共7个单元，均包含以下内容： 1、 授课1：听学者讲座，深入探究本学科的一个重要问题； 2、 授课2：长篇访谈视频，呈现该学者的学术研究概貌和思想脉络； 3、 课外阅读：由每位学者的博士生带领阅读一本经典著作； 4、 课堂讨论：由每位学者的博士生组织并带领专题讨论；",
    "C_course-v1:TsinghuaX+80000271X+2019_T1": "我国每年都在建设大量的居住建筑，住宅设计是建筑师的基本功。随着人们对生活水平与居住质量要求的逐步提升，住宅设计正向精细化、人性化方向发展。基于此，本课程将从以下问题出发，深入浅出地带大家了解住宅精细化设计的各个方面：我国住宅设计是经历了哪几个发展阶段？室内装修中有哪些常犯的错误？怎样才能使住宅更加舒适、实用？户型优化设计该从哪里入手？住区的规划与设计中有哪些人性化设计要点？国外住宅设计有哪些值得借鉴的理念与做法？住宅的未来发展趋势是什么？无论你是设计专业的学生、建筑师、地产工作者，还是热爱生活的普通人，都能通过本门课程的学习，对住宅有更深的理解与认识、掌握精细化设计的理论与方法，从而体味“源于生活、高于生活”的居住艺术。",
    "C_course-v1:TsinghuaX+00690302_2+2019_T1": "作为《原来姹紫嫣红开遍——昆曲艺术欣赏》课程的后续，本课程将集中介绍昆曲经典剧目中目前舞台上较常见的《牡丹亭》、《长生殿》等十部本戏，《浣纱记·寄子》、《天下乐·嫁妹》等二十出折子戏。 对于每个剧目，课程将分别介绍其原作者、剧情梗概、主要人物、常演选折、角色行当、艺术特色、常见版本等，以帮助观剧者更好地欣赏这些剧目。 ",
    "C_course-v1:TsinghuaX+Grasshopper101+2019_T1": "本课程是与清华建筑学院本科二年级“CAAD实习”相配套的在线学习内容。“CAAD实习”课为期一周，全周上课，是建筑学院的建筑学、城市规划、风景园林专业本科生必修的实习课，学生人数约120人。本在线课程是“CAAD实习”课的第一部分，为Grasshopper编程方法的教学。使用参数化的方法做设计，就是将编写程序的思维引入设计中，使用算法逻辑来生成几何形体。这样一种设计方法可以将设计中的形态、功能和构造的逻辑通过算法来描述，不仅拓展了建筑师对形式的操控能力，也使得设计更为理性，更具适应性。Grasshopper是一个受到广泛应用的参数化设计平台，它在Rhinoceros三维建模软件之上，基于Nurbs和Mesh等几何建模系统进行参数化建模的编程。Grasshopper采用了图形化编程的方法，很多常用算法都被封装在模块中，并在图形化的界面中进行组合，因此编写简便，且效率很高，非常适合设计人员学习与应用。此外，Grasshopper作为一个参数化设计平台，有众多插件可以将不同的几何建模、物理模拟、性能优化的算法引入其系统，拓展其功能，而且这些插件还在快速增长中。因此，Grasshopper是一个在方案创作和日常设计工作中都非常有价值的工具，值得每一个设计人员学习。本课程内容包括：1. 参数化设计简介2. Grasshopper简介3. 基本数据类型4. 数据结构（一）5. Nurbs曲线与曲面建模6. 数据结构（二）7. 建模技巧8. Mesh建模9. Kangaroo物理模拟",
    "C_course-v1:TsinghuaX+20320074X+2019_T1": "本课程课程要求学生具备C语言编程基础，在课程中逐步讲解ARM微控制器（单片机）与嵌入式系统，面向实践安排教学，鼓励动手实践和自由创新，适合想参与科技活动的本科生和爱好者。   传统上的本科教学，在学习嵌入式系统前要求较多的先修课程和基础知识，安排在本科高年级。但实际上，微控制器与嵌入式系统技术，很适合于开始尝试挑战各种课外科技活动和竞赛的低年级本科同学，是初次尝试设计与创新时一个很有力的工具和敲门砖。  ARM Cortex M构架的32位微控制器外围接口丰富、片内资源适中，能够实现大多数常用功能；同时，ARM Cotex M的32位内核构架则相对简练易学，容易从整体上理解和把握，适合低年级同学上手学习。本课程介绍微控制器开发的基本方法和流程；同时以全国大学生智能车竞赛采用的32位微控制器为例，讲解微控制器与嵌入式应用开发的一般方法，让学生能尽快将一个微控制器的基本系统跑起来，动手实现自己的创意，进而参加诸如挑战杯、全国大学生智能车竞赛等各类科技活动。 ",
    "C_course-v1:TsinghuaX+34000312X+2019_T1": "寄生虫病遍及全世界，尤其是处在热带和亚热带地区的发展中国家，寄生虫病的发病率和死亡率均很高，对人类健康危害很大，并严重影响社会和经济的发展。许多寄生虫病如：血吸虫病、钩虫病、蛲虫病、绦虫病、广州管圆线虫病、疟疾等在我国仍然十分常见。医学寄生虫学是研究与医学相关的寄生虫及其所致疾病的科学，其研究对象全部为无脊椎动物，包括医学原虫、医学蠕虫和医学节肢动物三大类。它的研究范围包括两个方面，一是研究医学寄生虫本身的形态结构、生命活动、生理生化、与宿主关系等，另一方面又研究寄生虫病的致病机理、临床表现、诊断治疗和预防流行，因此是一门基础联系临床的桥梁课程。",
    "C_course-v1:CSU+20180920X+2019_T1": "本课程是面对医学各专业硕士研究生开设的一门学科基础必修课，每年暑假及秋季授课。2017年暑假加秋季上课人数近千人，前后分九个大班级授课。内容主要涉及临床流行病学简介、流行病学测量、临床流行病学研究设计、诊断试验、分析性研究、临床试验、疾病预后研究与评价、病因学研究、临床决策分析及临床经济学评价等，授课主要采用多媒体教学，突出理论联系实际，通过问题导入、理论及方法学介绍、课堂讨论等多种形式，引导学生掌握临床流行病学的基本原理和方法，提高学生根据所学的原理和方法分析解决临床实际问题的能力，是一门将流行病学方法学与临床工作和科研结合起来的一门实用性课程，学生对该课程反响良好。但是也存在大班上课，学生人数太多，师生沟通交流不充分的问题。所以该课程更适合学生在慕课平台上学习，我们大课上可以充分讨论和互动，促进交流，加深理解，让学生真正能够学以致用，解决临床科研及工作中的实际问题。",
    "C_course-v1:XYSFXY+20181024X+2019_T1": "你想知道跨文化交流的秘密吗？你想知道跨文化语言交流中的秘密吗？你想知道跨文化非语言交流的秘密吗？你想知道跨文化人际交往中的秘密吗？你想知道跨文化交流中存在哪些问题吗？你想破解跨文化交流的秘密吗？你想知道为什么不同文化中的人用不同的方式交流吗？   随着经济全球化、世界一体化进程的加快，互联网、智能手机、便捷交通、聊天app、现代科技等的普及，越来越多的人参与到跨文化交流的过程中来。不管是在工作、学习、交流、合作，还是在吃饭、穿衣、购物、出行、交友、恋爱等方面，我们不经意间就参与了跨文化交流。然而，实际的跨文化交流并不那么顺利，除了接触异文化的新奇、兴奋，更多是跨文化交流中的误解、无助、冲突、障碍。为了帮助你更好地进行跨文化交流，为了提高你的国际购物、交友、谈判、合作等的成功率，为了让你走出国门面对异域文化时多份从容和淡定，为了帮助你成为一个成功的跨文化交流使者，我们精心为你准备了《教育环境中跨文化交流的秘密》这门课程。   这门课程共包括5个模块，8个单元，29个专题。我们按照发现问题、分析问题、解决问题的思路筛选了五个模块的内容。模块一是理论基础，旨在介绍跨文化交流的基本知识。模块二是描述现象，旨在揭示跨文化交流中的各种“秘密”。模块三是发现问题，旨在搜罗跨文化交流中潜在的各种问题，模块四是分析原因，旨在探寻跨文化交流中各种问题的出现原因，模块五是提供对策，旨在破解跨文化交流中的各种“秘密”。其中模块一就是第一单元跨文化交流的基本知识。模块二包括第二、第三、第四三个单元，我们从语言交流、非语言交流、人际交往三个方面介绍跨文化交流中的“秘密”。模块三是第五单元跨文化交流中的问题。模块四包括第六、第七两个单元，分别从文化和价值观层面探寻跨文化交流中出现问题的原因。模块五是第八单元，在发现问题、分析问题的基础上，提供对策，提高跨文化交流的能力。",
    "C_course-v1:PPSUC+2017052301+2019_T1": "随着我国高等教育的迅速发展，高校招生规模不断扩大，校园社会化趋势日益凸显。但目前大学治安问题也十分突出，大学生违法犯罪和人身财产安全等案件数量明显上升，这些都严重妨碍了大学生的健康成长，危机了现代化建设人才的培养。    大学生正处于人生的黄金季节，肩负着重大的历史使命，不仅要学习现代科技知识，还要注意自己综合素质的全面提高，使自己成长为一个报效祖国、服务人民的人才。这一目标的顺利实现必然要以安全作为保障。掌握必要的安全知识，增强安全法制观念，具有较强的安全防范能力，也正是大学生综合素质水平提高的总体体现。 ",
    "C_course-v1:ZUEL+20181108X+2019_T1": "《互联网企业估值》慕课课程内容一共6章，分别由汪海粟教授、文豪教授、梅丽霞副教授、张世如副教授、魏永长博士和陈方宇博士联袂讲授，每周一上线一章内容，平均学习时间3-5小时。要求学习者具备一定的经济学/管理学/会计学/金融学/财务分析/资产评估/证券投资等专业知识基础。本课程有助于学习者更加深刻地理解中国经济发展的实质，产权清晰的涵义，企业增长的源泉，资本市场的意义，以及企业内部各种有形资产和无形资产的价值评估方法，进而为未来的职业发展打下扎实的专业基础。课程主要章节内容如下：第一章 导论（互联网企业估值的背景）第二章 互联网企业估值的原理第三章 企业价值评估的基本方法第四章 互联网企业估值的典型案例分析第五章 独角兽企业估值专题分析第六章 互联网企业估值与中国创业板观察",
    "C_course-v1:TsinghuaX+70800232X+2019_T1": "课程力求达到三个层面的目标：1、在思维层面，要意识到存在思维局限与禁锢，促其质疑、突破既定的形式与限定的概念，明确逻辑与跳跃性思维同样重要。2、在知识与认识层面：比较东西方具有代表性的设计思维与方法论，大知识量大信息量的开拓视野。3、在能力培养层面：使学生能够利用所学更加主动的面对设计命题，培养其应变反映能力、分析判断能力、综合思考能力、研究转化创造等能力。课程内容：1、理论讲授：包括对于“设计”概念定义；“设计思维与方法”的历史发展脉络分析；针对规则及系统程序的“格律设计观”；艺术工学与设计几何学；图解思考方法的讲解与训练，包含头脑风暴、曼陀罗法、思维导图等；研究型设计的方法；设计心理学、传播学等设计理论；分析法的介绍与训练，包括回溯法、演绎法等；设计管理与规划等内容。2、课后作业：设定主题定向信息收集、概念分析、方法总结、结合实际设计主题进行实验性再设计。3、课程讲授关键点：(1)设计思维中的理性与感性、逻辑思维与跳跃思维(2)研究型的设计(3)格律设计观——针对规则设计方法(4)系统设计思维与方法(5)跨学科与跨领域的设计思维与方法",
    "C_course-v1:TsinghuaX+70240183x_1+2019_T1": "众所周知，几何学的历史至少可追述至古希腊时代，但不同人对“计算几何”的理解却不尽相同。本课程讨论的计算几何，源自于古典离散/组合几何学与现代计算机科学的结合。M. I. Shamos在1978年完成的博士论文，标志着这个学科分支的诞生。从那时起，“计算几何”往往特指针对离散与组合几何结构的算法研究。简而言之，她也可认为是算法设计与分析的几何版。本课程的教学目标有三：其一、对计算几何理论的总体认识，在日后的研究工作中，这种认识为你提供几何的视角其次、对几何问题求解范式及策略的全面领会，包括递增式构造、平面扫描、分而治之、分层化、近似以及随机化等最后、对基本几何结构及其算法的透彻掌握，包括凸包、多边形细分、Voronoi图、Delaunay三角剖分，以及几何求交、点定位、范围查找、截窗查询等",
    "C_course-v1:NBCCx+NBCC000502+2019_T1": "比较是人类认识事物、研究事物的一种基本方法，也是语言学研究的一种基本方法；而对比则侧重于不同之处的比较，自从有语言研究就有了语言之间的比较。只有比较才能看出各种语文表现法的共同之点和特殊之点。通过英汉文字的起源、演变，英汉人名取名民俗，英汉商标的历史演变，标点，地名翻译等方面日常而实用的跨文化语言现象进行比较，激发学习者的兴趣；还有通过对当下生成流行“热词”的缩略词，词根和根词，词缀等构词法的探析让学习者对英汉语言的认识更全面，从源头分析词根、词缀和词形变化，进一步促进英汉语的学习，提升语言的运用和鉴赏能力。在内容上能够做到通俗易懂，在形式上为学习者喜闻乐见，易于传播，易于接受。",
    "C_course-v1:ZUELX+B0601353+2019_T1": "你想成为优秀的管理者吗？你在为如何激励员工而烦恼吗？你想有效管控下属行为吗？你在为如何打造一支高绩效团队而发愁吗？欢迎来到《组织行为学》MOOC课堂，王淑红副教授将以清晰的逻辑、生动的案例、风趣的语言带你来一段“烧脑”之旅，一起来解开管理情境中员工行为背后的密码！",
    "C_course-v1:TsinghuaX+80611322X+2019_T1": "教育给了我们第二次生命，教育让我们成为自己。在漫长的十数载教育历程中，你是否想过教育给了你什么；站在人生的十字路口，你如何做出选择？对于教育，我们都有太多话要说。    但是，经验不等同于知识，观点需要数据的支撑，如何用教育社会学的专业研究和理论解释教育现象，如何从社会的角度分析教育问题？    教育社会学这门课程围绕教育与社会流动、教育体系的社会学分析、以及全球化和教育变革三大部分，讲述人类知识的演化、社会分析的概念体系、教育社会学的学科性、社会不平等与分层、教育与社会流动、性别与教育平等、班级社会学、学校组织社会学、教师的职业社会学分析、全球化与中国教育变革共十讲的内容。    每一讲都以热门话题为引，话题中代入了你的故事，回应你对世界的好奇和质疑，安抚你成长的困惑和阵痛。术业有专攻，本课程诚邀你与清华师生共渡一段充实又愉快的学习之旅，从而帮助你构建积极自我，确立最佳教育策略。 ",
    "C_course-v1:CQU+MATH20041X+2019_T1": "  这个世界充满了许多不确定性，比如，你开车上班的路上可能遇到几盏红灯，新买的手机能正常使用几年，一个地区一年中会遇到几次的暴风雨，等等。这个世界同样充满了各种数据，比如，通讯数据，电子商务数据，金融数据等等。这门课程就是引导你学习概率建模、统计推断、数据分析和科学预测等原理和方法，是你今后进一步学习现代统计方法和软件的起点。 这门课程让你结合实际案例学会概率论的基本概念、演算和推理，课程还介绍参数估计，假设检验，回归分析等初等统计方法，还包括各种社会、经济、工程等背景的应用案例以及软件操作。通过本课程，你将受到较好的统计建模、概率计算和数据分析的训练，培养科学的决策思维，会让你将概率论与数理统计中所学的原理和方法应用于现实生活或科研工作中。   你只需要具备初等的微积分知识，就可以开始本课程的学习。课程提供了在线帮助和测验，课外作业，讨论题以及工程背景的应用题目。希望你通过本课程的学习，你的统计建模能力和创新能力有所提高。",
    "C_course-v1:TsinghuaX+64100033X+2019_T1": "通过本课程学习，了解大数据管理的工具平台、开发环境、基本原理，熟悉典型大数据工具与平台的特性，掌握大数据处理的基本开发方式。在介绍典型系统工具使用的基础上，通过分析其实现原理与设计理论，增强学生大数据工具与平台的应用与开发能力，同时也为有志于继续深入学习大数据专业课程的学生创造基础 。具体课程内容包括：绪论，云计算，文件存储，计算框架，内存计算，NoSQL，流数据处理等。",
    "C_course-v1:CUC+119511+2019_T1": "本课程从音乐的构成基本要素出发，对音乐特点进行了几乎“零基础要求”的讲述，有大量的现场示范，并结合音乐在电影中的应用，对“故事世界”的音乐特点进行了总结和归纳，从影像到音乐，再从音乐到影像，对音乐诸多影像化的表现手段进行了探索。教师通过Coursera慕课平台完成《DevelopingYour Musicianship》、《Introduction to Music Production》、《Songwriting》等课程学习，获得伯克利音乐学院的认证，将课程形式在国内课程完成转化。",
    "C_course-v1:TsinghuaX+80150193X+2019_T1": "汽车碰撞安全性设计和分析是汽车工程设计中的一个重要部分。汽车产品具有良好的碰撞安全性能，不仅是法规和市场准入的基本要求，也是竞争市场的重要途径。减少道路交通事故伤亡具有重要的社会和经济意义。汽车碰撞安全技术是核心技术，具有综合性和挑战性。本课程系统介绍汽车碰撞安全的基本原理、设计理念和方法以及相关的前沿技术。本课程的英文版获得“清华大学精品课程”称号，并入选教育部来华留学英语授课品牌课程。课程主要内容包括：第一单元 碰撞响应及碰撞性能评价第1讲：绪论 – 汽车碰撞安全的基本面第2讲：汽车前碰撞结构响应与乘员乘降 – 汽车碰撞安全最基础的理论知识第3讲：汽车碰撞事故中的人体碰撞响应与损伤 – 碰撞保护设计的出发点第4讲：汽车碰撞安全性评价方法 – 汽车碰撞安全性能的考卷第二单元 乘员约束系统第5讲：汽车座椅安全带与气囊 – 有效的碰撞安全保护装置第6讲：作为碰撞保护装置的汽车座椅 – 碰撞保护的支撑基础置第7讲：儿童乘员碰撞保护 – 不难理解的特殊性第8讲：自适应乘员约束系统 – 针对个体和碰撞工况差异性的保护第三单元 汽车结构与乘员载荷高度关联的工况第9讲：汽车侧面碰撞保护 – 有限空间和时间内的资源优化第10讲：乘员头碰撞保护 – 基于力学模型和分析的设计创新案例第11讲：行人碰撞保护 –  协调造型、总布置和车身结构的设计第四单元 冲击载荷下结构和材料的设计与分析第12讲：汽车结构件的碰撞力学设计和分析 – 比拼力学功底第13讲：汽车材料的冲击力学行为表征和仿真– 保证仿真结果可靠性的基础第14讲：汽车轻量化和小型化与碰撞安全性 – 个体和整体的博弈与平衡第15讲：小型电动车与电池的碰撞安全研究 –研究案例",
    "C_course-v1:SEU+00690803+2019_T1": "东南大学以王步高教授主持的大学国文（亦名：大学语文）课程，是同类课程中首门国家精品课程，目前升级为国家资源共享课，其“大学语文教学改革的理论与实践”获2005年国家教学成果二等奖，与课程配套王步高主编的《大学语文》教材，系国家“十五”、“十一五”、“十二五”规划教材，2001年，即获国家优秀教材二等奖，并有精美的课程网站、系列课件与之配套。东南大学大学语文对全国同行长期起着引导与示范作用。2009年起王步高教授又将本课程开进清华大学，是全校学生最欢迎的课程之一。大学语文moocs课，与王步高教授主编的《大学语文》国家规划教材配套，开设64节课，为4学分，各校可以选其中部分课时，改为3学分或2学分。其中48课时由王步高教授亲自讲授，其他课程由东南大学教有所长、具有博士学位的教授、副教授讲授。王步高教授长期为全国大学语文的带头人之一，可以组织全国同行为各校提供适当面授、答疑与专家讲座。相信本课程对推动全国高校普遍开设本课程，提高全国大学生的母语水平，起到积极作用。",
    "C_course-v1:TsinghuaX+30700313X+2019_T1": "在人们物质生活飞速发展的今天，关注心理学显得尤为重要。在美国大学，心理学是学生人数最多且最受欢迎的学科之一。本课程分为13章，分别阐述绪论、意识、感觉、知觉、学习、记忆、思维、情感、进化、动机、人格、社会以及幸福问题。在每一章中，都会以心理学的实证研究作为例证，以经典理论观点作为主导，以积极正面的心理学研究为方向，让学生掌握心理学的基本内容和前沿动态，了解心理学的思考方式，去除对心理学的疑惑与误解，掌握基本的心理学研究方法。",
    "C_course-v1:TsinghuaX+80000822X+2019_T1": "我国老年人口正以每年递增1000万的速度飞快增长，居住空间与环境的适老化、精细化设计不仅仅是规划建筑专业人员的必备技能，更是老龄社会中每个人应当了解的基本知识。课程将从以下这些问题切入，深入浅出地讲解适老居住空间与环境营造的方方面面：我国人口老龄化现状与养老居住政策是怎样的？养老产业与养老地产的发展现状及趋势是什么？国外在积极应对老龄化问题上有哪些先进经验？该怎样通过规划、建筑设计手段建造人性化的老年设施及社区环境 。如何改造、装修老年住宅为身边逐渐老去的Ta营造一个舒适安心的家？无论你是设计师、养老行业工作者、还是家有老人的普通人，相信通过本门课程的学习，你都将对老龄化问题有更深的认识，掌握营造适老居住空间与环境的原理和方法，学会为自己家中的老人营造更加美好的居住空间，从而领悟“源于生活、高于生活”的居住学问。",
    "C_course-v1:TsinghuaX+80000901X_1+2019_T1": "数千年的中国历史上，曾出现了很多伟大的城市，汉长安、北魏洛阳、隋唐长安和洛阳、北宋开封、元大都，都是当时世界上最繁华的大都市。这些城市虽已星光黯淡，却留下了一座座优美壮丽的建筑杰作，令人叹为观止。中国的宫殿、宗教建筑、佛塔、陵寝和园林等建筑类型，无论建造技术还是美学追求，都达到了很高的水平。中国古代的建筑有着自成体系的一套营造方法，以木结构为主，也有不少砖石结构的佛塔和陵寝。历史上建造了大量宫殿建筑，北京故宫是现存世界上最大宫殿建筑群。自南北朝至唐，出现了大批佛教寺院与石窟寺。南北朝以来各地建造的砖石塔，也使中国砖石建筑达到很高水平。唐、辽、宋、金时期留下了一大批宗教建筑遗存，包括大型殿堂，多层楼阁，与高度达67米的高层木塔。明清时期坛壝、祠庙、陵墓与民居，有了高度发展，北京天坛，曲阜孔庙、明十三陵，北京四合院等，是这一时期重要建筑实例。北京颐和园、承德避暑山庄是古代皇家园林代表，明清私家园林则是数千年中国园林艺术的结晶。宋《营造法式》和清《工部工程做法则例》是中国官式建筑两部重要文本，对于理解中国建筑有着重要的意义。",
    "C_course-v1:CUPB+100722C004+2019_T1": "课程主要涵盖五方面的内容:一、四张报表的结构和内容；二、四张报表之间的逻辑关系；三、财务报表分析的常用方法；四、质量分析法的逻辑框架；五、四张报表的分析路径和技巧。课程特色与亮点：1. 根据学习需求层次的不同设计适配的学习模块入口。本课程根据教学内容循序渐进地设计了知识准备、方法工具和分析技巧三大学习模块。学员可以根据自己的会计基础或学习需求来灵活选择不同的模块入口，进行自主学习，以便快捷有效的获取自己所需的知识； 2．理论教学与现实案例的有机结合。根据课程内容和教学目标设计若干相互联结又相互独立的知识点，各知识点的设计既简洁清晰又体现了授课内容的精华；同时，对一些难以理解的概念或需要重点掌握的内容，则通过课堂穿插通俗易懂的小案例或课后阅读思考现实案例的方法来加深学生对理论知识的理解，达到“学以致用”的教学目标； 3．课程的受众面广。这门课程不仅适用于在校学生作为专业课程进行学习，而且报表分析作为有效的决策和管理工具，也适合资本市场的投资者、企业的财务人员和管理者等社会学员作为其报表分析知识的补充和完善。 课程获奖情况：（以下均为主讲教师以“财务报表分析”课程参评获得的奖励）（1）2009年 中国石油大学（北京）青年教师教学基本功大赛一等奖、最佳演示奖 （2）2011年 中国石油大学（北京）第七届教学优秀成果奖二等奖； （3）2013年 中国石油大学（北京）微课大赛一等奖；  （4）2013年 全国微课大赛北京赛区优秀作品奖； （5）2014年 荣获中国石油大学（北京）“品牌课教师”称号； （6）2015年 中国石油大学（北京）首届教学效果卓越奖。考核机制：在视频学习的基础上，章节测试和期末考试成绩各占50%，满分100，60分合格、85分优秀。",
    "C_course-v1:HUST+0200421+2019_T1": "《财务报表分析》课程以企业的财务报表为基础，围绕财务报表的分析和实际应用展开教学。财务报表分析可以广泛应用于公司投资决策、财务预测、战略分析、经营决策、企业估值、信用评估、资产管理、业绩评价等等诸多领域，是我们工作和生活中“必须”和“必备”的技能。    本课程从大量实际案例入手，从“基础”到“提高”、从“入门”到“实战”，突破传统的财务比率分析，站在决策的视角对企业财务报表进行全新的解读，以达到正确评价企业的财务状况、经营成果和财务绩效，揭示企业未来收益和风险的目的。    通过本课程的学习，可以掌握财务报表分析的步骤和方法，加深对财务报表内容的理解，明确如何更有效地使用财务报告信息，提高评价企业经营成果和财务状况的能力，更好地为管理和决策服务。 授课目标为：  （1）了解财务报表分析的目的、财务报告的主要内容；    （2）准确理解财务报表的相关概念，财务报表主要项目的含义及其具体构成；    （3）通过实际案例来解读财务报表，掌握阅读财务报表、分析财务活动状况、评价财务绩效的方法和技巧；    （4）掌握财务报表分析的步骤和方法，学会发现报表舞弊的迹象，侦破财务舞弊行为，提高分析和决策能力。",
    "C_course-v1:TsinghuaX+80000901X_2+2019_T1": "数千年的中国历史上，曾出现了很多伟大的城市，汉长安、北魏洛阳、隋唐长安和洛阳、北宋开封、元大都，都是当时世界上最繁华的大都市。这些城市虽已星光黯淡，却留下了一座座优美壮丽的建筑杰作，令人叹为观止。中国的宫殿、宗教建筑、佛塔、陵寝和园林等建筑类型，无论建造技术还是美学追求，都达到了很高的水平。中国古代的建筑有着自成体系的一套营造方法，以木结构为主，也有不少砖石结构的佛塔和陵寝。历史上建造了大量宫殿建筑，北京故宫是现存世界上最大宫殿建筑群。自南北朝至唐，出现了大批佛教寺院与石窟寺。南北朝以来各地建造的砖石塔，也使中国砖石建筑达到很高水平。唐、辽、宋、金时期留下了一大批宗教建筑遗存，包括大型殿堂，多层楼阁，与高度达67米的高层木塔。明清时期坛壝、祠庙、陵墓与民居，有了高度发展，北京天坛，曲阜孔庙、明十三陵，北京四合院等，是这一时期重要建筑实例。北京颐和园、承德避暑山庄是古代皇家园林代表，明清私家园林则是数千年中国园林艺术的结晶。宋《营造法式》和清《工部工程做法则例》是中国官式建筑两部重要文本，对于理解中国建筑有着重要的意义。",
    "C_course-v1:TsinghuaX+10430575X+2019_T1": "本课程是物理系基础物理的第一门课程。是本科生的核心基础课，主要面对需要坚实物理基础的本科生。物理学是整个自然科学的基础。物理学规律是自然界最基本的规律，物理学研究方法、实验手段是基本研究方法和实验手段。物理学原理是技术源泉，是多学科交叉、转移和渗透的支撑点。基础物理将物理学的全貌、特点、精华展现给学",
    "C_course-v1:FUDANx+ECON130088+2019_T1": "“互联网金融”课程的特点是将实做“虚”，将虚做“实”，也就是在虚拟世界再现传统的现实业务，同时在虚拟世界实现传统的价值创造与社会财富的增长。互联网金融课程是以信息和网络技术应用为核心，以能力培养为重点的金融专业的专业课，是信息化时代金融专业创新课程，也是一门有待进一步完善的课程，其具有实践性、综合性及创新性的特点。通过对本课程的学习，学生应当深入认识互联网金融内涵及其在网络经济运行中的重要地位，理解互联网金融运行的基本技术基础，掌握P2P网络信贷、众筹融资、电子货币、电子支付、互联网银行、互联网证券和互联网保险等，了解互联网金融的发展历史和现状。尤其重要的是要理解互联网金融给金融业和整个经济带来的内在和外部影响，包括风险控制和监管等问题。 其次，学生应当通过本课程的学习，学会运用互联网金融学的相关理论和知识分析现实生活中的金融现象和问题，提高分析问题和解决问题的能力以及创新的思想。 ",
    "C_course-v1:FUDANx+ECON13000701+2019_T1": "经济学原理是经管类学生的一门基础核心课程，基本理论通常分为微观经济学与宏观经济学两大部分，其中微观经济学以居民户、厂商等单个经济单位作为考察对象，研究他们的经济行为以及与之相关的经济个量是如何决定与变动的，而宏观经济学以整个国民经济总体作为考察对象，研究社会总体经济问题以及与之相关的经济总量是如何决定与变动的。本课程介绍经济学的基本概念、基本理论和基本分析方法，其中微观经济学部分主要内容包括供求理论、消费者行为理论、生产理论、成本理论、市场结构理论、收入分配理论等。宏观经济学部分主要内容包括宏观经济学度量衡、简单国民收入决定、IS-LM模型、总需求-总供给模型、宏观经济政策、经济增长理论等。",
    "C_course-v1:FUDANx+ECON1300812+2019_T1": "金融工程主要是随着投资银行业与资本市场的扩张而产生和发展起来的一门应用性很强的金融学科。通过本课程的学习，同学们能掌握远期、期货、期权、互换等衍生金融工具的基本原理；掌握衍生金融工具定价的基本原理；掌握运用衍生金融工具进行套期保值的基本原理；掌握金融工程的基本理论和技术，初步学会运用工程技术的方法，如数学建模、数值计算、网络图解、仿真模拟等设计、开发和实施新型金融产品、实施金融风险管理策略等，创造性地解决金融问题；通过授课、作业、案例分析等，培养学生的金融工程思维。",
    "C_course-v1:FUDANx+ECON130080+2019_T1": "通过本课程教学，使学生掌握投资银行学的基本概念、基本功能和常用术语，理解有关投资银行的核心业务，掌握各种核心业务的主要特点、运行规律及相互间的联系与区别，熟悉各项工作的基本步骤及方法，培养并提高学生对投资银行业务掌握和应用能力，并为学生日后从事相关研究以及管理工作奠定基础。主要讲授内容包括：导论、投资银行发展、证券发行与承销业务、证券交易业务、兼并与收购业务、资产证券化业务、风险投资与股权投资、资产管理业务、投资银行的风险防范与外部监管等内容。",
    "C_course-v1:FUDANx+SOSC120007+2019_T1": "（1）教学目标通过本课程的学习，让学生从宏观视角了解现代经济中金融市场、金融机构、中央银行的作用和运作机制，破解货币的秘密，理解货币是什么、如何产生和膨胀、具有什么影响，理解开放经济条件下央行实施货币政策、货币与经济关系等的相关理论与实证。（2）课程内容本课程主要包括四部分，第一部分导论，主要介绍什么是货币以及金融体系概览，第二部分是金融市场，侧重分析金融市场的价格——利率的行为特征及其决定；第三部分是金融机构，侧重分析在货币创造过程中最重要的金融机构——商业银行的运营及其行业特征；第四部分是本课程的核心，即货币供给、货币需求、货币政策的传导、货币政策策略以及货币政策规则等。",
    "C_course-v1:ZZU+334068+2019_T1": "本课程教学内容详尽，既有摄影基础知识，又有进阶提高。 既有深入现场的实际操作，又有作品欣赏。以讲授与实践结合的方式讲摄影技术；对作品分析均为了提高学生审美能力；技巧讲授依托摄影主题和场景，有更多实用性的技术与技巧引导学生的艺术情趣和生活态度。课程教学采用视频讲授、课后实践、章节测验、结业测试等多种教学形式，力图保证教学效果。",
    "C_course-v1:CUPB+100203E003+2019_T1": "《采油工程》是石油工程专业的核心必修课，是从事油气田开发工作必不可少的专业课之一。本课程从采油工程系统出发，主要介绍采油工程涉及的基础理论，包括油井流入动态、井筒流动规律和节点分析方法；讲解气举采油和有杆泵采油等主要的人工举升技术；介绍注水、水利压裂和酸处理等增产工艺措施。使学生从基本理论、主要工艺过程和常用设备原理等三个方面掌握采油工程相关知识。考核机制：除课程视频的学习外，需要完成每周课后作业。课程成绩由平时作业和期末考试两部分组成，平时作业成绩占50%，期末考试成绩占50%，总成绩不低于60分可获得证书，不低于85分获得优秀。",
    "C_course-v1:CUPB+CUPB201702+2019_T1": "在中国石油工业发展历程中孕育出的石油文化，是中华民族宝贵的精神财富，是石油文明独特的基因组码，是中国石油企业鲜明的文化脉络。本课程对中国石油文化的内涵、外延进行凝练、概括，对其历史发展进行梳理、对其当代价值及石油工程伦理精神进行挖掘。",
    "C_course-v1:JNUX+jnu2017001X+2019_T1": "《〈红楼梦〉的空间艺术》是一门通识课，重点讲授视觉文化的建筑空间与嗅觉文化的香气空间在小说中的艺术表达和思想文化价值。课程内容实现跨界整合，教学方法实现跨界比较，教学图片实现跨界采风。 讲红楼，看建筑，游览大观园。庭院建筑，人体比喻：嘴是大门，喉咙垂花门，内脏四合院，肋骨围墙，脊椎中轴线；脚是台基，身子柱梁，头是大屋顶。方位词建构庭院布局，园林门是串联情节的媒介。中国平房墙多，西方楼房窗多，不同的建筑风格决定了中国文学翻墙约会，西方文学爬窗约会的描写。 爱红楼，嗅香气，香飘园林世界。香气空白，嗅觉审美，香气韵调，暗示性格。秦可卿房浊香调、王熙凤房辛香调、薛宝钗房凉香调、贾宝玉房醇香调、林黛玉房清香调。香气韵调有温度，蘅芜苑是凉森森的“冷”，表明薛宝钗是一个“0度美人”。潇湘馆是不冷不热的“温”，表明林黛玉是一个“25度美女”，怡红院是虫子闻香就扑的“暖”，表明贾宝玉是“37度暖男一枚”。 本课程10章内容包括：《红楼梦》的建筑图景、方位观念、庭院叙事视点、园林场景叙事、门的叙事视角、门窗墙的空间分割与比较、《红楼梦》的香文化、香的祭祀文化、香气空白与香气韵调。幽默伴课程，跨界比较让你脑洞大开！ ",
    "C_course-v1:KMUSTX+8209001+2019_T1": "许多人都认为市场营销学是一门很高深的学问，其实它就体现在我们的日常生活当中，只是我们从来没有认为它就是一种市场营销行为！营销真是无处不在。无论是有意识的还是无意识的，任何组织与个人都在从事着各种各样的市场营销活动。良好的市场营销日益成为商业成功的重要因素。市场营销对我们有着深刻的影响，它已经根植于我们的日常生活之中。在课程内容的编排上，按照市场营销学导论、市场调研、市场营销竞争战略、目标市场营销战略、市场营销组合（4P’s）策略等这样一个体系来安排，尊重市场营销学学科体系的完整性和系统性。理论讲授和案例教学相结合。体现出：市场营销学既是一门科学，又是一种艺术。课程讲授从生活中的市场营销案例或故事入手，反映出生活中的市场营销智慧，课程注重贴近人们的生活，增强趣味性。考核规则：平时成绩40%+期末成绩60%",
    "C_course-v1:TsinghuaX+30040263X+sp": "《土力学》是土木工程和水利水电工程的核心课程，也是交通、港口、环境、核电站和矿山等相关专业的重要专业基础课程。按照课程的特点和定位以及对学生能力培养的需求，将《土力学》课程教学组合为三个模块：（1）《土力学》的理论，以土的渗透、变形和强度三大基本特性为核心内容，注重培养学生理性思维和分析能力；（2）《土力学》的应用，主要学习土力学基本理论在各种工程问题中的应用，注重培养学生的实用计算和工程判断能力；（3）《土力学》的实验，以土的物性试验、三轴试验和固结试验等为核心教学内容，注重培养学生土工试验的动手能力。 ",
    "C_course-v1:JNU+07009215+2019_T1": "地球曾经是如此美丽，充满生机，曾给人类带来无限的希望。然而，为什么又说全球的环境恶化、生态危机已成为人类生存、发展的最大祸患？是什么原因影响了生态安全？全球气候变化给人类带来哪些不良后果？请跟我们一起走进“自然保护与生态安全：拯救地球家园”这门通识课程，一同来探索以上问题的答案。本课程要求学生掌握自然保护的基本概念和基本理论，了解我国自然保护的现状，熟悉全球自然生态保护的热点问题，培养学生热爱自然的情操，增强学生保护自然资源的意识，守护地球家园。本课程2014年评为全国大学素质教育精品通选课，2015年评为广东省精品资源共享课程。2016年“中国自然保护的发展”获第二十届全国教育教学信息化大奖赛微课一等奖，“生物多样性概述”获全国生命科学类微课教学比赛优秀制作奖，《自然保护概论》精品资源共享课程获第二十届全国教育教学信息化大奖赛三等奖。",
    "C_course-v1:JXUST+JXUST2016001+2019_T1": "主要内容：人工智能的定义，树搜索算法，无信息搜索策略，启发式搜索策略，约束满足问题求解，博弈算法，贝叶斯网络，隐马尔可夫模型，卡尔曼滤波器。 特色：人工智能课程在学校的讲授时间为32个学时，面对计算机科学与技术硕士研究生，是一门专业必修课。由于人工智能基础理论涉及到智能搜索，推理，机器学习等，是现在信息类研究生各研究方向的必备理论基础，能为学生深入各方向的研究打下良好的基础。其中的思想可以应用于模式识别，图像视频智能分析处理，数据挖掘及各种信息的智能处理应用中。由于课程讲授侧重于算法的描述，所以学生并不会觉得枯燥，在结合编程的实践练习下能很好掌握智能思想。",
    "C_course-v1:JNU+11022048+2019_T1": "本课程以管理咨询师的视角，通过导入外部管理智慧，帮助企业认识发展中的各种矛盾及其运动规律，指导企业有效识别并系统解决在发展中遇到的各种内生性和外生性管理瓶颈问题，在不同阶段分别采取“预防-预警-辨识-处置”的解决方案，实现预防、修正或升级等不同的咨询目标，使企业得以持续、健康发展。 本课程从时间和咨询市场两个维度展开。在时间维度上，对管理咨询的历史路径进行回溯，对管理咨询的现代特征进行解析，对管理咨询的未来发展进行展望；在咨询市场维度上，分别从管理咨询需求和管理咨询供给的角度，介绍管理咨询的流程、步骤和方法——即按照“调查-分析-判断”的范式进行诊断，继而进行解决方案的设计、推介和实施。课程还结合技术、文化环境的变化以及管理理论的进展，讨论了管理咨询的持续性问题。本课程以应用为导向，集成了许多管理专业课的知识和方法，并在讲授中穿插大量生动、真实的咨询案例，具有简明、易学、实用的特点，适于管理类大四学生、管理类专业学位硕士生以及从事管理咨询、管理培训和管理实务的人士在线学习。",
    "C_course-v1:JNU+03010015+2019_T1": "世界上存在着各种各样的冲突，而国际私法是解决不同国家民事法律冲突的法律，也被称为“法中之法”。在英美法系国家被形象地称为“冲突法”；在大陆法系国家通常被称为“国际私法”。    随着我国对外开放，中国企业“走出去”、“引进来”的深入发展，如何解决中国民事法律与其他国家民事法律的冲突，国际私法将发挥重要的作用。例如：一对不满20岁的中国留学生在国外的结婚是否有效？在中国结婚但已在加拿大定居的华侨如何才能离婚？他们在中国和多伦多的房产该如何分割呢？在“一国两制”下，内地与香港、澳门特别行政区及台湾地区的民事关系如何解决等等，这些跨国、跨法域的一系列民事问题都可以通过本课程的学习找到答案。    同时，国际私法作为高校高年级的专业必修课，因其涉及不同国家的法律又有较多新的术语、概念和推理方式，常被法学专业学生称为法学课程中最难的一门学科，学生因此也望而生畏。本课程主讲教师戴霞副教授，集二十多年高校国际私法之教学经验，采用国际上流行的OBA（OBA——Outcomes Based Approach即学习成果为本）教学法而设计，课程以学生“学习成果”（outcomes）为本的理念，以学生能学到什么为思路和目标，设计了教学目的、小结提要、每讲测试、问题讨论、阅读材料等内容，同学们通过线上和线下的学习，可以较轻松地掌握国际私法之基本概念和基本原理，学习跨国民事纠纷解决之道，了解国际私法的最新发展动态，为同学们处理跨国民事关系打下坚实的基础，为我国的对外开放服务！ ",
    "C_course-v1:JNU+11020009+2019_T1": "《管理学原理》是一门专业基础课程，它是一门研究一般管理理论和原理的科学，它提出的管理原则、基本思想是各类管理学科的概括和总结，它是整个管理学科体系的基石。它是各职能管理类课程的基础。通过学习管理，大家能够对所在的组织以及组织的工作有更深入的了解，可以学会自我管理和自我激励。通过学习管理，大家能够发现管理问题，采取有效办法解决这些问题。本课程将从管理思想、管理与管理者、管理四大职能为主线展开在线学习。通过课程学习，系统掌握管理学的基本理论和方法，对管理实践有所了解，学会自我管理和自我激励，在不断提高自身管理水平的同时，能够取得更好的工作业绩和学习绩效。",
    "C_course-v1:TsinghuaX+30590023+2019_T1": "每个人是生活的观察者，每个人都可以成为社会的研究者。然而，什么是社会研究？什么是社会科学研究？如何开展一项科学的社会研究？每位有志于从事社会研究的同学可能都会思考：我应该研究什么问题？什么是好的研究问题？我应该采用什么样的研究方法？为什么会有定性和定量方法之争？应当如何收集到我需要的数据资料？如何进行问卷调查？如何进行观察和访谈？如何评价一个研究？如何陈述我的研究选题和研究计划？这一系列问题的背后，是一个社会研究者的技能训练过程，也包含着一种科学精神与态度的养成。  在本课程中，授课老师将结合自己多年的教学与研究经验，给所有有志于开展社会研究和社会调查的同学讲授社会科学研究（特别是应用性社会科学研究）的基本过程与特点，介绍设计与实施一项社会研究的基本原则、方法与技巧及其在实际研究中的具体运用。通过本课程的学习，学生将掌握研究选题、研究设计与数据收集等环节的基本原则与技巧、了解定性与定量研究方法的类型及适用范围，并能够设计一项的实证社会研究并撰写研究计划书。更重要的是，通过本课程，学生能够理解社会研究者的科学精神与思维方式，培养严谨的科学研究态度，并形成评判一项社会科学研究的能力。 本课程将结合线上学习（观看课程视频）与线下学习两种形式。线下学习方式包括：（1）阅读老师在视频中提到的参考书目及推荐研究文献；（2）参与课堂讨论区的讨论；（3）根据课程进度完成每周课程作业，并完成期末作业（尝试完成一份选题计划）。 考核方式：作业（50%）+期末作业（50%）",
    "C_course-v1:HQU+20180307002+2019_T1": "自媒体时代,浩瀚的信息和知识越发让人迷乱。跑步怎么减肥？仰卧起坐做错了吗？A4腰真的空穴来风？《科学运动与健康》将带你解密运动健康背后的科学原理，掌握健身减肥、塑形及驼背、脊柱侧弯等形体矫正等内在原理与基本方法，能够甄别运动与健康的知识和方法，寻找并制定适合自己的锻炼方式。本课程通过对日常健身中常见问题的解析，帮你了解如何科学健身。既有减肥塑形的密码追踪，又有减肥误区之折翼天使的劝导；既有体态矫正评估分析，又有溜肩驼背矫正的示范讲解；既有男士力量训练的增肌要诀，更要教会利女士利用好力量练习这把整形刀。欢迎爱运动、想行动、有困惑的同学加入《科学运动与健康》在线课程。 ",
    "C_course-v1:USTC+AP000011X+2019_T1": "《多元微积分》是有关多元函数的极限、导数与微分，以及积分等概念、思想和方法的课程。在学习过程中，我们一方面要注意观察多元微积分与一元微积分的相同之处，另一方面，要注意理解多元微积分与一元微积分的不同之处，以及产生这种差异的原因。同时，注重数学概念产生的来龙去脉，从具体的几何图像和物理背景中，理解抽象的数学概念；并主动将所学习的多元微积分知识，运用到几何和物理等学科中，一方面，做到学以致用；另一方面，做到以用促学。",
    "C_course-v1:TsinghuaX+20180131001+2019_T1": "授课进程分为七节：第一节、理论讲述：中国传统山水画的审美旨趣及表现方法第二节、笔墨与材料第三节、笔墨训练方法之一（披麻皴画法）第四节、笔墨训练方法之二（牛毛皴画法）第五节、笔墨训练方法之三（斧劈皴画法）第六节、笔墨训练方法之四（树干法、点叶法）第七节、笔墨训练方法之五（出枝法）",
    "C_course-v1:GZHU+000001004+2019_T1": "本课程为高校思想政治理论课程之一，为本科公共必修课，亦可作为专科层次的公共选修课，同时可以满足各层次、各年龄段学习者修学分和兴趣学习。本课程学习采用线上学习和线下学习（翻转课堂）相结合的方式，学期末给予学习成绩和修学证书。线上学习内容包括教学视频、教案、课件、资料视频、练习题、课内讨论、作业等，其中教学视频为三位主讲教师同时出镜的交互讨论式视频，内容上把教材内容体系转变为教学内容体系，把教学内容体系转变为具有逻辑结构的问题体系，再把问题体系落脚到价值观体系，这是教材内容的重构和创造性设计，有利于师生更好地把握教材体系和内容结构；同时重构了教学流程，改变了传统的教学组织形式。形式上借鉴“锵锵三人行”和“百家讲坛”的多种优势，为MOOC或SPOC教学的新探索。本课程充分体现教育性教学、实效性教学和发展性教学的教学理念，突出课程教学的认知目标、能力目标和情感目标。经过2个学年的实践应用，取得了满意的教学效果。",
    "C_course-v1:TsinghuaX+40250074X+2019_T1": "自动控制理论是自动化学科核心专业基础课，也是研究和设计复杂工程控制系统的理论基础。本课程也称为经典控制理论，包含（1）控制系统的概论，着重介绍反馈原理；（2）控制系统的建模，着重介绍微分方程及机理法建模、拉普拉斯变换、传递函数、频率响应模型、数据驱动模型和典型控制系统的组成与框图变换；（3）控制系统的分析及性能评价，包括动态系统的时间响应、结构属性、稳定性、稳态精度、动态性能和时域频域分析方法；（4）控制系统的频域设计，PID控制器及参数整定法、超前滞后校正。课程发展的主要历史沿革：清华大学是新中国最早开设与控制理论相关的课程的高校之一。20世纪60年代之前在自动控制系、电机工程系、动力机械系等由钟士模、吴麒、郑维敏、方崇智教授等开设了控制理论或调节原理课程。自70年代建立自动化系后，全校多数研究、讲授控制理论的教师集中到自动化系。该课程一直是自动化系的核心专业基础课程，系的历届领导十分知识课程的建设。自动化系成立后，首先由吴麒、郑维敏、方崇智教授组织、讲授全系的自动控制理论课程。后由郑大钟、戴忠达、王诗宓教授继续组织自动控制理论课程的建设，并于1990年获“清华大学教学工作优秀成果二等奖”。一开始，全系学生分几个大班修读自动控制理论课程。后来由系教学副主任统筹协调，首先做到全系分班授课，统一考试；然后逐步做到全系统一授课，统一考试。而且在90年代，就进行英语授课的尝试，取得良好效果。在此期间，出版了两套教材。吴麒教授主编的《自动控制原理》采用“数学描述统一，工程处理分开”的方法妥善地处理经典控制理论和状态空间方法的联系和区别。戴忠达教授主编的《自动控制理论基础》则将两种方法结合起来统一编写。吴麒教授主编的《自动控制原理》也一直是国内比较有影响的教材之一。为提高学生的阅读和理解能力，扩展学生知识，本课程一直选用最新翻译的国外教材或原文教材作为教学参考书。在建设国家级精品课期间，吴麒、王诗宓教授完成了《自动控制原理》（第2版）的编写出版，其中删除、简化了一些陈旧或单纯计算作图的知识，增加了与学科新成果有关的章节。《自动控制理论》课程于2007年和2016年先后获得国家级精品课和国家级精品资源共享课程称号。 ",
    "C_course-v1:TsinghuaX+40250683X+2019_T1": "自动控制理论是自动化学科核心专业基础课，也是研究和设计复杂工程控制系统的理论基础。本课程是自动控制理论（1）的后续课程，讲授现代控制理论的基本内容，系统介绍基于状态空间描述的控制系统的分析和综合方法。与系统建模及分析有关的内容包括控制系统的状态空间描述，线性变换和特征值规范型，线性系统状态方程的解，预解矩阵和矩阵指数，渐近稳定性，状态的能控性和能观性，能控性及能观性的判据和规范型，系统的标准结构分解，由状态方程导出传递函数，传递函数和能控能观性的关系，传递函数的实现和最小实现，状态反馈和输出反馈，反馈对能控性和能观性的影响等。与系统综合有关的内容包括基于状态反馈的极点配置，状态的全维和降维观测器，用变分法/极大值原理求解最优控制问题，线性系统二次型指标最优控制问题，李雅普诺夫稳定性概念，李雅普诺夫间接法和直接法等。课程发展的主要历史沿革：清华大学是新中国最早开设与控制理论相关的课程的高校之一。20世纪60年代之前在自动控制系、电机工程系、动力机械系等由钟士模、吴麒、郑维敏、方崇智教授等开设了控制理论或调节原理课程。自70年代建立自动化系后，全校多数研究、讲授控制理论的教师集中到自动化系。该课程一直是自动化系的核心专业基础课程，系的历届领导十分知识课程的建设。自动化系成立后，首先由吴麒、郑维敏、方崇智教授组织、讲授全系的自动控制理论课程。后由郑大钟、戴忠达、王诗宓教授继续组织自动控制理论课程的建设，并于1990年获“清华大学教学工作优秀成果二等奖”。一开始，全系学生分几个大班修读自动控制理论课程。后来由系教学副主任统筹协调，首先做到全系分班授课，统一考试；然后逐步做到全系统一授课，统一考试。而且在90年代，就进行英语授课的尝试，取得良好效果。在此期间，出版了两套教材。吴麒教授主编的《自动控制原理》采用“数学描述统一，工程处理分开”的方法妥善地处理经典控制理论和状态空间方法的联系和区别。戴忠达教授主编的《自动控制理论基础》则将两种方法结合起来统一编写。吴麒教授主编的《自动控制原理》也一直是国内比较有影响的教材之一。为提高学生的阅读和理解能力，扩展学生知识，本课程一直选用最新翻译的国外教材或原文教材作为教学参考书。在建设国家级精品课期间，吴麒、王诗宓教授完成了《自动控制原理》（第2版）的编写出版，其中删除、简化了一些陈旧或单纯计算作图的知识，增加了与学科新成果有关的章节。《自动控制理论》课程于2007年和2016年先后获得国家级精品课和国家级精品资源共享课程称号。",
    "C_course-v1:HUBU+20190124X+2019_T1": "通用电气公司前任董事长兼CEO杰克韦尔奇说：“管理就是沟通、沟通、再沟通”。日本经营之神松下幸之助说：“企业管理过去是沟通，现在是沟通，未来还是沟通。”因此，对有志于进入管理职业生涯的大学生来说，掌握有效的与他人沟通的技巧至关重要。本课程一共包含30讲，通过学习，学生可以懂得管理沟通的基本原理，掌握有效的语言和非语言沟通策略，并能应用于具体的管理情景中，如跨文化沟通、谈判、冲突处理、会议沟通、媒体沟通等等。《管理沟通的艺术》这门课是许多高校管理学门类本科生的必修课，也可以作为其它专业本科生、研究生的素质教育课。这门课的学习不仅在于“知”，更在于“行”。只有不断地去实践和有意识地训练，沟通能力才能获得提升。沟通能力是一种通用职业能力，因此，普通的职场人也可以通过学习这门课，提升工作和生活中的沟通技巧，促进人际关系改善，进而促进个人职业生涯发展。",
    "C_course-v1:TsinghuaX+AP000015X+2019_T1": "《大学化学（先修课）》将在高中化学国家新课标大纲的基础上，从全新的角度，介绍大学化学的基本理论， 以及化学与现实生活、工农业生产和科学研究的相互关系，帮助同学们进一步拓展学术视野，提升用化学知识解决实际问题的能力，培养化学思维的新模式。课程内容主要包括：物质的聚集状态，原子结构与元素周期律，分子结构与化学键，配合物概论，反应的热效应与化学平衡，化学热力学基础，化学动力学初步，酸碱平衡与溶解沉淀平衡，氧化还原平衡与电化学，元素与生命化学概论，化学与现代科学。在重点强调化学学科体系中不同研究方向内在关系的基础上，深化和拓展化学与其他科学的交叉知识。 教学方式上除保留了经典的课件讲授，网络论坛，课后作业等模式外，还新增专题小论文训练，鼓励同学们开展研究型学习。 开课期间，《大学化学先修课》专设助教老师提供课下辅导和学习互动。    本课程属于中国大学先修课（CAP）“学术志趣类”课程，已获清华大学和西安交通大学学分认证，通过在线课程学习和线上考试的同学，可报名本课程线下考试，并可凭”线下考试成绩单“和”线上学习行为报告“向高校提交学分认证申请。学分认证的申请流程和分数要求由高校教务处根据本校情况制订。    根据中国大学先修课（CAP）理事会安排，本课程线下考试安排在每年1月和7月，学生可根据个人学习情况报名参加，欢迎关注www.moocap.org.cn查询线下考试报名通知！",
    "C_course-v1:TsinghuaX+AP000001X+2019_T1": "《大学化学》将在高中化学国家新课标大纲的基础上，从全新的角度，介绍大学化学的基本理论， 以及化学与现实生活、工农业生产和科学研究的相互关系，帮助同学们进一步拓展学术视野，提升用化学知识解决实际问题的能力，培养化学思维的新模式。课程内容主要包括：物质的聚集状态，原子结构与元素周期律，分子结构与化学键，配合物概论，反应的热效应与化学平衡，化学热力学基础，化学动力学初步，酸碱平衡与溶解沉淀平衡，氧化还原平衡与电化学，元素与生命化学概论，化学与现代科学。在重点强调化学学科体系中不同研究方向内在关系的基础上，深化和拓展化学与其他科学的交叉知识。 教学方式上除保留了经典的课件讲授，网络论坛，课后作业等模式外，还新增专题小论文训练，鼓励同学们开展研究型学习。 开课期间，《大学化学》专设助教老师提供课下辅导和学习互动。   ",
    "C_course-v1:TsinghuaX+AP201601X+2019_T1": "大学物理先修课（电磁学）是为具有扎实的数理基础、对物理感兴趣、学有余力的优秀高中生开设的电磁学先修课程，它包括静电场、静电场中的导体和电介质、恒定电流、静磁场和静磁场中的磁介质、电磁感应、麦克斯韦方程组和电磁波等内容，预计30学时。 本课程以合理说明或推论的方式，辅助以课堂演示实验，简单明了地给出物理学的基本规律。以此为基础认识和理解自然现象，并学习解决实际问题的物理方法。作为MOOC课程，我们把内容分解成10分钟左右视频为基础的很多片断，每个片断包含一或两个知识点。   本教程需要一定的微积分和矢量基础知识，建议高二学生选修。考虑到选课同学的基础不同，我们把内容分成基本内容和扩展内容，打星号的是扩展内容，本课只要求掌握基本内容。  ",
    "C_course-v1:TsinghuaX+AP000002X+2019_T1": "大学物理先修课（力学）是为具有扎实的数理基础、对物理感兴趣、学有余力的优秀高中生开设的力学先修课程，它包括质点运动学、质点动力学、动量和角动量、功和能、刚体、振动与波及狭义相对论等内容，预计 36学时。大学物理课程通常是以合理说明或推论的方式，辅助以课堂演示实验，简单明了地给出物理学的基本规律。以此为基础认识和理解自然现象，并学习解决实际问题的物理方法。作为MOOC课程，我们把内容分解成10分钟左右视频为基础的很多片断， 每个片断包含一或两个知识点。教程内容精炼，概念准确清晰，与书面教材互为补充。本教程需要一定的微积分和矢量基础知识。力学中得出的许多思想 方法和物理规律，比如能量守恒定律、动量守恒定律和角动量守恒定律等都具有普适性，是学习其它物理学科的基础。   考虑到选课同学的基础不同，我们把内容分成基本内容和扩展内容，打星号的是扩展内容，本课只要求掌握基本内容。   本课程属于中国大学先修课（CAP）“学术志趣类”课程，已获清华大学和西安交通大学学分认证，通过在线课程学习和线上考试的同学，可报名本课程线下考试，并可凭”线下考试成绩单“和”线上学习行为报告“向高校提交学分认证申请。学分认证的申请流程和分数要求由高校教务处根据本校情况制订。   根据中国大学先修课（CAP）理事会安排，本课程线下考试安排在每年1月和7月，学生可根据个人学习情况报名参加，欢迎关注www.moocap.org.cn查询线下考试报名通知！ ",
    "C_course-v1:TsinghuaX+AP000005X+2019_T1": "微积分不仅是近现代数学和科学的理论基础，而且在不同领域中得到了越来越广泛的应用。能否很好地掌握微积分的基本思想和方法，直接影响到在相关的领域中能否得到很好地发展和提升。清华大学微积分AP课程面向具有扎实的数学基础、学有余力，并希望提前选修大学数学基础课程的优秀高中生，主要讲授一元函数微积分的主要内容。通过学习，希望学生能掌握微分学和积分学的基本思想和方法，能够处理微积分中的常见问题，使学生得到比较系统的数学训练，提升学生的科学素质，为进入下阶段的学习做好知识储备和能力准备。本课程内容包括：实数理论、极限理论、函数连续性、函数的导数与微分、微分学应用、积分法、定积分及其应用等，课内讲授大约需要40学时。   本课程属于中国大学先修课（CAP）“学术志趣类”课程，已获清华大学和西安交通大学学分认证，通过在线课程学习和线上考试的同学，可报名本课程线下考试，并可凭”线下考试成绩单“和”线上学习行为报告“向高校提交学分认证申请。学分认证的申请流程和分数要求由高校教务处根据本校情况制订。   根据中国大学先修课（CAP）理事会安排，本课程线下考试安排在每年1月和7月，学生可根据个人学习情况报名参加，欢迎关注www.moocap.org.cn查询线下考试报名通知！",
    "C_course-v1:RUCX+AP000010X+2019_T1": "微观经济学是经管类专业的最重要基础课，后续各专业基础课和专业课都建立在这门课程的知识体系之上。由于这门课程具有广泛的应用价值，也常被作为通识课程在经管类以外的专业讲授。   微观经济学是高中《经济生活》课程的最核心内容，因此，是从高中向大学学习过程中一个最为自然的衔接课程。在微观经济学看来，世界最基本的特征是物质资源不足以满足人们各种生活欲望产生的稀缺。人类发明了市场机制解决稀缺问题。微观经济学分析市场机制如何使得人们面临稀缺问题的时候做出选择，这些选择又是如何相互作用，相互协调，解决稀缺资源的配置。在日常生活中，如果市场出现了激励和协调失灵，应该通过什么手段来进行矫正。   通过这门课程，你将领会到纷繁复杂的现实世界背后简单的经济道理，体会我们所处时代的运行法则。   本课程属于中国大学先修课（CAP）“学术志趣类”课程，已获中国人民大学学分认证，通过在线课程学习和线上考试的同学，可报名本课程线下考试，并可凭”线下考试成绩单“和”线上学习行为报告“向高校提交学分认证申请。学分认证的申请流程和分数要求由高校教务处根据本校情况制订。   根据中国大学先修课（CAP）理事会安排，本课程线下考试安排在每年1月和7月，学生可根据个人学习情况报名参加，欢迎关注www.moocap.org.cn查询线下考试报名通知！",
    "C_course-v1:TsinghuaX+AP000016X+2019_T1": "生命科学是目前自然科学领域最活跃的学科之一，《普通生物学》则是生命科学的基础课和概论课。本课程将着重介绍生命科学的基本规律和基础知识，以及研究方法、研究技术及其应用实例等，同时也会将生命科学领域的最新研究进展融入课程中，希望帮助同学们搭建起一个生命科学的整体知识框架，并为后续生物学专业课程的学习奠定基础。本课程分两部分——“细胞-分子”和“植物-动物”，共四章。课程将从分子、细胞、组织、器官和个体水平等多个不同的层面来分析和认识生命的基本特征和规律。课程不仅介绍生物体的结构与功能，还将介绍生物体生长、发育和遗传的机制，以及生物演化的基本规律。“细胞和分子”部分包括两章——“细胞生物学基础”和“分子生物学基础”。重点介绍了物质的跨膜运输、真核细胞的结构、细胞的能量代谢、细胞的分裂和分化，遗传的分子基础、基因的表达调控、生物技术及其应用，人类基因组及其遗传疾病等内容。植物-动物部分包括“高等植物体的结构与功能”和“高等动物体的结构与功能”，着重从组织、器官和个体水平来分析和认识植物和动物生命活动的基本特征和规律。其中，第三章将介绍植物体的营养器官——根、茎、叶，以及生殖器官——花的结构与功能，分析植物生长、繁殖与发育的基本规律。第四章则主要以人为代表，介绍人体各大系统的组成、各器官的结构与功能、各系统的演化趋势，以及神经与体液调节的基本规律等等，同时，还会介绍一些常见疾病的发生机制等。   本课程由200多个短视频组成，每个视频长度在10分钟左右，并配有练习题及课程讲义，以便大家复习。   本课程属于中国大学先修课（CAP）“学术志趣类”课程，已获清华大学和西安交通大学学分认证，通过在线课程学习和线上考试的同学，可报名本课程线下考试，并可凭”线下考试成绩单“和”线上学习行为报告“向高校提交学分认证申请。学分认证的申请流程和分数要求由高校教务处根据本校情况制订。   根据中国大学先修课（CAP）理事会安排，本课程线下考试安排在每年1月和7月，学生可根据个人学习情况报名参加，欢迎关注www.moocap.org.cn查询线下考试报名通知！ ",
    "C_course-v1:TsinghuaX+10450034_1X_2X+2019_T1": "生命科学是目前自然科学领域最活跃的学科之一，《普通生物学》则是生命科学的基础课和概论课。本课程将着重介绍生命科学的基本规律和基础知识，以及研究方法、研究技术及其应用实例等，同时也会将生命科学领域的最新研究进展融入课程中，希望帮助同学们搭建起一个生命科学的整体知识框架，并为后续生物学专业课程的学习奠定基础。本课程分两部分——“细胞-分子”和“植物-动物”，共四章。课程将从分子、细胞、组织、器官和个体水平等多个不同的层面来分析和认识生命的基本特征和规律。课程不仅介绍生物体的结构与功能，还将介绍生物体生长、发育和遗传的机制，以及生物演化的基本规律。“细胞和分子”部分包括两章——“细胞生物学基础”和“分子生物学基础”。重点介绍了物质的跨膜运输、真核细胞的结构、细胞的能量代谢、细胞的分裂和分化，遗传的分子基础、基因的表达调控、生物技术及其应用，人类基因组及其遗传疾病等内容。植物-动物部分包括“高等植物体的结构与功能”和“高等动物体的结构与功能”，着重从组织、器官和个体水平来分析和认识植物和动物生命活动的基本特征和规律。其中，第三章将介绍植物体的营养器官——根、茎、叶，以及生殖器官——花的结构与功能，分析植物生长、繁殖与发育的基本规律。第四章则主要以人为代表，介绍人体各大系统的组成、各器官的结构与功能、各系统的演化趋势，以及神经与体液调节的基本规律等等，同时，还会介绍一些常见疾病的发生机制等。   本课程由200多个短视频组成，每个视频长度在10分钟左右，并配有练习题及课程讲义，以便大家复习。   ",
    "C_course-v1:TsinghuaX+AP000003X+2019_T1": "随着现代科学技术的发展，对不确定性深刻理解的需求越来广泛和紧要，概率论与统计学已经成为科学研究和工程技术不可或缺的工具。这门课程的基本内容和方法不仅是提供了一些有效工具，更反映出独特的思维模式，很好地体现了数学理论和实际应用的联系。本课程通过生动的应用实例导出基本理论，使学生了解从数学角度理解随机现象的观点，掌握分析和研究随机现象概率性质的基本数学方法，掌握认知数据背后统计规律的基本观念和方法。培养学生自主学习的能力，综合运用所学的数学原理和技能分析问题和解决问题的能力，以抽象思维和逻辑推理为特征的理性思维能力，并努力激发学生的学习兴趣，提升学生的科学素养，为学生在大学后继课的学习奠定良好的数学基础并帮助学生转变学习观念，更好地适应大学学习。授课主要内容有古典概型，条件概率及其计算，离散型和连续型随机变量的概率分布，随机变量的期望、方差等数字特征，常见概率分布，随机向量及其联合分布，随机变量的协方差和相关系数，大数定律和中心极限定理，统计总体与统计量，参数点估计和区间估计，假设检验。本课程的评分规则如下：平时成绩10%，课程作业30%，期末考试60%。其中课程作业、期中测试、期末考试均为选择题。平时成绩主要包括作业提交积极程度，讨论区活跃程度等。",
    "C_course-v1:TsinghuaX+AP000014X+2019_T1": "随着现代科学技术的发展，对不确定性深刻理解的需求越来广泛和紧要，概率论与统计学已经成为科学研究和工程技术不可或缺的工具。这门课程的基本内容和方法不仅是提供了一些有效工具，更反映出独特的思维模式，很好地体现了数学理论和实际应用的联系。本课程面向有初步微积分基础的优秀中学生。通过生动的应用实例导出基本理论，使学生了解从数学角度理解随机现象的观点，掌握分析和研究随机现象概率性质的基本数学方法，掌握认知数据背后统计规律的基本观念和方法。培养学生自主学习的能力，综合运用所学的数学原理和技能分析问题和解决问题的能力，以抽象思维和逻辑推理为特征的理性思维能力，并努力激发学生的学习兴趣，提升学生的科学素养，为学生在大学后继课的学习奠定良好的数学基础并帮助学生转变学习观念，更好地适应大学学习。授课主要内容有古典概型，条件概率及其计算，离散型和连续型随机变量的概率分布，随机变量的期望、方差等数字特征，常见概率分布，随机向量及其联合分布，随机变量的协方差和相关系数，大数定律和中心极限定理，统计总体与统计量，参数点估计和区间估计，假设检验。本课程的评分规则如下：平时成绩10%，课程作业30%，期末考试60%。其中课程作业、期中测试、期末考试均为选择题。平时成绩主要包括作业提交积极程度，讨论区活跃程度等。",
    "C_course-v1:TsinghuaX+AP000013X+2019_T1": "线性代数是19世纪后期发展起来的一个数学分支，它在当代高等院校的理工科专业的教学计划中是一门基础理论课。本课程以线性方程组和矩阵为核心内容，面向优秀中学生开设。标准相当于一般高等院校在校学生学习《线性代数C》以上的水平。通过该课程的学习，希望学生对几何向量、空间的直线和平面、线性方程组的高斯（Gauss）消去法、行列式、矩阵代数、n维向量空间、向量的线性相关和线性无关性、矩阵的对角化和实对称矩阵有较深入的认识和理解，掌握线性代数的基本知识、基本理论和基本技能，具有较强的运算能力、逻辑推理能力、抽象思维能力、综合运用所学的数学原理和技能分析问题和解决问题的能力。   本课程属于中国大学先修课（CAP）“学术志趣类”课程，已获清华大学和西安交通大学学分认证，通过在线课程学习和线上考试的同学，可报名本课程线下考试，并可凭”线下考试成绩单“和”线上学习行为报告“向高校提交学分认证申请。学分认证的申请流程和分数要求由高校教务处根据本校情况制订。   根据中国大学先修课（CAP）理事会安排，本课程线下考试安排在每年1月和7月，学生可根据个人学习情况报名参加，欢迎关注www.moocap.org.cn查询线下考试报名通知！ ",
    "C_course-v1:TsinghuaX+AP000008X+2019_T1": "本课程是基于《通用学术英语》的八个单元编写的。每个单元围绕一个主题进行， 内容涵盖文化、生命科学、艺术、自然、社会、技术与工程、心理学、经济与管理等学科。   这门课程中既有课文的词汇和长难句分析， 通过上下文分析这些词和句子的用法，也有来自美国和英国的外教会讲解学术英语的学习策略。通过清华学生和大家分享他们对课文主题的见解，我们希望帮助大家了解中外不同的世界观、价值观、思维方式等方面的差异，培养学生的跨文化意识，提高学生社会语言能力和跨文化交际能力，使他们能够在日常生活和学习中使用英语进行有效的交流。  本课程属于中国大学先修课（CAP）“学术志趣类”课程，将获得清华大学学分认证。通过在线课程学习和线上考试的同学，可报名本课程线下考试，并可凭”线下考试成绩单“和”线上学习行为报告“向高校提交学分认证申请。学分认证的申请流程和分数要求由高校教务处根据本校情况制订。   根据中国大学先修课（CAP）理事会安排，本课程线下考试安排在每年1月和7月，学生可根据个人学习情况报名参加，报名通知将在www.moocap.org.cn主页上公告，欢迎关注并报名参加！",
    "C_course-v1:TsinghuaX+AP000004X+2019_T1": "线性代数是19世纪后期发展起来的一个数学分支，它在当代高等院校的理工科专业的教学计划中是一门基础理论课。   通过该课程的学习，希望学生对几何向量、空间的直线和平面、线性方程组的高斯（Gauss）消去法、行列式、矩阵代数、n维向量空间、向量的线性相关和线性无关性、矩阵的对角化和实对称矩阵有较深入的认识和理解，掌握线性代数的基本知识、基本理论和基本技能，具有较强的运算能力、逻辑推理能力、抽象思维能力、综合运用所学的数学原理和技能分析问题和解决问题的能力。",
    "C_course-v1:CSU+20180919X+2019_T1": "本课程自开始以来一直秉承由来自不同学科的专业教师担任教学的传统。让来自不同学科的专家教授们结合自身学科的特点、基本研究策略和自己科研的心得，对如何实现高质量的医学实验研究进行了精辟讲解，与医学统计学课程形成相得益彰的有效互补。本课程主要内容包括：医学科研的概述、科学研究的假说、医学科研设计的基本要素、医学科研设计的统计学原则、医学科研的误差控制、医学形态学研究的基本策略、生物化学与分子生物学研究的基本策略、细胞生物学研究的基本策略、动物行为学研究的基本策略、机能学研究的基本策略、实验结果的专业判断与分析8个专题。本课程2010年获评湖南省精品课程。该课程暂无相应教材，属原创课程，内容丰富，科学性强，经多年教学实践，获得学生们普遍好评，在学校内选修本课程人数每年达近千人，是中南大学所有医学专业硕士研究生的品牌课。本课程校内讲授时间为32学时，线上慕课内容经浓缩提炼，精心录制55个视频，学习时间合计15小时。",
    "C_course-v1:TsinghuaX+80030222X+2019_T1": "简要介绍钢筋混凝土耐久性基础知识。重点介绍材料耐久性概念和三要素分析法。期望大家能将三要素分析法应用于日常生活和工程实践，为钢筋混凝土耐久性的提高做贡献。",
    "C_course-v1:SCUEC+20171229001+2019_T1": "精选核心知识点，从历史、方法、研究主题、应用四个方面对普通心理学的主体内容进行了讲解。帮助学生掌握心理学发展历史，从纵向角度建构心理学知识脉络；从研究方法入手，让学生感受心理学的科学魅力；从认知、社会性发展两个方面串联知识点；从对个体认识自己角度出发设计心理学应用知识内容。课程内容的凝练能够让心理学初学者走进心理学殿堂，感受心理学的精彩。",
    "C_course-v1:TsinghuaX+70240403+2019_T1": "《大数据机器学习》课程是面向信息学科的高年级本科生或研究生开设的基础理论课，目的是培养学生深入理解大数据机器学习理论基础，牢固掌握大数据机器学习方法，并能够解决实际问题等综合能力。课程的主要内容包括：统计学习基本理论，机器学习基本方法，深度学习理论和方法。",
    "C_course-v1:IMUN+5024610+2019_T1": "本课程要求学生牢固掌握的内容有：人类文明的产生；古代文明的诞生及其多元发展；中古文明的褪变与重生；西方文明的近代化转型，重点掌握近代欧洲文明诞生之前的三次思想运动，包括文艺复兴、宗教改革和启蒙运动；近代西方文明的繁荣；现代多元文明的冲突的融合，包括十月革命与苏联文化的发展、第二次世界大战与现代科技进步、当代世界及文明发展趋势等。",
    "C_course-v1:TsinghuaX+8070071301+2019_T1": "积极心理学是近年来在国际心理学界兴起的一个新领域，旨在“研究能使个人和社区繁盛的力量和美德”。积极心理学强调用正确的思维和心态对待生活，充分理解生活中的积极面和树立正确的人生观、世界观。积极心理学的核心“品格优势与美德”来自于人类历史上经久不衰的文化。其中中国文化传统美德所提倡尚的仁爱、礼节、正直、信任、智慧，以及《论语》、《道德经》等经典文献都被大量直接地进行引用。  本课程在积极心理学最新学术研究的基础上，参考了国内外积极心理学课程内容，与中国文化、国情相结合，致力于打造一套最适合中国人学习的积极心理学课程。  由于积极心理学的内容广博，因此课程分为两个部分，此为第一部分，内容有美好人生、幸福、品格优势与美德、习得性乐观、积极情绪、亲社会心理与行为、人际关系和沟通、亲密关系。我们希望广大学习者能够把本课程的知识应用到自己的生活中去，度过一个更充实、更美好的人生。",
    "C_course-v1:TsinghuaX+8070071302+2019_T1": "积极心理学是近年来在国际心理学界兴起的一个新领域，旨在“研究能使个人和社区繁盛的力量和美德”。积极心理学强调用正确的思维和心态对待生活，充分理解生活中的积极面和树立正确的人生观、世界观。积极心理学的核心“品格优势与美德”来自于人类历史上经久不衰的文化。其中中国文化传统美德所提倡尚的仁爱、礼节、正直、信任、智慧，以及《论语》、《道德经》等经典文献都被大量直接地进行引用。  本课程在积极心理学最新学术研究的基础上，参考了国内外积极心理学课程内容，与中国文化、国情相结合，致力于打造一套最适合中国人学习的积极心理学课程。  由于积极心理学的内容广博，因此课程分为两个部分，此为第二部分，内容有福流、积极动机、价值观与意义、积极自我、坚毅与自律、创造力与美、积极身心以及积极心理应用。我们希望广大学习者能够把本课程的知识应用到自己的生活中去，度过一个更充实、更美好的人生。",
    "C_course-v1:TsinghuaX+20180412+2019_T1": "《花卉鉴赏》课程旨在使学生了解花卉的概念、分类，花卉相关的植物学知识。能够识别和赏鉴常见花卉，了解其植物分类特征。 主要内容包括： 1. 花卉鉴赏概论 介绍花的概念，花卉概念及分类。 2. 花卉鉴赏的植物学基础 介绍与花卉相关的植物学知识，如植物的学名、科的概念、分类系统等。 3. 常见花卉鉴赏与识别 每一节课选择一个主题，介绍相关类群花卉。如北方地区春季优势的蔷薇科花卉、十大名花、多肉植物、芳香植物等。",
    "C_course-v1:SCUT+2019012401X+SP": "  本课程是化工、能源、制药等专业的一门重要的专业基础课程。利用计算机绘制各自专业的工程图纸已是大势所趋，由于各自专业的特点，目前针对化工、能源、制药、轻工等大化类等计算机辅助设计课程的MOOC项目尚未见报道。如能针对上述目标群体建立计算机辅助设计的MOOC项目，将大大提升该目标群体的工程制图能力，全面提升化工、能源、制药、轻工等专业毕业生的工程实践动手能力，为全民创业， 万众创新提供人才保障。项目预期受众定位于以中文为母语的学生及相关工程技术人员，全部采用中文字幕及课件和解答，为大中华服务， 大概每年有60万-100万的相关专业的国内大学生需要该课程的学习。授课目标 了解CAD的理论基础，掌握CAD的基本原理和方法; 学会参数化绘制程序开发；了解Excel宏编程原理，学会Excel宏程序开发，掌握用Excel进行规划求解及回归分析的方法。  熟练掌握AutoCAD绘图工具软件使用的基础上，会绘制化工设备零件及化工容器、换热器、精馏塔等各种化工设备装配图，同时也可以绘制轻工、能源等专业的各种设备图样，并在此基础上学会利用AutoCAD进行二次开发，利用参数化绘制技术，通过输入参数，一步绘制所需要的各种设备，为3D打印机提供打印文档；同时掌握Excel中的规划求解解决工程设计中的各类方程求解、模型参数拟合、过程系统优化等问题。   形成利用计算机解决工程设计中问题的的技术思维，提高解决工程设计实际问题的能力，通过宏求解及参数化绘制软件开发，批量解决工程设计中的优化计算及图形绘制任务，大大提供工程设计效率。",
    "C_course-v1:GZUCM+2019012801X+2019_T1": "《创业新浪潮：医药健康创新创业》将带领大家以创新的思维识别医药健康领域的创业机会，以创新的商业模式重整医药健康领域的创业生态，以创新的方式整合医药健康领域的创业资源。同时，课程通过嘉宾访谈的形式，邀请医药健康产业青年创业典型人物、医药健康产业高级管理人员、医药健康领域专家走进创客大健康访谈室，还原医药健康创业的真实场景。另外，课程还设置了“创客习语”章节，围绕习近平新时代中国特色社会主义思想中关于医药健康的重要理论，从中医药文创、中医结合健康科普、人工智能与新医药健康技术、“健康中国”战略下政策与产业发展要点、健康养老中的心理服务等多个专题开拓新时代医药健康创业的学习视野。",
    "C_course-v1:dlmu+20180906+2019_T1": "本课程共分为五章，分别从概述、船员、船舶、航行、安全的角度对航海进行全方位的透析。第一章概述：介绍航海的概念、发展、作用和意义；第二章船员：介绍船员文化、船员贡献以及船员的主要职责；第三章船舶：介绍船舶的发展、船舶种类、船舶结构、船舶救生消防设备、船舶通信和动力设备等；第四章航行：介绍航海基本知识、航行计划指定、船舶定位导航以及航行值班、操纵与避碰等；第五章安全：介绍保障海上人命财产安全的SOLAS公约、国际防止船舶造成污染公约内容。",
    "C_course-v1:ZUEL+2019012806X+2019_T1": "《以案说法》课程以我国社会主义法律体系中各部门法的相关基本理论知识和前沿热点难点问题为基础，结合人生各阶段必须面对的问题与挑战，通过典型案例，传授法学理论和法律制度的相关知识。所选案例涉及面广、典型性强，往往是社会上、学术界、司法界广为关注以及和大学生相关并且在大学生中广受关注的案例，涉及法理学、宪法学、刑法学、民法学、经济法学等多个领域。将法学教育理念与通识教育理念紧密结合，努力使学习者在学习法学知识的同时思考人生，培养学习者的法律意识和人文素养，知法、懂法、守法、护法、维权，努力为建设法治中国、实现法治中国梦作出贡献。",
    "C_course-v1:TsinghuaX+80512073X+2019_T1": "这门课程用财务语言解构企业的价值创造过程，从而帮助学习者理解影响价值创造的各种因素，建立财务思维，并具备将其应用于商业决策的能力。借助财务信息，企业的管理者可以进行有效的战略定位、监控和管理企业的经营业绩、制定更有助于与外部投资者沟通的财务政策，以及对并购目标做出评价；政府管理者可以预测未来产业的兴衰变化；投资人可以判断谁将在未来复杂多变的市场中生存下来并发展壮大；证券分析师和投资银行可以评价公司的价值；商业银行可以评估偿债风险并做出贷款决策；咨询公司可以为客户进行竞争分析。这虽然是一门研究生课程，但是学习者不需要具备会计基础。我们将从认识财务报表开始，逐步了解财务信息的架构体系，讨论财务数据与行业、战略定位与战略执行的关系，剖析企业的价值创造过程，在此基础上，讨论如何运用财务数据进行商业决策。",
    "C_course-v1:TsinghuaX+JRFX01+2019_T1": "估值是进行证券投资、私募股权投资、兼并收购等活动的必备技能。本课程以对公司前景的定性分析为基础，从预测未来报表开始，介绍估值的具体步骤和不同方法。我们不关注估值理论，而是注重各种估值模型的具体应用，教你避免估值中的常见错误。本课程为《财务分析与决策》的后续课程，选修本课程需要具备会计的基础知识和分析财务报表的基本技能。大纲：第一周   估值准备第二周   预测报表第三周   自由现金流估值第四周   EVA估值第五周   乘数法估值第六周   关于价值的一些认识",
    "C_course-v1:HEBUT+20180208006+2019_T1": "本课程是基于贡布里希《艺术的故事》美术鉴赏类通识教育课程。通过从史前至20世纪西方艺术发展历程的梳理，使学生了解不同文化和不同时代人的艺术观点，熟悉艺术作品所蕴含的文化价值和时代价值，提高跨文化思维力和评价艺术的洞察力。使学生从追溯宗教、技术和艺术遗产发展脉络的过程中获得丰富的审美体验，并将这种审美体验贯穿于创作、欣赏、消费以及日常生活之中，将自己丰富的情感和创造需求得以释放，唤醒长期被现代文明所抑制的创造性潜能。",
    "C_course-v1:HNU+20180706002+2019_T1": "本课程紧密结合中国近现代的历史实际，通过对有关中国近现代史历史进程、事件和人物的分析，帮助认识近现代中国社会发展和革命、建设和改革的历史进程和内在规律；了解我国的国史、国情，深刻领会历史和人民怎样选择了马克思主义，怎样选择了中国共产党，怎样选择了社会主义道路，怎样选择了改革开放，从而增强我们的历史自信、道路自信",
    "C_course-v1:CSU+25071011201+2019_T1": "分子生物学是生物学领域发展最为迅速且研究成果最为显著的一门学科，是生命科学领域的学生及相关科研工作者的一门重要的专业基础课。该课程主要面向生命科学领域（包括生物科学、医学和农学等）各专业学生，主讲教师全部由教授、副教授或相当职称教师担任。  慕课的出现被喻为教育史上“一次教育风暴”，以慕课形式呈现的该课程打破了传统教学的模式，大规模、自主性、开放性、多元化和个性化的网络课堂满足了不同层次学生的需求，通过教师讲解、PPT播放、动画演示、习题测试和互动答疑等多种方式拓展了课堂，丰富了学习途径，有助于学生高效掌握分子生物学的基础理论知识和技术，熟悉相关发展动态，培养学生科学严谨的思维能力和从事相关科研工作的基本能力，并引导和启发学生创新思维，提高其应用能力，并为其他课程学习和开展相关科研实验奠定坚实的基础。   该课程包括分子生物学基础理论、相关进展和应用分析以及分子生物学技术，注重理论与科研实际的结合。以分子生物学中应用最广和最经典的理论知识和技术作为讲授内容，并进一步重构，保证教学内容的系统性、完整性和科学性。主要讲解分子生物学绪论、染色体病、细胞凋亡的分子机制、单基因病、基因结构与功能、基因表达的表观遗传调控、DNA损伤与修复、基因治疗、蛋白质分子折叠定位和修饰降解、长链非编码RNA、常用组学研究、聚合酶链式反应、蛋白质印迹技术、神经示踪以及遗传修饰动物的设计和应用等，介绍相关基础理论和技术的同时，强调分子生物学在临床科研中的应用。课程相关教学视频和动画图文并茂、生动有趣、难易适中，并建立了课程习题库和试题库，用于学生课堂学习和课后复习及考核，有助学生巩固掌握相关知识，并评估学生对课程知识点的掌握情况，在线互动和答疑有助于课堂延伸和解决相关问题。 考核机制：在完整观看视频后，完成各章测试题，参加期末考核，满分100分，60分及格，85分优秀。 考核要求：需完成全部视频线上学习，且所有章节测试合格（平时成绩60分合格），可参加期末考试。 其中章节测试占总成绩60%，期末在线测试占总成绩40%。",
    "C_course-v1:KMUSTX+8219011+2019_T1": "《理工学术英语》在线课程建设以内容为依托的学习（Content-based Learning）为理论指导，主要内容共分为八个模块：课程导论、学术英语阅读、学术英语写作、学术英语听力、学术英语交流、科技英语翻译、学术英语词汇和科技英语语法。",
    "C_course-v1:BIT+100070018+2019_T1": "Kenneeth Lane Thompson为了方便的玩自己编写的游戏程序，用汇编语言写了UNIX操作系统，又为了更方便的写这个UNIX而创造了C。创造在游戏中产生，业绩在创造中成就！从此，C便一发不可收拾，独领风骚！当计算遇上了困惑，当编程选择了C，当面向问题的计算机程序设计加入了优秀团队，就是这门课程！",
    "C_course-v1:BIT+100070018+2019_T2": "Kenneeth Lane Thompson为了方便的玩自己编写的游戏程序，用汇编语言写了UNIX操作系统，又为了更方便的写这个UNIX而创造了C。创造在游戏中产生，业绩在创造中成就！从此，C便一发不可收拾，独领风骚！当计算遇上了困惑，当编程选择了C，当面向问题的计算机程序设计加入了优秀团队，就是这门课程！                                                                                                 ",
    "C_course-v1:rcoe+mooc103+2019_T1": "本课程结合理论与实践，从宏观和前瞻的角度解读在线教育。由来自清华大学、北京大学、华东师范大学等高校的对在线教育有着深入理论和实践研究的教师主讲，课程全面解读在线教育、回答为什么要做在线教育、详解高校在线教育开展现状、展望在线教育的未来，并通过大量优秀一线教师的实际教学案例带来在线教育实践与经验的分享。",
    "C_course-v1:MIL+MIL2016001+2019_T1": "  课程主要内容包括：朝鲜、俄罗斯、蒙古、哈萨克斯坦、吉尔吉斯斯坦、塔吉克斯坦、阿富汗、印度、巴基斯坦、缅甸、尼泊尔、不丹、老挝、越南14个陆上邻国的国家基本情况。   在亚欧大陆东部，太平洋西岸，矗立着世界上陆地边境线最长，邻国众多的国家----中国。在我们美丽的家园周边，有这样一些国度，“清晨之国”朝鲜、横跨欧亚大陆的俄罗斯、热情奔放的蒙古、世界上最大的内陆国哈萨克斯坦、有着“中亚瑞士”美誉的吉尔吉斯斯坦、有“高山国”之称的塔吉克斯坦、在中亚地区南部起重要屏障和桥梁的阿富汗、“清真之国”巴基斯坦、世界四大文明古国之一--印度、“万佛之国”尼泊尔、亚洲幸福指数最高国度不丹、“佛塔之国”缅甸、中南半岛北部唯一无海岸线的内陆国家老挝、“斗笠之国”越南。这些国度紧贴着我国总长度约2．2万公里的陆地边境线，勾勒出美丽富饶的中华大地，他们与我们只有一步之遥，却又无比神秘。接下来，就让我们一起走进这些神秘的国度。",
    "C_course-v1:TsinghuaX+40160092X+2019_T1": "《生产计划与控制》课程是工业工程专业的核心骨干课程。工业工程师和制造企业管理者必须掌握生产计划与控制方面的基本知识与能力。本课程的主要内容包括：生产运营战略、产品需求预测、库存控制、综合计划、物料需求计划、作业调度、精益生产、约束理论、应对变动。本课程将使你加深对工业生产的理解，强化对生产系统的掌控能力，为“中国制造”由大到强，尽一份自己的力量。",
    "C_course-v1:TsinghuaX+TsinghuaX+2019_T1": "高技术战争是当代高技术发展并应用于军事的产物。近期的局部战争中，美国为首的多国部队和北约组织部队使用的高技术武器装备数量之多、范围之广，综合程度之高，在局部战争史上的空前的，以其区别于传统战争的作战样式、作战手段、作战方法、作战指导和作战理论而成为当代高技术战争比较典型的战例。本课从解析近期高技术局部战争入手，阐述高技术战争的起源、现状、特点及发展趋势，高技术战争对军事革命和世界格局的重要影响，对我国国防和国家安全带来的机遇和挑战。同时介绍我军高技术武器装备的现状及近期发展，我军新时期的军事战略和军事斗争准备等情况。通过学习高技术局部战争课，可以开阔视野、开拓思路，学习军事谋略。关注世界军事科技动态，国际军事斗争情况及对我国安全的影响，提高独立观察、分析、解决问题和在各方面竞争的能力。",
    "C_course-v1:TsinghuaX+00990021X+2019_T1": "通过本课程，了解绿色建筑的基本概念、我国与世界各国绿色建筑发展的历史和现状，以及各国绿色建筑评价体系、标准与政策法规的最新成果。通过分析绿色建筑与技术之间的关系，明晰绿色建筑是与所在地区气候及资源相适宜的技术的优化集成，而非所谓高新、昂贵技术堆砌的产物。通过不同国家的社会文化、地域、资源和气候等条件的差别分析和比较，了解各国绿色建筑发展道路的异同及其原因，认识坚持适合我国国情的绿色建筑发展道路的科学性和必然性。通过大量的国内外案例介绍，展示不同气候和资源条件下绿色建筑成功的技术策略与实践成果。",
    "C_course-v1:GIT+0500002402+2019_T1": "电路原理是电类、信息类专业学生接触的第一门专业基础课，是研究电路理论的入门课程，本课程教学设计基于学生在课程学习中的若干痛点，着力于在讲授中逐步培养学生的观察能力、知识点关键信息挖掘能力、归纳总结和知识应用能力，力求“授之于渔”！同时通过本课程的学习，使学生掌握电路理论基础知识、电路分析方法，具备分析和解决电子、电气工程基础问题的能力，为后续专业课程准备必要的知识储备，对整个专业学习起着至关重要的作用。",
    "C_course-v1:FZXY+20180301001+2019_T1": "晶体光学是研究可见光通过透明矿物晶体时所引起的反射、双折射、全反射、偏光、吸收、干涉和色散等现象及其规律的一门科学，不同矿物具有不同的光学性质，因此，晶体光学是研究和鉴定透明矿物和岩石的基础。晶体光学的基本理论是光率体，应用的仪器是偏光显微镜。本课程的立体概念和实践性较强，它既是一门方法课，又是一门理论联系实践很强的学科。",
    "C_course-v1:CSU+2018020201X+2019_T1": "本课程是大学生提升国际视野和跨文化交流能力的有益阶梯！本课程按主题分模块与你共同探讨英语学习之道。课程内容围绕16大主题展开：大学生活、快餐世界、健康习惯、个人英雄、双语教育、爱情婚姻、金钱问题、太空奥秘、移民问题、灾难应对、书香校园、全球通用语、竞技精神、乐享极限、基因与人格、多样化交流。每个主题的学习包含主题语块（Lexical Chunks)、常用句型（Sentence Patterns）、语篇逻辑（Discourse Logic）和主题探究（Subject Matter Inquiry）等模块，从语言知识传授，到思维逻辑训练，再到思想内容提升，环环相扣，步步晋升。",
    "C_course-v1:SEU+00690803_2+2019_T1": "东南大学以王步高教授主持的大学国文（亦名：大学语文）课程，是同类课程中首门国家精品课程，目前升级为国家资源共享课，其“大学语文教学改革的理论与实践”获2005年国家教学成果二等奖，与课程配套王步高主编的《大学语文》教材，系国家“十五”、“十一五”、“十二五”规划教材，2001年，即获国家优秀教材二等奖，并有精美的课程网站、系列课件与之配套。东南大学大学语文对全国同行长期起着引导与示范作用。2009年起王步高教授又将本课程开进清华大学，是全校学生最欢迎的课程之一。 大学语文MOOC课，与王步高教授主编的《大学语文》国家规划教材配套，开设64节课，为4学分，各校可以选其中部分课时，改为3学分或2学分。其中48课时由王步高教授亲自讲授，其他课程由东南大学教有所长、具有博士学位的教授、副教授讲授。王步高教授长期为全国大学语文的带头人之一，可以组织全国同行为各校提供适当面授、答疑与专家讲座。相信本课程对推动全国高校普遍开设本课程，提高全国大学生的母语水平，起到积极作用。 ",
    "C_course-v1:JNUX+07009156X+2019_T1": "本课程为国家精品在线开放课程！古人云：为人父母者，不知医为不慈；为人儿女者，不知医为不孝。欢迎学习本课程，真正做一个慈孝之人。来吧，每周学习三小时，健康幸福一家人！   本视频课程共10单元，主要内容有两大块：  其一是部分中医理论知识（1阴阳和五行理论、2五脏六腑理论，3气血津液理论，4病因理论等），告诉大家中医说了什么。 其二是中医诊断方法（5问诊、6望诊、7舌诊、8脉诊、9闻诊、10切诊），告诉大家中医是如何运用望闻问切的方法进行诊断的。  中医诊断方法是本课程的学习目的，中医理论知识是为了更好的理解中医诊断方法而做的必要补充。  本课程扩展学习，是针对课程学习中的诊断结果，给出的治疗方案，使本课程不再局限于理论学习，也能让大家将理论运用到实践中。这部分扩展学习将在微信公众号“sunlitcm”中与大家见面。  本课程为学习者提供课程视频、电子讲稿、PPT、习题作业、在线测试、交流互动，以及扩展微信学习，使学习者不仅能够了解中医原理和中医诊断方法，而且能够学会运用适当的中医诊断方法来关注自身的健康以及疾病状况，为自身保健，及就医治疗提供一定依据。  本课程在每周四晚，老师提供直播教学一小时，为你解答学习中的难点和疑点，全程陪伴你学完全部课程。   找个医生做朋友，不如自己就成为懂医的人。让我们一起，进入本课程的学习吧。",
    "C_course-v1:TsinghuaX+10421075X+2019_T1": "微积分学既是近代数学发展的基石，也是现代自然科学、社会科学、管理科学的重要基础。微积分是大学各专业的重要公共基础课，是学习后续课程的必要条件。微积分——极限理论与一元函数主要面向清华大学理工科专业的学生，每学期授课学生超过1100人。微积分——极限理论与一元函数课程的主要内容包括：实数与函数、极限理论、一元函数微分学、一元函数积分学。极限理论部分对闭区间列紧性和实数完备性的介绍值得期待。微分学部分介绍了连续、导数、微分、导数应用等基本内容。积分学部分介绍了不定积分和定积分的内容，重点强调了定积分的思想和基本积分法。",
    "C_course-v1:TsinghuaX+60510102X+2019_T1": "《创办新企业》是由清华科技园和清华大学经管学院联合开设的系列创业教育课程，该课程开办5期以来，选课的120支团队中已有半数以上成立公司，通过课程直接或间接获得投资的团队超过20个，融资总额超过1亿元。2014年，《创办新企业》已经被中关村管委会授予“中关村（清华）梦想课堂”的称号。《创办新企业》不仅仅是一门课程，更像是一种“创新型的孵化器”。线下选课的团队需要通过面试选拔，期中和期末的汇报以路演的形式进行，评委不单由老师组成，还有行业专家和投资人，他们的建议和指导可能对团队未来的发展更为有用。此外，本课程设立首期金额为2000万元人民币“创业很行”孵化基金，用于投资遴选出的优秀创业团队及其商业计划，引导和组合其他风险投资公司的投资，并配以专业投资人提供后续辅导，帮助团队更好、更快地实现他们的创业梦想。该课程不仅把创办新企业面临的主要问题作为课程探讨的核心，而且把创办新企业需要的资源作为课程的基础。于本课程的教学相配合，课程教师来自大学和实业，为学生创业提供包括知识、技能和资源上的帮助。同时，课程的内容也在不断调整与优化，针对创业团队的“痛点”可以“对症下药”。此外，本课程为所有参加《创办新企业》课程的创业团队搭建交流与分享的平台---“创业行”社区，通过定期组织沙龙等活动对历届同学保持持续的关注与交流。",
    "C_course-v1:TsinghuaX+10421084X+2019_T1": "微积分学既是近代数学发展的基石，也是现代自然科学、社会科学、管理科学的重要基础。微积分是大学各专业的重要公共基础课，是学习后续课程的必要条件。微积分——多元函数与重积分主要面向清华大学理工科专业的学生，每学期授课学生超过1100人。微积分——多元函数与重积分课程的主要内容包括：多元函数微分学、多元函数微分学的应用、重积分及其简单应用、曲线积分与曲面积分、常微分方程。本门课程在制作过程中得到了Google公司的资助，特此鸣谢。",
    "C_course-v1:TsinghuaX+60610231+2019_T1": "《工程伦理》课程有着广泛的社会需求：先从《华盛顿协议》谈起   1989年来自美国、英国、加拿大、爱尔兰、澳大利亚、新西兰6个国家的民间工程专业团体发起和签署《华盛顿协议》，针对国际本科工程学历资格互认，工程伦理教育被纳入工程专业教育认证的制度体系中，2016年6月2日中国成为国际本科工程学位互认协议《华盛顿协议》的正式会员。再谈“美国注册工程师”    1996年开始，美国注册工程师考试将工程伦理纳入“工程基础”考试范围。美国国家工程院的报告指出，“伦理标准是未来工程师具备的基本素质之一”。最重要的是培养面向未来、面向世界的中国工程师    中国当前的“一带一路”、“中国制造2025”建设，需要有跨文化、全球视野的大量工程师人才，需要工程师具备在不同文化下的工程伦理规范意识。   鉴于此，工程伦理教育受到工程界、教育界和政府相关部门的高度关注，在工程教育中全面推进工程伦理教育成为各界共识，在2015年全国工程专业学位研究生教育指导委员组织清华大学、北京理工大学、北京协和医学院、大连理工大学、浙江大学等多所院校的十几位专家合作编写了《工程伦理》教材同时录制相关的MOOC课程。   该课程不同于传统的工程伦理理论教育，突出强调了工程伦理的实践性。在具体的工程实践中，由于工程活动的复杂性和不确定性，工程师还需要培养良好的工程决策能力，既要把伦理意识和伦理规范具体落实到解决工程实践面临的伦理问题上。由此，工程伦理教育的目标除了培养工程师的工程伦理意识和责任感，引导其掌握工程伦理的基本规范，还需要通过工程伦理教育，提高工程师的工程伦理决策能力，故课程从工程职业伦理和工程实践中的伦理问题两个方面构建课程体系，课程分为“通论”（MOOC课程为《工程职业伦理》）和“分论”（MOOC课程为《工程实践与伦理决策》）两个部分。课程立足于面向中国社会、面向中国现实、面向中国未来。",
    "C_course-v1:BNU+2017053101X+2019_T1": "所有研究生必须培养其科研与学术的“底线意识”，即遵守科研伦理与学术规范。本课程有助于学生规避学术风险，提高科研规范性，为严谨扎实从事科研工作打好基础。",
    "C_course-v1:BJTU+2017052601X+2019_T1": "本课程讲述18世纪以来的工业革命的发展和重要领域的技术变革，总结前三次工业革命的历史经验，重点讲技术创新人物故事的技术人文历史、技术创新对社会影响的技术社会史，以及揭示为什么技术创新会发生的技术创新思想史。通过该课程给学生以启示，引发对历次工业革命的思考，展开第四次工业革命对人类的影响的学习与讨论。",
    "C_course-v1:TsinghuaX+30803273X+2019_T1": "中国工笔画艺术是学习中国民族优秀绘画重要的课程之一。本门课程将设艺术欣赏课与艺术创作课两大部分。一、艺术赏析课将带领大家欣赏中国历代工笔人物名作，对中国工笔人物画产生的历史背景、文化思想、艺术理论及艺术表现方法进行深入阐述，提高对中国工笔人物画的认识和欣赏能力，并设临摹课，掌握传统工笔画的工具使用及表现技法。二、艺术创作课将讲解中国工笔画创作的全过程，从观察生活、体验生活、收集创作素材、构思构图、色彩构成、意境的表现作系统的讲述，同时演示写生、勾线、着色的基本方法，使大家由浅入深系统地掌握工笔人物画从写生到创作的全过程。通过本课程的学习，不仅使文科和艺术学专业的学习者能够提高艺术欣赏和创作能力，也使工科和理工科专业的学习者提高艺术修养，了解掌握写生能力及创造性的思维能力，促进文理渗透，培养具有更高人文素质的全面人才。此课的受众面为本科生、研究生及对中国传统工笔画艺术有研究兴趣的爱好者。准备工具：素描纸、熟宣、勾线笔、大／小白云、铅笔、墨块、砚、国画颜料、胶矾、毛毡",
    "C_course-v1:TsinghuaX+40670702X+2019_T1": "本课程的核心内容是学习摄像机和编辑系统的使用，学习摄影构图和电视编辑的规律，要求学生熟悉和掌握视听语言，在此基础上进一步学习电视新闻、纪录片、微电影等各种视频形态的制作。期间通过WORKSHOP、作品分析等方式，让学生亲身感受和亲自制作视频作品，鼓励学生以作品参加海内外的各种评奖。 ",
    "C_course-v1:FAFU+20180919X+2019_T1": "积极心理学家倡导发掘人们潜在的积极力量，并提出了六大美德、24项积极心理品质，其中“乐商”是积极品质的核心内容。所谓乐商（Optimistic Intelligence）不仅仅指一个人乐观水平的高低，它还指个体从所经历的消极事件中读出积极以及影响、帮助、感染他人变乐观的能力。乐商是一种创造令人愉悦、有趣的沟通内容和氛围的能力，是高深的社交生产力。研究表明，高乐商不仅有利于个体的社会性发展、获得稳定的幸福感、提高人的生理健康水平、提高学业成绩，而且高乐商还有利于促使个体寻求社会支持和社会交往。乐商对话这门课程既不是传统的专业课，也并非严肃的学术讲堂，而是一门传播如何科学提高乐商的实用教程，包括与乐商密切相关的心理、道德和人格品质等内容，具体涉及到自我认同、意志力、幽默、道德、共情以及人生格局等主题，每一讲都会有两到三位教师共同剖析相关理论、讨论当下热点、分享最新研究，目的是让同学们在“寓教于乐”的授课方式中掌握塑造积极自我的新技能！",
    "C_course-v1:TsinghuaX+20740042X+2019_T1": "面对着纷繁复杂、层出不穷的软硬件，你是否想了解这些背后万变不离其宗的基本原理？生活在机遇与挑战并存的信息时代，各种新技术和新名词铺天盖地涌现，有些成功引领了行业潮流，而有些只是昙花一现的噱头，你是否很想知道如何“未卜先知”地去鉴别？当智能计算设备已成为现代人生活不可或缺的组件，计算机文化渗透到社会的方方面面，你是否想更好地融入这种文化氛围？信息爆炸催生了网络时代的快节奏模式：今天的流行语到明天可能就会变成老掉牙的梗，今天的新潮设备到明天可能就会变成过时产品。在这种环境下，把握信息技术发展的大方向，从宏观上对当前的时代有一个全面而直观的认识，在扑朔迷离的信息时代找准自己的定位，也许对你而言，比掌握某个软件的使用方法要实用得多。这是一门以生机勃勃的信息技术为内容载体，为各领域的专业人才铺垫坚实的信息素养的公共基础课程。在大学里，这是一门面向全校各专业各年级的公共基础课。无论你是一名电脑“小白”，希望学习图像处理软件来制作海报；还是一名百万行代码量级的编程高手，渴望以新的视角了解1和0之外的世界；或者你正在从事与计算机几乎完全无关的工作（这样的工作还存在吗？），迫于潮流想对当下的信息技术有个全面系统而深入浅出的了解……无论出于什么目的，相信你都能从这门课中得到属于你的收获。这门课可以看作是计算机世界的“概论课”，采用全新的课程理念和教学模式，内容精彩，特征鲜明。与传统课程相比，本课程最大的特点在于讲授主体不只是学校教师，还有信息技术各相关领域的专家学者，他们都会根据自己的独特经历，以全新视角为你讲述不同的计算机世界；而我们的授课内容也远远不只是说教式的、冷冰冰的书本知识，更有与生活密切相关的、活灵活现的案例与故事。此外，由于信息技术发展极为迅速，所以本课程没有特定的教材（书籍出版会非常滞后），而且会不断更新内容，力图展现最新颖、最前沿、最符合时代潮流的内容。不仅如此，本课程还立足于“文化”视点，努力尝试将深刻影响人类社会的信息技术讲出“文化”的味道，让受众建立起普适的计算思维。 ",
    "C_course-v1:TsinghuaX+20440333X+2019_T1": "有机化学是化学科学中极为重要的一个分支，也是最有魅力的基础学科之一。主要内容包括各类有机化合物的命名、结构特征、物理性质、化学性质、用途、来源和制备方法。根据有机化合物结构的不同，可以将其划分为烷烃，烯烃，炔烃，芳烃，卤代烃，醇，酚，醚，醛，酮，羧酸，羧酸衍生物，胺类，硝基化合物，杂环化合物等，本课程将会分章节地对这些化合物的结构，性质，化学反应及制备方法等进行详细介绍。重点介绍一些基本反应类型，如取代反应、加成反应、消除反应、重排反应、氧化还原反应等的反应机理、反应条件和影响因素、应用范围。此外，还详细介绍有机结构理论，建立各类化合物的结构与反应性的关系；有机分子的立体化学基本概念；以及有机化合物的结构鉴定方法等。",
    "C_course-v1:FJTCM+20180622001+2019_T1": "本课程适用于课程既适合中医学、中西医、康复、卫生管理、计算机科学等相关专业学生学习，更适合计算机信息管理、医疗技术专业学生作为中医及健康素质教育类课程选学。课程以中国古代医学的发展演变历程为轴，以中国名医的治未病的应用为节点，介绍了不同时期，我国古代医学家的风格特色、选材用料、造型结构等知识。授课内容多以深受学生喜闻乐见的古代中医文化作为案例或者课程导入，如《黄帝内经》认识疾病采用以脏腑、经络或疾因等为纲领的理论等，成为中医学发展的理论和源泉，被历代医家称为“医家之宗”，同时也是古人长寿，养生所遵循的养生宝典。调动学生的学习兴趣。我国古代对健康信息学的智慧贡献。此外，可以在中医药及信息管理专业学生中进行创新实践教学。《健康信息学》创新实践教学内容，可以作为中医药大学及相关院校教育的重要组成部分。内容通俗易懂，信息量大，基本包括了当今信息技术在医疗领域发展的最新前沿技术。",
    "C_course-v1:GZHU+20180718001+2019_T1": "  在计算机屏幕上作出的几何图形，如果在变化和运动中能保持其几何关系不变，就叫做动态几何图形。有关动态几何图形的理论和应用的学科，就是动态几何。  本课程以我国自主研发的动态几何软件——超级画板为工具平台，利用动画、跟踪、轨迹、测量、变换、迭代、编程、运算、自动推理等功能，通过丰富的中小学及大学数学经典实例，动态呈现了平面几何、函数图像、解析几何、立体几何、概率统计等的数学知识内容。动态几何把几何图形动起来，使得几何不仅能锻炼逻辑思维能力及空间想象能力，更能产生奇妙的逻辑动漫，让数学变得更直观、更好玩、更有趣。  本课程是一个计算机与数学交叉的全新世界：有斑斓的图形轨迹、迷人的平面镶嵌、奇妙的分形世界、出人意料的自然曲线、离奇的数学实验，可以看到数学与艺术的汇合与交融，欣赏卓越而完美的数学公式。",
    "C_course-v1:SichuanU+302074030+2019_T1": "《机械原理》是一门学习与机械系统运动方案设计相关的基础知识的课程，是机械类相关专业必修的一门重要的技术基础课。是研究机器和机构共性理论与设计方法的学科。在整个机械类相关专业的教学计划中，以主干课程的角色，起着承上启下的作用，具有十分重要的地位。本课程教学目标旨在以机构的运动设计、机械的动力设计和机械系统方案设计的基本知识为载体，培养学生机械系统方案创新设计的思维方式和方法，以及机械系统方案的综合设计能力、创新设计能力和工程实践能力。课程主要内容包括：机构结构分析的基本知识、机构的运动分析方法、机器动力学的基本知识、常用机构——齿轮机构、凸轮机构、连杆机构等的分析与设计等。   本课程所用教材为高等教育出版社孙桓主编机械原理第八版。",
    "C_course-v1:DYU+dyuwgzbbm+2019_T1": "财务报表是公司与投资大众之沟通工具。公司传达他们的经营绩效给公司外部人士，供信息用户了解公司的状况。学会计阅读财务报表对任何需运用财务信息做决策的信息用户而言是必要之要求。本课程之主要目的在提供容易阅读财务报表的方法给企业财务信息之潜在用户，如投资大众、债权人、公司员工和其他利害关系人（如供货商，客户），逐步引导财务报表使用者进入财务报表世界。本课程着重于如何理解公司各项活动造成报表的变化，首先教导财务报表使用者学会「望」字诀，懂外部经济活动之脉动变化之影响，例如：全球经济变化。第二，引导财务报表使用者学「闻」字诀，让使用者理解产业变化对财务报表影响。第三，指引财务报表使用者学习「问」字诀，可以看到财务报表数字时问自己数字背后代表之意义。第四，最后教导财务报表使用者学习「切」字诀，让财务报表使用者拿到财务报表时，即可理解公司究竟发生什么事，如何处理这些问题。本门课程针对三大主要财务报表之呈现方式与表达意涵。学员将学习到未来进行财务分析应注意之会计变动影响情况，及理解会计信息受会计处理变更之影响幅度。除此之外，学员还将可学习到会计准则、和公司管理与奖励制度如何影响财务报告程序。",
    "C_course-v1:NCTU+wym+2019_T1": "世上的土匪何其多，最难缠的土匪就窝藏在你心底。清末民初的中国，正面临着各种内忧外患，不论是维新派的梁启超，或者革命派的孙中山，无不深受王阳明的影响，并从阳明学思想里汲取灵感的泉源，提出改革社会的新主张。王阳明自己说：「破山中贼易，破心中贼难。」他打一辈子的土匪，同时讲一辈子的心学，有人视他为战神，有人说他是圣人，他却说满街都是圣人，人只有先做个豪杰，才有可能当第一流人，做第一等事。这门课要告诉你王阳明怎么打土匪，更要告诉你土匪窝藏在你心里什么角落。本课程总共8周，课程每周2小时，每小时各有4个单元，第四周为期中考，第八周为期末考周，内容具有跨领域与跨两岸的性质，适合关注历史、心理、哲学与管理的人来学习，本课程是雅俗共赏的通识课，除欢迎在学学生与社会人士学习外，更欢迎对心理咨询与生命教育有学习意愿的人士注册学习本课程，并期待台湾与大陆关注心学如何滋补生命的伙伴都来欢聚一堂，裨益本课程成为海峡两岸华人共同探索生命教育的热门课程，并帮忙打响磨课师教学平台作为发展华人本土学术的优质品牌，期待你我共同来跟着王阳明这个传奇人做的传奇事，上山下海打土匪！期待学生在学习完本课程后，能认识下面5项教学目的：1.认识王阳明波澜壮阔的生命。2.认识心学在东亚发展的历史。3.认识自己人生的座标与意义。4.认识面对人与人关系的奥秘。5.认识解决管理问题的新思维。 ",
    "C_course-v1:BNU+ENV13018+2019_T1": "大地苍茫，花儿该在哪里芬芳？川流不息，鱼儿如何搏击风浪？风云变幻，鸟儿能否自由翱翔？千百年来，自然以其神秘的力量指挥着万物的和谐生长，近现代后，人类发挥无穷的智慧影响了自然的发展方向。纵于求难免消耗殆尽，慎于行方能锦上添花。在发展中探索，在探索中优化，让每一寸土地承载应有的瑰丽，由每一条河流哺育生命的奇迹，还每一缕微风沁人心脾的呼吸！尊重环境、合理规划，我们一起指点江山！",
    "C_course-v1:BNU+2018122405X+2019_T1": "本课程面向广大艺术类和非艺术类专业的学生开设，以中国传统舞蹈艺术的赏析为出发点，帮助学生了解中国传统舞蹈的文化背景、表现方式和经久不衰的艺术魅力，以舞蹈史论学习辅助学习者进一步了解舞蹈艺术的发展脉络与表演特点。让学生在感受中外舞蹈迥异的韵感、欣赏各舞种独特的表现风格的同时，领会中外舞蹈的文化底蕴和审美精神，调发自身对舞蹈情感和舞蹈美的真实体验。该课程以中国传统舞蹈艺术的赏析为出发点，涵盖民族民间舞蹈、古典舞蹈等。以及西方的芭蕾舞、代表性舞蹈。通过老师的讲述和表演学生的示范，让学习者初步了解中国传统舞蹈的文化背景、表现方式和艺术价值，并与国外的舞蹈进行对比性学习。同时，课程涵盖舞蹈知识理论的学习，例如：拉班动作分析理论的讲授与表演性示范，中外舞蹈史论的讲述与舞蹈片欣赏。学习者可以通过理论的学习更加了解舞蹈艺术的表演特质和不同形式的表现方法。",
    "C_course-v1:BNU+2017071001X+2019_T1": "通过环境地学原理学习，使我们了解地球环境系统的组成结构与性状特征，掌握地球环境系统物质能量迁移转化及其时空分异规律，其主要作用有：熟悉地球环境调查观测的基本方法，培养我们的综合思维与集成创新能力；为环境科学与工程学习、研究的奠定必要的地学基础；有利于开拓环境科学与工程的研究领域；也有利于和谐与健康地生活。课程考核方式：平时成绩100%",
    "C_course-v1:TsinghuaX+40130753+2019_T1": "本课程包括以下5部分内容：1.仪器设计方法： 1）.仪器设计方法：介绍仪器设计发展趋势，仪器组成，分类等； 2）.误差理论：误差传递与分析，误差分配等，重点介绍阿贝误差； 3）.仪器设计原则：重点介绍阿贝原则和光学自适应原则。 2.仪器总体设计：以典型仪器为例，介绍该仪器的发展，关键技术，和总体设计需要考虑的问题。 1）.观测仪器，以显微镜为主介绍，包括相衬显微成像，高分辨荧光显微成像等。 2）.计量仪器，以干涉仪为主介绍，包括大尺寸测量，纳米测量等 3）.分析仪器，以光谱仪为主介绍，包括色散光谱仪和傅立叶变换光谱仪。 3.仪器关键部件 1）.标准器，介绍标准溯源，标准器种类，安装和调试，重点介绍光栅尺； 2）.纵向瞄准（调焦）：重点介绍共焦测量，介绍双路探测和外差探测的特点； 3）.横向瞄准，重点介绍光刻中的对准技术，以及几何量测量中的一些对准技术。 4. 典型仪器发展趋势：与一些专业的仪器厂家访谈，讨论仪器现状和发展趋势。 5. 实验：1）以光学计量仪器为例，介绍一些光学实验的基本技巧、方法。2）在讨论相机的调焦、调光等基础知识之后，介绍照片的一些拍摄技巧，以及简单的后期制作。",
    "C_course-v1:BNU+2018122601X+2019_T1": "什么是意象？意象是心中有、口中无，若隐若现、传达不出来的那点意思。意在象中，意在言外。象是一个载体，意是那种诗情。以“意象”为突破口，抓住“意象”这个中国诗词的密码，就能解开古典诗词中优美意境的由来。本课程打破以往诗词课程以时间线索或者人物线索的讲授方式，从古典诗词的意象入手，分别从“春”、“秋”、“明月”、“斜阳”、“田园”、“酒”六个角度进行讲解，带领大家走近诗词、读懂诗词、书写诗词。",
    "C_course-v1:CUC+2018081702X+2019_T1": "本课程从概念与实务、类型与变迁、应用与技巧等方面着手，同时兼顾理论普及与实践技能，由中国传媒大学新闻传播学部吴炜华教授、顾洁副教授、付晓光副教授及郑志亮讲师共同讲授。课程旨在让同学们对新媒体概念与历史形态有更清晰的了解，掌握新媒体产业与新型文化形态的词汇使用、发展趋势及内涵背景；同时能对新媒体发编创的本土与国际情况有所了解，能灵活机动地将新媒体概念与广播电视学、编辑出版学的研究及自己的专业相结合，并能借用新媒体编创的重要概念，完成新媒体项目的设计与制作。",
    "C_course-v1:BNU+CHE21128011+2019_T1": "以量子化学计算为基础的计算化学已经成为化学学科的一个重要分支，理论计算对化学问题能够帮助研究人员更深入定量地理解化学过程。通过本门课程的学习，同学们将掌握计算化学的基本理论和应用。",
    "C_course-v1:MITx+15_671x+2019_T1": "在这个90分钟的入门课程中，探索基于觉察的系统创变和向正在生成的未来学习的方法论，并了解这个理论框架和实践方法如何支持个人、组织和社群把面向未来的灵感落地生根，转变为对这个世界和自我的真实改变。 完成这个商业管理课程，你会掌握U型理论的基础知识，学会一种引领深刻创变的方法，是过去20多年MIT行动研究员、以及世界范围内的跨界领导和实践者共同的结晶。 你也会由此参与到一个全球创变共同体，在跨界、跨文化和地域的创变中共创基于觉察的系统变革。 这个课程是一个U型理论的入门课。如果想要进一步了解掌握如何在你所感兴趣的领域里应用U型理论，可以继续学习u.lab 1x的课程：http://www.xuetangx.com/courses/course-v1:MITx+15_671_1X+2016_T2/about 你会学习和掌握： U型理论基础 最重要的领导力素养：自我认知 ",
    "C_course-v1:TsinghuaX+00680142X+2019_T1": "儒家修身之道是日常生活的哲学或学问，是过去中国人教育中最重要的基础课。它既不依赖逻辑思辨，也不以“致虚极守静笃”为主。它让我们在当下生活中学习，设置了一个世界上独一无二的修学体系，完善人格，发展洞见的智慧，同时又提供了超越的可能，超越个人和自我，服务社会传承文明，成圣成道皆由之。清华大学的儒家修身之道教学是以儒家经典《大学》《中庸》的修身部分为主，上承尧舜禹执中心法，下接宋明的阐发。为使学生能学以致用，教学中重新解释了传统，结合现实社会生活中的各种精神问题，借用现代心理学中的概念沟通儒学心法和当下现实问题，还补充了一些相关的传统中医哲学，在100年前修身的学问与医学哲学是紧密结合的。因此为学生提供了对身心、道德、情绪等扎实的知识基础和丰富的应用。我们有信心：你能自强不息，也能厚德载物。",
    "C_course-v1:MITx+15_671_1X+2019_T1": "我们生活在一个充满变革和不确定性的时代。如何唤醒我们“向正在生成的未来学习”的能力，可能是我们这个时代至关重要的领导力。在面对评判、愤怒和恐惧时，如何培养好奇、同理和勇气？u.lab 1x为我们介绍来自于MIT的U型理论，来指导全球跨政商社学的领导者引领属于未来的创变。这门u.lab 1x课程有一门必修的入门预备课程，u.lab 0x （http://www.xuetangx.com/courses/course-v1:MITx+15_671x+sp/about），由总长为90分钟的一系列视频组成，会为你的1x学习奠定基础和设定意愿。u.lab 1x会帮助你把U型理论的方法论运用到一个你感兴趣的问题和领域，和你周围以及全球的创变者一起共创你想要看到的改变。和我们一起行动吧，参与到这个世界领先的线上线下共创中，共同面对和引领在社会、环境等领域中的挑战和创变。你会学习和掌握：最重要的领导力素养：自我认知深度聆听、精准观察和感知以及有效对话的能力跨界系统创变的实践方法，共创社会福祉课程大纲第0周：u.lab 1x 简介如何在这个课程中运用线上和线下的不同元素。第1周：共同启动当今全球的各类挑战中，看到更深层次的根源。学习深度聆听的艺术和实践。为你的U之旅召集核心团队。第2周：共同感知（第一部分）通过“暂悬”和“聆听”来收集数据。参与线下感知之旅以及利益相关者访谈。第3周：共同感知（第二部分）学习如何把上周收集来的数据进行意义构建，通过“社会大剧院（SocialPresencing Theater）”调动身体智慧等方法。第4周：自然流现（Presencing）退省和反思。学习如何允许内在更深层次的觉知涌现；如何与未来可能性连接，需要通过我们的共创来使其变为现实。第5周：结晶保持与你灵感更深层次的源头连接。学习如何关注现实，方可将你的想法结晶为现实。第6周：原型通过行动来学习。通过快速迭代，获得原型的反馈来进化和发展你的灵感和想法。第7周：共同进化：继续原型迭代，学习核心原则，让你从产生想法、原型迭代，去到在更大的系统中形成规模化解决方案。第8周：全球创变踏上通往未来的u.lab 旅程。在全球范围内从u.lab 1x中涌现出了什么？需要什么才会让我们继续向前？",
    "C_course-v1:UC_BerkeleyX+ColWri2_1x_2015_T1+2019_T1": "本课程专为英语学习者打造，是针对为英语语言学习者的写作入门课程，主要关注短文写作、语法使用和自我检查。课程分为三个部分，共15周，每个部分5周。这是“写作入门”部分。本部分将介绍基本语法及其理解；如何撰写句子和段落；如何撰写引言和结论；撰写较长文本的策略，以及篇章主题。课程包含阅读材料和视频。课程中将使用电子格式的课程练习簿进行额外的写作练习。学生将就自己的写作参与在线讨论和同学互审。在课程本环节学生需要完成一篇完整的论文。",
    "C_course-v1:XJTU+CHEM330109+2019_T1": "  “简明有机化学”先修课是为了适应新形势下的教学改革和社会对人才选拔的强烈需求而设计开发的在线课程。本课程属于中国大学先修课（CAP）“学术志趣类”课程，已获得西安交通大学学分认证。通过在线课程学习的同学，可凭“课程合格证书”向西安交通大学提交学分认证申请。学分认证的申请流程和具体分数要求由高校教务处根据本校情况制订。  本课程要求学生掌握有机化合物的结构、命名、性质、官能团的相互转化和立体化学特征，熟悉典型的有机化学反应及其机理，了解各类有机化合物性质及其应用。完成该课程能使学生系统地掌握有机化学的基本知识、基本理论、基本方法及基本实验技能，让学生受到科学思维的良好训练，提高分析和解决问题的能力，为进一步的学习打下坚实基础。  课程在西安交通大学讲授时间为授课64学时+实验32学时，授课对象为大学一、二年级本科生，人数约为300人/届，学生学习效果良好，对该课程评价较高。完成本课程的学习者可达到对应大学课程的同等水平。   建设本课程的项目组教师包括：唐玉海、张雯、徐四龙、王丽娟、刘芸、靳菊情、许昭、李洋、卓颖、李健军、邢丽丽、张军杰、向丹。此外，特别感谢周桂江、段新华、张彦峰、孙杨、郑阿群、杨晓龙、樊超、赵江等老师参与制作本课程，感谢梁琼文、陈思宇、周天阳、蒲元春等同学的友情支持，最后感谢西安交通大学网络学院为本课程录制提供技术支持。 ",
    "C_course-v1:BNU+0210021441+2019_T1": "本课程是一门帮助你了解各种专业管理知识的基础课程。本课程采用了别具一格视角，通过讲述管理学概论（概念、原理、决策、组织文化等）、管理个体、管理人际、管理团队、管理组织、管理学进展、中国传统文化与管理等内容，着重从现实工作与生活的角度出发，通俗易懂，能够使学生系统地掌握管理活动的普遍规律、基本原理和一般方法，树立现代管理的思想观念，培养管理者的素质，为其他管理学专业课程的学习和成为一名“懂得管理的人”打好基础，是理论性与实践性较强的专业基础课程。课程采用视频讲课、随堂练习、课后思考一体化的教学方式，增强学生对于管理学知识的理解和掌握，锻炼学生的团队思维、交流表达和获取新知识能力、新技能综合素质，培养中、基层管理岗位的综合管理技能。",
    "C_course-v1:NCTU+lhtl+2019_T1": "各位同学好：我们的大脑拥有惊人的学习能力，然而，你的手上并没有一本给你参考的大脑使用手册。在这个依赖专业知识生存的数位时代，自学能力越来越重要，但是：我们应如何善用大脑的特性，来提升学习的品质？讯息的呈现，会影响我们学习的成效吗？如何将学习材料分成适当的概念组块，牢牢记住，还降低遗忘的速度？我们该怎么看待自己的学习失败，并加强自我效能？如何找出自以为懂，其实不懂的知识并做加强？每个人都有拖延的毛病，有方法可以改善吗？《礼记‧学记篇》说「学学半」。那么，教学相长，有科学证据吗？面对大量的文字资讯，21世纪的我们如何有效率的阅读与写作？你可能听过聪明药丸，该不该上网买一罐来吃吃看？大家都从报章杂志看到关于大脑的报导，但你知道哪些常识根本是无稽之谈吗？或许你可能数学和理科学得不够好的大学生，或是在文史法哲课里痛苦背诵，过没多久却还是一样忘光光的高中生，还是为了培养第二专长而必须开发出一颗科学脑袋的专业人士，或者是退休之后，终于有时间学习自己喜欢事物的长者，这门课都会是让你具备终身学习能力的好帮手。「学会学」由美国奥克兰大学工业系统工程学系的Barbara Oakley教授、加州Salk 生物研究院Terry Sejnowski 教授，中国科学院，上海神经科学研究所的蒲慕明院士教授，以及我，交通大学教育研究所陈铿任教授，跨海通力合作，为中文世界的华人学生，将英文版的Learning how to Learn ，扩展为「学会学：学习之道」这门课。我们四位将从脑神经科学和认知心理的知识出发，提供有效的学习方法，并分享立即可用的具体步骤。这门课，要让你领会学习是什么；了解自己的学习动机与成败归因；找到好的作法来加强吸收知识；运用高效的阅读策略与读书方法；最后从教学相长中，看见自学的重要价值。欢迎加入「学会学：学习之道」，我们线上见！",
    "C_course-v1:TsinghuaX+2018031601X+2019_T1": "课程同时面向清华学生、校外人士和国外人士。除了“课程引言”、“课程结语”和第一讲“党的十九大精神的载体”，课程的主体内容依据《中共中央关于认真学习宣传贯彻党的十九大精神的决定》分为十个部分：一是深刻领会党的十九大的主题；二是深刻领会十八大以来党和国家事业发生的历史性变革；三是深刻领会中国特色社会主义进入新时代这个重大论断；四是深刻领会我国社会主要矛盾的变化；五是深刻领会新时代中国共产党的历史使命；六是深刻领会新时代中国特色社会主义的战略安排；七是深刻领会社会主义经济建设、政治建设、文化建设、社会建设、生态文明建设等方面的重大部署；八是深刻领会国防和军队建设、港澳台工作、外交工作的重大部署，九是深刻领会坚定不移全面从严治党的重大部署，十是深刻领会习近平新时代中国特色社会主义思想的精神实质和丰富内涵（压轴和总结）。考核机制：除视频学习外，本课每一讲均设置章节测试题，共12套题目，每套10分，选取得分最高的10次相加，为总成绩，60分合格，85分优秀",
    "C_course-v1:TsinghuaX+20190222+2019_T1": "是主要从形态学角度探究疾病的医学基础学科。通过观察研究患病机体的形态变化，结合机能和代谢的改变，阐明疾病发生发展的基本规律，揭示疾病本质，被誉为医生的医生。",
    "C_course-v1:TsinghuaX+THU201607+2019_T1": "我们将从热力学四个基本假设出发推导经典热力学的规律与结论，即所有的热力学基本定律均构筑在基于日常经验的少量基本假设之上。这些热力学基本定律将进一步帮助我们解决与体系平衡性质相关的实际问题（包括现代化学工程、材料工程和生物工程之中的科学与工程问题）。课程主要内容如下：0. 前言1. 热力学基本假设 2. 热力学第一定律 3. 热力学第二定律 4. 热力学基本方程 5. 平衡 6. 稳定 7. 纯物质和混合物热力学性质计算 8. 非电解质溶液 9. 电解质溶液 10. 热机和能量循环 11. 相平衡 12. 化学平衡 13. 非简单系统 14. 表面与界面 ",
    "C_course-v1:TsinghuaX+70340063X+2019_T1": "我们将从热力学四个基本假设出发推导经典热力学的规律与结论，即所有的热力学基本定律均构筑在基于日常经验的少量基本假设之上。这些热力学基本定律将进一步帮助我们解决与体系平衡性质相关的实际问题（包括现代化学工程、材料工程和生物工程之中的科学与工程问题）。课程主要内容如下：0. 前言1.热力学基本假设2.热力学第一定律3.热力学第二定律4.热力学基本方程5.平衡6.稳定7.纯物质和混合物热力学性质计算8.非电解质溶液9.电解质溶液10.热机和能量循环11.相平衡12.化学平衡13.非简单系统14.表面与界面",
    "C_course-v1:XJTU+C00204+2019_T1": "课程内容： 本课分十个专题，分别介绍《周易》的思想、孔子《论语》的思想、老子《道德经》的思想，《大学》《中庸》的思想，《庄子》的思想，《孙子兵法》的思想，《墨经》的思想，《心经》的思想，以及朱熹理学的思想、王阳明《传习录》的思想。既有对儒释道经典的介绍，也有对理学、心学思想的阐释，以期以一种更广阔的视角看待中国传统哲学，让学生能够对中国传统哲学有一种全方位的认识。课程连续多次被Coursera评为最受中文学习者欢迎的8门课程之一。该课程项目出版教材《中国哲学经典著作导读》一部，发表论文多篇。以该课程为主体的《中西哲学经典著作导读》2014年被评为全国优秀通选课、陕西省级视频资源共享课。 ",
    "C_course-v1:HUBU+HU08001X+2019_T1": "工程制图是研究工程技术领域中有关图的理论及应用的学科。当你有新奇的想法，想做个小发明、小创造，是不是苦于文字叙述不清，那怎么办呢?这就需要借助图形来表达你的设计思想，并按图加工制造出来。工程图样，就是工程界通用语言，是表达、交流信息的工具，适用广泛。当你进入工程制图课程的学习，你就可以学到投影理论的方法，可以掌握物体的几何构成和表达方法，你可以进行工程图样的绘制和阅读。从而培养空间想象能力，培养分析综合能力；培养表达物体能力；培养工程思维，养成严谨工作作风。为今后的职业能力提升奠定基础。",
    "C_course-v1:SichuanU+306197030+2019_T1": "“土力学”课程在重点讲解土力学基本概念、基本原理和方法的同时，将土力学的工程应用贯穿于整个课程，同时适当介绍学科的最新成果和发展动态，使该课程的科学性、前沿性、实用性融为一体。该课程主要介绍土的基本性质、土力学基本原理及其应用，包括土的物理性质及工程分类、土中的应力及有效应力原理、土的渗透性及渗透稳定性、土的压缩性及地基的沉降和固结计算、土的抗剪强度、填土的压实及其工程性质、土压力及挡土墙、土坡稳定性分析、地基承载力等内容。本课程是四川省省级精品资源共享课以及省级精品在线开放课程。在校内授课时间为48~56学时，其中包括40~46个理论授课学生和8~10个试验课学时。校内授课对象为水利水电工程、土木工程、农业水利工程的本科学生，每届300~350人。土力学课程的内容非常丰富，非常实用，课程选用教材结构合理，实用性强，内容充实，通俗易懂，兼顾教学与自学。老师的讲解细致深入，习题具有针对性，对土力学的原理和方法有很好的巩固作用。通过课程的学习，不仅掌握了必要的学科知识，还开阔了眼界，掌握了土力学理论知识的实际应用。课程在培养同学创新精神和实践能力方面起到了较大的促进作用。学生普遍反映，土力学课程很受大家欢迎且是重要的基础课程，对其专业课程的学习帮助极大。近年来，学生对课程的讲授方式、教师的敬业精神褒奖有佳。“土力学”课程已成为本校水利水电学院和建筑与环境学院广大学生普遍认可并受到欢迎的一门课程。土力学课程网站2013年获四川大学课程中心优秀课程网站二等奖。",
    "C_course-v1:SCUT+145223+2019_T1": "本课程的主要内容包括计算机技术发展过程及趋势、计算机系统组成、数据的表示与运算、计算机硬件和软件、操作系统、办公软件、程序设计语言、数据库技术、多媒体技术、计算机网络、网页设计和信息安全。通过本课程的学习，学生不仅可以掌握计算机的基本理论和基础知识，而且能初步具备利用计算机分析问题、解决问题的意识与能力，提高计算机素养，为将来应用计算机的相关知识和技术解决所学专业领域的实际问题打下良好的基础。",
    "C_course-v1:TsinghuaX+40990255+2019_T1": "本课程介绍了建筑外环境、室内热湿环境、室内空气质量环境、空气流动，以及声、光环境，同时还从人的生理和心理角度出发，分析介绍了人的健康舒适要求与室内、外环境质量的关系，为创造适宜的建筑室内环境与室外微环境提供理论依据。通过学习《建筑环境学》，我们要完成这样的任务：（1）了解人类生活和生产过程需要什么样的室内、外环境；（2）了解各种内外部因素是如何影响人工环境的；（3）掌握改变或控制人工环境的基本方法和原理。",
    "C_course-v1:HUBU+20181017X+2019_T1": "无机化学为湖北省精品课程。该在线课程最大的特色是，与无机化学微信公众号相互结合，相互补充。结合微信公众号上的难点解析，对动态的视频课程进行分解，详解及补充，包括知识的拓展，视野的开拓，让在线课程不仅仅只是在线课程，而是真正作为一种无机化学有效教学手段，基于线上课程与配套的无机化学微信公众号，建立多元信息化的无机化学教学模式，激发学生的学习兴趣。",
    "C_course-v1:TsinghuaX+20190225x+2019_T1": "本课程旨在帮助理工科学生弥补管理知识与能力的短板，培养基础的管理素质，为将来职业生涯中走向管理岗位奠定基础。工业生产管理的对象，是一般性的工业生产系统与过程。本课程将带领同学们全面、系统地分析工业生产系统的各个侧面以及生产运营管理的详细流程，以效率、质量、成本、服务为导向，优化生产系统设计，使生产系统精益化运行。本课程教授的主要内容包括：工业生产系统的特点与管理要求，企业生产运营战略，新产品设计开发过程的管理，企业生产能力规模的决策规划，生产流程类型选择与设施布置，生产作业的工作系统设计，生产设施选址规划，质量管理与控制，市场对产品需求的预测，库存管理的原理与方法，综合计划与主生产计划制订，物料需求计划分解计算，详细生产作业计划、调度与控制，项目管理，精益生产方式，供应链管理。本课程在清华大学校内自2014年秋季开设至今，每学期32学时，作为全校性选修课，受到理工科院系学生的广泛欢迎。每学期选课人数在数十人规模，最多达80余人。两次在课堂评估中进入全校前5%。",
    "C_course-v1:ZUELX+20171127001+2019_T1": "创业教育已经成长为一种被广泛认同和推崇的现代教育理念，并逐渐融入大学的专业教育之中。本课程将以创业实践过程为主线，阐述创业所面临的主要问题和解决方案。《创业基础》是为培养学生创业意识、创业能力和基本创业技能而专门开发的创业教育课程。本课程设置7个教学模块，每个教学模块都有特定教学主题又彼此联系。这样的课程结构设计有很大的灵活性，可根据授课对象有效做到“因材施教”、“因时施教”。本课程的教学类型包括通识教育、实训活动（情景模拟与问题探究）和创业实践。《创业基础》在人才培养过程中一方面是提升受训者个体价值，包括开拓并引领学生的发展方向和职业生涯、提供学生在专业领域的发展动力、挖掘学生的发展潜能；另一方面是本校作为全国创业教育领先平台，在探索进一步促进高等学校创新创业人才培养模式改革，推进国家创新创业体系建设方面发挥着重要作用。本课程也有很强的学术探索、模式探讨和验证示范的社会价值和学术意义。",
    "C_course-v1:JNUX+jnu05011190X+2019_T1": "该课程是华文教育专业主干必修课程，是汉语国际教育专业、语言学及应用语言学专业特色选修课程之一。该课程以华文教育专业、汉语国际教育专业、语言学及应用语言学专业本科生为主要教学对象，也可供相关专业的研究生和海外华文教师修读。本课程主要学习内容包括：（1）了解华文趣味教学法的内涵、设计理念及依据。（2）掌握华文趣味教学的目的、性质、任务及原则。（3）对汉语趣味教学法有全面的了解，包括华文趣味教学法的类型、特点及目标。（4）掌握绕口令、儿歌、谜语、故事、古诗、做游戏、看图画画等华文趣味教学活动设计与选择的方法和原则。（5）掌握结合汉语教材语音、汉字、生词、句子、课文、课后练习等不同教学板块的特点或者听、说、读、写各项技能的训练有针对性地设计趣味教学活动的方法。（6）掌握华文趣味教学活动组织开展的基本原则与方法，组织并引导学生进行趣味教学活动实践。课程的主要教学目标是培养学生的实践教学能力，特别重视实践性教学环节的设计，采用教师理论讲授、代表性教学设计评析、示范教学过程观摩与讨论、教学设计与展示相结合的形式组织教学，从理论认识的形成，到用理论指导实践评析，再到教学设计实践，循序渐进，环环相扣，适合华文教育专业、汉语国际教育专业学员的认知、学习特点和该专业人才培养需求。学员在修读本课程后，均能形成就指定教学内容、教学对象及目标完成有针对性的教学设计和展示的能力。",
    "C_course-v1:TsinghuaX+THUSEM002+2019_T1": "微观经济学是西方经济学的重要组成部分，是经济、管理类本科生的专业基础课和MBA学位课程。在本课程中，你将学习微观经济学的核心原理：供给与需求及价格形成机制。学完本课程后你可以： 了解微观经济学的基本思维方式 学会分析市场的变动趋势 了解政府干预市场的利弊课程考核：微观经济学课程一共十六讲，每周一讲，每一讲都有一次单元测验，共包括十六次单元测验，该门课程总成绩由十六次测验和一次期末考试成绩构成，平时的单元测验占80%，期末考试占20%。具体的考核方式请以开课后的课程公告和评分规则描述为准。证书设置：学完一门课程并且课程总成绩60分以上，可以获得由清华大学和学堂在线联合颁发的合格证书，课程总成绩85分以上可以获得优秀证书。参考资料：[美] 曼昆著：《经济学原理》，北京大学出版社",
    "C_course-v1:NBCCx+NBCC000002+2019_T1": "本课程为茶艺认知与操作入门为核心的课程，为未来茶文化从业者、茶文化爱好者与艺术美学生活研修者、以及茶文化从业拟系统提升者等，提供有益学习和指导；通过本课程学习可以掌握中国传统六大茶类基本泡茶方法和技巧，并在对茶叶知识有一定认知基础上可以冲泡出一杯好茶汤，进而提升泡茶饮茶艺术美学创新创意能力，从而可以获得茶艺师基本知识与基本系统技能。同时，也可以体悟掌握中国茶文化融合释儒道思想独特魅力。    本课程学习内容将围绕着赏茶、泡茶和品茶这三方面来展开，具体也将主要体现在以下几个方面：1.课程第一部分以理解赏茶、泡茶和品茶的文化角度进行讲解与介绍：这部分主要包括茶文化历史回顾和茶艺解读两个层面内容。1)为中国茶文化历史回顾，并包括了以我国唐、宋和明朝泡茶饮茶方法为介绍重点的古代泡茶饮茶方式演变，以及儒释道对中国茶文化的推动两个方面内容；2)为茶艺解读，重点介绍茶圣陆羽及《茶经》的历史影响，以及茶艺层次结构两部分内容。2.课程第二部分侧重讲授和指导赏茶、泡茶和品茶知识与技能：这部分主要包括茶区、茶树和茶品知识的介绍和泡茶操作与品鉴两个层面内容。1)为茶区、茶树和茶品知识的介绍主要包括以下内容：茶树植物学特性及茶叶分类、中国和浙江省茶区、浙江省主要茶品介绍，以及茶叶品质感官鉴别方法与茶品介绍要点、表达要求。2)为泡茶操作与品鉴，主要包括两项内容：    第一为泡茶操作规范与技术要求，涉及泡茶用具及使用方法介绍、泡茶操作程序与要求、冲泡技巧、投茶方法和泡茶用水要求，以及喝茶方式与科学饮茶内容。    第二为不同茶类冲泡基本程序方法与动作要点、解说及茶汤体验角度与方法等；课程第三部分侧重讲授与指导赏茶、泡茶与品茶美学操作及创意设计。",
    "C_course-v1:TsinghuaX+40150442+2019_T1": "《汽车构造(2)》课程主要通过对汽车底盘基本组成和典型结构的介绍，使同学们掌握汽车底盘各系统及典型零部件的功用、结构特点和工作原理，据此来培养和提高同学们分析汽车底盘系统及典型零部件结构的能力，通过这门课程的学习，将为同学们后续课程的学习和工作打下坚实的基础。本课程的主要内容包括：传动系统、行驶系统、转向系统和制动系统四个部分，近年来随着新能源汽车的不断涌现和快速发展，我会适时在课程中加入新能源汽车底盘相关的内容。",
    "C_course-v1:imvtc+2018122701+2019_T1": "综合布线系统是智能化办公室建设数字化信息系统基础设施,是将所有语音、数据等系统进行统一的规划设计的结构化布线系统，为办公提供信息化、智能化的物质介质，支持将来语音、数据、图文、多媒体等综合应用。综合布线系统(Premises Distributed System,简称PDS)是一种集成化通用传输系统,在楼宇和园区范围内,利用双绞线或光缆来传输信息,可以连接电话,计算机,会议电视和监视电视等设备的结构化信息传输系统。网络综合布线的任务是以提高学生全面素质为基础，使学生能够掌握网络综合布线系统设计、施工、调试与故障排查等相关技术和职业技能，达到高素质劳动者和高等技术专门人才所必需具备的网络综合布线基本使用技能，使学生理解网络综合布线组建、设备安装与调试的内涵，及时了解网络综合布线技术新的发展趋势。",
    "C_course-v1:SCUT+20180427001+2019_T1": "微积分是高等数学中研究函数的微分、积分以及有关概念和应用的数学分支，它是数学的一个基础学科，是理工科院校一门重要的基础理论课。它推动了其他学科的发展，推动了人类文明与科学技术的发展，它的作用是举足轻重的。微积分（I）是本科生的一门必修课，内容主要包括函数、极限、函数连续性、导数及其应用、积分及其应用、不定型的极限及广义积分。极限是微积分的基本概念，微分和积分是特定过程特定形式的极限。通过全英教学，学生在学会用英语获取数学知识的同时又通过学习数学掌握和运用英语，达到双赢的目的。从而培养具有国际竞争力并适应国家和社会需要的国际化人才。授课目标：本课程的目的是使学生掌握一元微积分的基本概念，理论及其应用。通过本课程的学习，在理论上，使学生获得一元函数微积分的基本概念、基本理论和基本运算技能；在具体传授知识的过程中，在教学中注意培养学生抽象思维能力、逻辑推理能力、空间想象能力和自学能力，特别是综合运用所学知识去分析问题和解决问题的能力。Calculus is the branch of mathematics that studiesdifferentiatio",
    "C_course-v1:GZLIS+070200140+2019_T1": "《印刷色彩基础与实务》是印刷类专业的一门核心课程，为后续专业课程学习奠定必备的颜色理论与基础技能。主要内容包括：1.颜色如何形成？有何特点和规律？2.颜色有何属性？如何表示？3.印刷颜色如何形成？有何特点和规律？4.如何辨识与调校印刷品颜色？5.如何调配印刷专色？6.如何测量与评价印刷品颜色质量？。每个学习情境均以问题为线索、以典型案例或项目训练为引导，将从事印刷生产与管理所需的颜色理论与应用技能融入到各个情境之中。做到复杂内容简明化、深奥理论通俗化、抽象概念形象化、操作技能步骤化，易学、好学、实用。",
    "C_course-v1:TsinghuaX+40670453X+2019_T1": "随着数字和网络技术将传统的不同的媒介形态整合在同一个平台上，新闻摄影将成为未来新闻记者的必备技能，并将成为希望从事新闻行业的毕业生的核心竞争力之一。本课程将主要提供两个方面的训练：一是基本的摄影原理和技能的训练，其目的是将选课学生从一个摄影爱好者甚至是菜鸟，初步地转变为具有一定专业技能的影像工作者；二是图像表达能力和图像新闻敏感性的训练，使选课学生充分了解从事一般新闻摄影报道所遵循的基本规则和标准，并具备一定的图片新闻的报道能力。作为补充，本课程还将对新媒体影响下的摄影报道的走向进行初步的思考和讨论，以帮助选课学生适应未来的工作环境。",
    "C_course-v1:JNU+20180722001+2019_T1": "货币是人类最伟大的发明之一，从发明伊始就与人类的生活紧密相连。货币时间价值是货币的基本属性，是现代金融学的核心内容，也是人类对幸福和生命的认知心理反映之一。每一个人，无论是衣食住行，或是生老病死，都离不开货币，都要面对货币时间价值。    慕课《生活中的货币时间价值》是金融通识课程。秉承博雅教育理念，慕课《生活中的货币时间价值》涵盖货币时间价值的基本概念、原理、计算、应用以及财务计算器使用技能训练；在多学科视角下辨析概念，用生活中的投资理财案例说明原理、示范应用，手把手教您使用财务计算器，融知识性、实用性、操作性于一体；把现代金融学带入您的生活，帮助您提升财商、拓展心灵、追求幸福人生。 ",
    "C_course-v1:TsinghuaX+L061101X+sp": "《庄子》共33篇文章，分为内篇、外篇、杂篇三大块。内篇是《庄子》的精华所在，学界大多认为是庄子本人所作。其中既有文学的风釆、哲学的睿智、美学的情趣，更有洒脱的人生，充滿了正能量。本课程只对《庄子》的内篇，而且重点在从哲学的视角进行研读对，因为内篇阐述了哲学的方方面面，形成了一个完备的哲学体系。如，《逍遥游》阐述了庄子的人生观，《齐物论》阐述了庄子的世界观和认识论，《养生主》阐述了庄子的生命观和价值观，《人间世》阐述了庄子的社会观，《德充符》阐述了庄子的道德观，《大宗师》阐述了庄子的生死观，《应帝王》阐述了庄子的政治观。而且，其中有一以贯之的主线。这充分展现了庄子的大智慧，需要我们认真体会。",
    "C_course-v1:TsinghuaX+61030031X+2019sp": "教育学导引：本课程旨在向新进入教育研究领域的研究生介绍教育基本概念、原理、方法、以及教育领域从业人员基本素质要求。包括教育学是什么？怎样做教育研究？谁有资格做教育研究？",
    "C_course-v1:TsinghuaX+30230931X+2019_T1": "2006年王希勤教授任电子工程系系主任，发起并主持系教学改革。经过数年的教学研讨和调研，于2009年提出电子信息科学与技术知识体系的七个层次，在此基础上推动形成了清华大学电子工程系新的课程体系架构。现任系主任黄翊东教授于2007年任电子系教学副主任，主持和推动教学改革，最终形成了10门专业核心课+24门专业限选课+36门专业任选课的新课程体系，新课程体系于2011年正式全面启动。《电子信息科学与技术导引（1）》课程于2009年秋季学期第一次开课，课程内容按知识体系的七个层次展开： 1、场与物质，2、电势与电路，3、比特与逻辑，4、程序与处理器，5、数据与算法，6、通信与网络，7、媒体与认知。课程头尾分别添加‘电磁学史及分析数学史概览’和‘电子信息科学与技术的研究对象、知识体系及课程体系’。授课教师为王希勤教授、黄翊东教授、李国林副教授、葛宁教授、马洪兵副教授、吴及副教授、王昭诚教授和王生进教授。本课程是电子信息科学与技术知识体系的导引概论课，全面阐述电子信息科学与技术知识体系七个层次的内在关联性和各层核心知识框架。高中毕业后的电子信息相关专业学生、相关领域工程师可以由此课程对电子信息科学与技术知识体系获得一个全面深入的理解。本门课程在制作过程中得到了Google公司的资助，特此鸣谢。",
    "C_course-v1:TsinghuaX+30130274X+2019_T1": "光学工程基础是光电类、仪器类专业非常重要的一门学科基础课，是相关专业本科生的“看家 课”之一。光学工程基础课程分为应用光学和物理光学两大部分。应用光学主要包括：理想光学系统、光线追迹和成像质量、光学系统等三部分。物理光学主要包括：光的电磁理论基础、干涉光学系统、衍射光学系统、晶体光学基础和傅里叶光学等五部分。该课程为学生提供了扎实的基础和丰富的应用。我们有信心：你能领悟光学世界的奇妙。",
    "C_course-v1:HQU+20180307006+2019_T1": "戏曲艺术文化是中国传统文化的精粹，是中华民族文化艺术创造的瑰宝。广泛的开展传统文化普及与高雅艺术进校园活动，使学校课堂开设戏曲鉴赏等艺术课程常态化，规范化，是教育改革，培养创新型人才，继承发扬我国优秀文化传统，增强民族自信力的必由之路。艺术类课程，尤其是戏曲、戏剧课程，不同于以往普通类文化课，由于多种现实原因，戏曲戏剧等舞台艺术已经距离普罗大众的生活渐行渐远。因此，在校内开展戏曲戏剧教学必须要紧紧贴合学生的生长生活学习实际，科学合理设置课程方案，以期达到好的效果。坚持艺术求美，艺术涵养人性的原则。使学生通过戏曲戏剧课程的学习，在学习戏曲戏剧史论知识与艺术鉴赏的过程中，可以充分的领略到舞台艺术的魅力，体会到中国传统优秀文化艺术所蕴含的独特审美情趣。全面提升学生的美感、人文情怀、社会认知和艺术审美能力。",
    "C_course-v1:YAU+20181108X+2019_T1": "《解剖与生活》以生活常见现象作为切入点开启对人体结构的探索，同时通过在线课程对解剖教学进行拓展和延伸。让学习者从从生活实际出发，掌握人体形态结构相关的知识，懂得人体的功能，掌握常见的多种疾病形成原因、保健预防。本门课程包含11章内容，主要内容包括：绪论、消化与生活，呼吸与社会，泌尿与生活、生殖与生活、运动与生活，循环与生活、视器与生活、前庭蜗器与生活、神经与生活、内分泌与生活。",
    "C_course-v1:ZJFF+000516+2019_T1": "《商务礼仪》是浙江省高校精品在线开放课程，也是首批宁波市高校慕课联盟平台课程。课程中既有团队各位老师知识点的讲授，更有大量实操的示范及点评，使学员通俗易懂。有34个礼仪视频和对应章节练习。开设省市两个平台教学已经二年多，学生类型都是各高校学生，学生对该课程评价很高。",
    "C_course-v1:BSU+2018122403X+2019_T1": "进入21世纪，女性的社会地位发生了巨大的改变。她们不仅站上了国际舞台，用身体表达着女性的力量、速度、智慧与理性，在日常生活里，她们也获得了拥有健康的权利与机会。女性在不同时期有其不同的生理生化特点和营养需求，她们在不同阶段的某些营养问题又区别于男性（如青春期、孕期、产后、更年期的问题）。通过健康的饮食和营养，科学的运动是帮助女性建立自信，走向健康的重要手段。女性的修身、滋养带给女性无限魅力，也成就了更好的自己。本课程将介绍不同年龄、不同人生阶段女性的营养促进、运动健康的基本知识，培养融合气质、健康、修养于一体的优秀女性，演绎健康、幸福、精彩的成功人生。",
    "C_course-v1:KMUSTX+1803168+2019_T1": "基因工程是生物相关学科专业（生物工程、生物技术、生物科学等）重要的专业课之一，是生命科学的重要学科，内容涉及生物化学、微生物学、分子生物学等学科理论和实验知识。课程的主要目的在于使学生掌握基因工程的意义、基因工程操作的基本理论，技术和应用，为今后开展基因工程研究打下理论基础。基因工程是在分子生物学和分子遗传学等学科综合发展的基础上，于上个世纪70年代诞生的一门新兴生物技术科学。它的创立和发展，直接依赖于基因分子生物学的发展与进步，两者之间有着密切而不可分割的内在关系。通过基因工程的教学，达到如下教学目的：使学生了解和掌握基因工程的基本概念和原理；使学生掌握基因操作的主要技术原理和应用；使学生掌握基因工程的研究内容和操作流程；使学生初步掌握基因工程的基本实验操作技术。课程的主要内容包括基因工程的基本原理和方法；目的基因的获得；基因克隆的工具酶与载体；重组子的鉴定与表达；基因测序技术；基因组学以及基因工程的应用。",
    "C_course-v1:YSU+20180301001+2019_T1": "本课程是工科类专业中测控、电气和自动化、环境及相关专业必修的一门学科基础课，其理论严谨，实践性强，与工程实践有密切联系，对培养学生掌握科学思维方法，培养工程和创新意识有重要作用。通过学习正投影法原理，掌握几何元素（点、线、面、体）投影图的画法、简单基本立体截交相贯、典型零件综合表达方法等内容，了解工程图样的基本知识，培养初步的图形思维和空间想象能力。一般学时安排40学时左右，注重空间想象能力的培养，培养学生初步的绘图和看图能力。",
    "C_course-v1:HQU+20180307008+2019_T1": "课程的含金量高。马克思主义是科学的世界观和方法论，它教给我们认识世界的根本方法，为我们提供改造世界的伟大工具，为我们提供实现人生梦想的智慧启迪。这是一门思想性和知识性很强的课程，是值得所有青年学生向往的。不同专业的学生，都可结合自己所学的专业需要、兴趣爱好、职业规划等，选择这门课程。人性化的考试安排。“边学边考”，大大减轻同学们的心理压力。只要掌握了基本原理并能运用基本原理结合实际分析和解决问题，在考试中就有把握获得好的成绩。课程考核评价注重学习过程评价。采用百分制。章节测验占50%，在线考试占50%，合计100%。60分为及格， 80分为良好， 85分以上为优秀。成绩合格者，颁发课程证书。",
    "C_course-v1:SCUEC+20180620001+2019_T1": "本课程是线下课程《药理学》的在线版，偏重于药物发现史及常用药物临床应用介绍，是课堂教学的有力补充。该课程属于临床医学与基础医学的桥梁学科，对医学生及药学生均有重要意义。",
    "C_course-v1:TsinghuaX+10450012X+2019_T1": "欢迎同学们参加《现代生物学导论》的学习。在本学期中，我们将学习和生命相关的基础和前沿知识。本课程首先按照层层递进的框架结构，解释生物学的基本理论：在分子和细胞水平上，我们将会学习细胞的结构、生长、分裂和细胞通讯；在个体水平上，学习遗传和发育原理；在种群水平上，将了解生物演化，即整个种群在世代间的渐变，通过自然选择最终导致了今天我们所见到的多种生物；在生物群落和生态系统的水平上，将学习生态学，研究生物体之间以及生物与环境之间如何相互作用。本课程还将具体探讨演化的产物---生物体，着重讨论其结构与功能，这是大部分学生最感兴趣也是最为重要的部分。生物学是一门快速发展的学科，不仅仅体现在越来越多的生物学现象被发现和理解，也体现在新的生物学技术应用和学科交叉上。所以，本门课程特别注重了解包括基因治疗、干细胞研究、重组DNA、生物芯片等现代生物学前沿方面的最新进展。而且，将会讨论生物学和物理、化学、数学、计算机、心理学等学科的交叉应用。生物学同时也是一门实验科学，我们将会介绍一些经典的、有趣的、甚至是有争议的生物学实验及其设计，希望同学们在学习的同时培养批判性的思维。本门课程的课堂教学追求通俗易懂，宏观与微观紧密联系，基础与应用相结合，帮助同学们加深对生命科学基本概念和原理的理解，引导学生树立正确的科学态度。This introductory course includes the fundamental principles of biochemistr",
    "C_course-v1:XMU+2019031401X+2019_T1": "本课程由一支优秀的教师团队开展教学，理论讲解和实践操作融合。通过课程学习，学生可以较全面、系统地理解和掌握儿童身心方面的保健、营养、生长发育及疾病防治和护理的基本知识和基本技能。",
    "C_course-v1:SWU+2019031403X+2019_T1": "心理健康教育是根据学生生理心理发展的规律和特点，运用心理学的教育方法和手段，培养学生良好的心理素质，促进学生整体素质全面提高的教育。心理健康教育是素质教育的重要组成部分:是实施面向21世纪教育振兴行动计划，落实跨世纪素质教育工程、培养跨世纪高质量人才的重要环节。同时，切实有效地对学生进行心理健康教育也是现代教育的必然要求和广大学校教育工作者所面临的一项共同的紧迫任务。  学校心理健康教育的内容主要包括心理健康教育基础理论、学生心理健康维护、学生心理行为问题识别与矫正、学校团体训练的课程设计与实施等内容。学生心理健康维护是以面向全体学生为主，通过常规的教育训练来培养学生心理品质提高学生基本素质的教育内容，包括智能训练，学习心理辅导、情感教育、人际关系指导、健全人格的培养、自我心理修养的指导、性心理教育等。学生心理行为问题矫正是面向少数具有心理、行为问题的学生开展心理咨询，包括学习适应问题，如考试焦虑、学习困难、注意力不集中、学校恐惧症、厌学等问题的咨询和调适;情绪问题，如抑郁、恐惧、焦虑、紧张、忧虑等情绪的调节与辅导：常见行为问题，如多动、说谎、打架、胆怯等行为的咨询与矫正，身心疾患，如神经衰弱、失眠、神经性强迫症等身心疾患的治疗和矫正。学校团体训练的课程设计与实施主要涉及团体训练的主题、场合、注意事项及实施途径等的详细介绍。",
    "C_course-v1:BIFT+1301990078+2019_T1": "《服装数字科技》这门课通过介绍服装计算机辅助设计，虚拟服装，服装人体数字化，数字化服装定制，功能性纺织品，电子纺织品，服装3D打印，服装大数据应用，服饰文化的数字化传播等把数字科技与服装紧密结合。课程将最大限度地挑战学习者对于服装行业的原有认识，也必将引发大家对于服装以及其他纺织品的重新思考。 ",
    "C_course-v1:PekingX+2018122102X+2019_T1": "病理生理学理论课以课堂讲授为主，重点是病因、机体代偿反应和发病机制，要求学生按掌握、熟悉和了解三个层次认真学习，重点是疾病的发病机制，列入掌握和熟悉的基本概念和知识为考察的内容，了解和其他内容不在考察的范围。作为研究生的网上课程，按照现代疾病谱的变化趋势，我们选择临床常见的病理过程和综合征，结合临床案例，对相关重点内容进行介绍，着重在培养学生提出问题、分析问题和解决问题的能力。 ",
    "C_course-v1:PekingX+2018122101X+2019_T1": "该课程围绕护理研究的关键步骤，内容涵盖研究问题确立、文献检索与整理、研究方案的设计、资料收集方法、研究计划书撰写、论文写作及常见问题6个章节。该课程为护理专业硕士研究生的必修课。校内讲授时间为36学时，学生每年30~40人。该课程以科研案例贯穿，突出实用性，重点针对护理研究的重点与难点环节，结合案例进行讲解与剖析，引导学生分析和思考，注重培养学生发现问题及运用科研方法解决问题的能力。学生普遍反馈效果好，对研究生进行硕士学位论文的选题、开题报告及论文写作具有指引作用。课程评价为96~99分。",
    "C_course-v1:chzu+ZJ1867357+2019_T1": "在信息化促进工业化的时代背景下，社会对大学生的信息能力要求越来越高。当今大学生不仅需要具备主动检索信息的意识和行为，还需要具备信息伦理、信息鉴别、信息获取、信息评价、信息管理等信息素养综合能力。课程旨在培养学生基于信息知识、信息伦理和信息意识，获取和利用信息解决问题的能力，提高学生基于信息解决问题的综合能力和基本素质，提升学生的信息检索能力和独立解决问题能力，从而形成良好的信息素养能力。  《信息素养-互联网+时代的学习与生活》课程内容包括“互联网+时代的学习生活”、“信息的获取与鉴别”、“搜索引擎“、“信息技术新发展与应用”、”学术和专利检索”、“信息的存储与处理”、“信息安全”等。    该课程为首开课程，采用网上开课的方式，学生选修该课程后，完成网络平台中的视频观看，作业和测验等，该课程问题可以在网上与老师或同学进行讨论交流。  ",
    "C_course-v1:qhnu+20181212x+2019_T1": "本课程作为藏语言文学专业的基础课程，在国内率先创建，在校内开设多年，在校外讲授数场次，成为藏语言文学专业的一门新兴学科，受到学界关注，同行称赞。先后受邀到川、甘、青等地和西藏大学等高校讲授近二十余场次，得到喜爱，是现阶段广大师生青睐的一门新课程。   藏语形态丰富、结构严谨、语音优美、表达力极强，现行的藏文始创于公元7世纪，至今已沿用了近1400年，是中国境内现存印度系统字母中使用时间最长的一种，在我国乃至世界文字上占有重要的地位。本课程以历史为线索梳理藏文的发展历程，讲述曾经在藏民族历史上产生并使用过的各种与语言并行或辅助语言的广义文字，界定真正用来记录语言的现行藏文字符，划分藏文发展的历史时段，介绍藏文字母的分组、排列、搭配、书写等知识。   主讲教师执教经验丰富，从事藏语言文字研究与教学长达三十余年，著作颇丰。主讲人素有研究，自然能够驾轻就熟。本课程具有前瞻性和权威性，课程内容丰富，知识新颖，例举真实，讲解清楚，层次分明，字幕藏汉对照，容易掌握，学习效果好。为广大藏语爱好者或关注藏语言文化的各层人士提供良好的知识平台。",
    "C_course-v1:gztrc+2018122601+2019_T1": "本课程采用的教材是由王德清主编，四川大学出版社出版的《教学艺术论》。教学不仅是一门科学，更是一门艺术。该课程是师范类大学生所修的专业基础课。通过系统的学习，有助于师范类学生对教学艺术的理性认识，提髙教学艺术的理论研究水平和实践运用水平。学习该课程可以提高师范类学生的教学理论水平和实践水平，对提高师范类学生的教学能力有很大的作用，可以帮助学生掌握好的教学方法，熟悉教学各环节并把所学的教学艺术与实践结合起来，形成各具特色的教学风格。    课程特色：面对师范类专业学生，以《心理学》、《教育学》为基础，培养师范生的教学能力，从艺术的角度掌握教学过程各环节。   课程优势：该课程团队的教师有教育学专业教师，也有多年的中小学教育教学经验的教师，开发本门课程能够使得学生在充分利用教学理论知识的基础上掌握教学技能。  ",
    "C_course-v1:BUCM+2018122604X+2019_T1": "北京中医药大学护理学院循证护理教学团队集全院力量经多年培育，由院长带队，两名循证医学博士作为主讲，已完成三轮循证护理学课程的教学，得到学生的一致好评。同时，作为主编单位，编写人民卫生出版社十三五规划研究生教材《循证护理学》，参编国际护士会Sigma Ta To出版的《TransformingNursing Through Knowledge》。同时将循证护理作为北京中医药大学护理学院学科建设的重点工作。2013年11月护理学院成立了循证护理研究中心，致力于从事循证护理教学、研究和实践。目前循证护理研究中心下设两个循证护理合作中心：澳大利亚JBI（Joanna BriggsInstitute）循证护理合作中心和加拿大安大略省注册护士BPSO（Best Practicespotlight organization）循证护理合作中心。",
    "C_course-v1:TsinghuaX+2019032101X+2019_T2": "传说中的中国古典园林非常优秀而且历史悠远，但是可看的实物园境只有清代的遗存，清代以前的情况还像在迷雾之中。那些园境有什么不同的体验？有什么动人之处？有什么奇美的景象？有什么故事？有什么启发？有什么经验？课程用尽可能生动的方式呈现对明代园境的研究。这是《明·园境赏析》系列课程的第一季：《明代36佳境》。这一季课程中，我们重点分析了23个明代园林的49个园境。课程后续将有第二季：《明代11佳园》，第三季：《明代四大胜园》。课程特色： 1.课程内容是全新的，对明代园境的研究是首次公开呈现。2.课程的视角和方法独特，与历史研究不同，注重案例的设计效果，分析的方法是形（物质形态）与势的的相关或因果关系分析，这也是独特的。3.课程的呈现方式比较独特，希望尽可能生动。",
    "C_course-v1:shsmu+shsmu001+2019_T1": "常见病的评估、诊断与治疗是临床医学的重要组成部分，是认识和防治疾病、保护和人们生活质量的重要途径。生活中的常见病无处不在，如近年来发病率持续增高的甲状腺疾病；常见的慢性进行性肝病-肝硬化；令人闻之色变的尿毒症；累及妇女的宫颈癌；青少年群体高发的哮喘；由病毒感染、化学物质、放射线和遗传问题导致的儿童白血病，以及难以启口的抑郁症等等。这些疾病不同程度上影响着人们正常的生活与工作，给个体、家庭和社会带来无限的身心痛苦和承重的经济负担。然而，在这些常见病中，约有50%是可以通过早期的预防和有效的健康管理得以避免和控制的。希望本课程能给参与课程的学员具有针对性、便于理解的健康教育内容，预防疾病，促进健康，提高生活质量。",
    "C_course-v1:imvtc+2018122702+2019_T1": "《建筑材料》是建筑工程技术、建筑设计技术、工程监理、工程造价等专业必修的专业基础课。也是建筑工程技术和工程监理专业的核心课程。建筑材料课程内容主要以建筑工程主体常用材料为主线，研究不同材料的组成和构造，分析材料在不同使用环境、技术条件下的状态、技术性能、使用要求，进一步讨论如何有效应用和合理选择材料。课程整体设计坚持以职业能力要求为根本、以学生为主体、以工作过程为导向设计课程和组织教学，让学生在掌握在掌握材料种类、技术性质及标准要求的基础上，进而掌握材料性能及应用，质量判别和鉴定等技能。",
    "C_course-v1:GDUT+2018120405X+2019_T1": "《音乐漫步》课程，并非音乐专业之课程，而是探索跨学科教学的通识课，并通过8个维度(即八个理论章节)来探秘音乐鉴赏。 刻意追求：理性地进入感性地思考——不在于是否听懂音乐，而在于是否听进去；学习中顿悟生活中感悟——不在于理解音乐有多少，而在于有什么样的思考角度和广度；追求自由和谐的发展——不在于是否艺术专业，而在于是否享受艺术人生。 ",
    "C_course-v1:NGO20X+USTC2016002+2019_T1": "《公益众筹》是一门面向国内公益组织如何筹款的一门课。在这个课程中，我们除了最直接的如何写众筹计划书，更多的是给大家传达一个众筹理念，如何去长期的经营自己组织的众筹项目。整个课程我们分为6章，从最开始课程中讲众筹的基本知识以及公益众筹在国内的发展，讲到公益组织在准备众筹项目之前需要要准备的长期而又不可忽视的东西。比如说，公益组织在平时要有自己的品牌管理意识、要提炼自己机构的核心价值观以及核心能力。在这个部分讲完之后，后面的内容就有针对性的对具体实战的众筹项目进行讲解。首先，会介绍在准备众筹计划书的时候需要准备什么东西，到具体写众筹计划书的时候，各个模块和信息该如何表达，才能最吸引受众，然后到项目上线后，如何去运营和推广自己的众筹项目。最后一个章节，我们给大家带来我们NGO20服务过的众筹项目的一些成功案例，将案例详细解剖，用实际的例子来让公益组织有一个比较具象的概念。",
    "C_course-v1:BNU+2018122602X+2019_T1": "《中国电影经典影片鉴赏》课程选取不同时代的经典影片29部进行鉴赏，学生能系统全面地学习中国电影的理论知识，了解中国电影经典影片鉴赏的案例，培养电影赏析的综合能力。",
    "C_course-v1:TsinghuaX+04000083+2019_T1": "肿瘤严重地威胁着人们的生命，人们往往谈“瘤”色变。《肿瘤生物学概论》课程希望向同学们介绍肿瘤学的基本概念、相关的肿瘤生物学基本知识，结合适当的临床肿瘤学内容，期待同学们关注肿瘤、了解肿瘤，增加对肿瘤的预防意识，激发今后从事肿瘤研究的热情和兴趣。 本课程将采用由著名肿瘤生物学家Robert A. Weinberg编著的世界权威英文教科书《The Biology of Cancer》及其译本《癌生物学》、《肿瘤学》等多部教材作为主要参考书目，着重介绍肿瘤生物学的基本概念以及肿瘤现代科学与临床的发展，具有由浅入深、基础理论学习与临床感性认知相结合的特点。 本课程的同名理论课程为清华大学创新性课程，已开设4年有余，深受学生好评。本课程曾入选2018年全国高等学校创新创业教育“精彩一课”。本次线上课程首次上线开课时间为2018年12月，全课程历时3个月，共12讲，本科生和研究生都可以参加选课。虽然该课程主要属于医学专业方面的知识，但讲解中强调科普基础上的知识讲解，深入浅出，非专业学生也可以申请学习，有医学、生物学、药学、生医学、化学、物理学等理工专业背景的学生学习更有优势。 该课程邀请了清华大学医学院及附属北京清华长庚医院的8位从事肿瘤研究工作的教授及临床专家加盟，强有力的师资力量为学生带来最前沿、最资深的课程内容讲授。 ",
    "C_course-v1:btbu+20181228+2019_T1": "市场营销是通过市场来促进交换以满足人类需要和欲望的活动，它渗透生产和消费领域之中。而市场营销学是系统地研究市场营销活动规律性的一门学科，通过对市场营销的学习，就可以通过科学、合理的方法和手段促进买方和卖方加以顺利实现。",
    "C_course-v1:BSU+2018122405X+2019_T1": " 标准舞具有高贵优雅的宫廷文化特质，而华尔兹舞是标准舞中风格突出，入门较为容易和比较实用的一支舞蹈。当你裙袂飘飘，惬意舞蹈之时，你就能感受到华尔兹舞带给你得体的姿态礼仪与良好的气质；融洽和谐的人际关系；以及舞蹈练习体验让你感受到不同国度的文化浸润；学习华尔兹舞不仅让你收获到技能锻炼带来的身体锻炼价值，创造性地应用身体语言抒发情绪，而且培养了你在公众场合表现自己的自信心。 本课程带给学生的体验将是技术与艺术的全方位结合，不仅让你学会舞蹈，更重要的是让你体会到学习舞蹈所带来的愉悦体验和审美情趣的提高。",
    "C_course-v1:HEBUT+2019040202X+2019_T1": "低频电子线路课程是我校的一门传统的优质课程，2004年被评为“省级精品课程”，2016年获得首批“省级精品资源共享课”称号。2018年获批为“省级精品在线课程”。课程团队秉承一贯重视教学内容与方法的研究与改革的传统，重视学生工程实践能力培养，持续更新教学内容，以工程实践推动教学优势。教学视频制作精良，运用了大量动画生动展现讲解过程，以提升教学的直观效果。课程以“放大”为核心，主要讲授电子元器件、基本放大电路、反馈放大电路、集成运放及其应用电路。教学中将突出基本概念与基本分析方法， 理论联系实际，注意应用背景，努力增强学生解决复杂工程问题的能力。",
    "C_course-v1:USTC+SE20190403X+sp": "本课程从实践入手循序渐进，以Linux系统环境和Linux内核源代码为例，将Linux网络相关命令用法、Socket网络编程、TCP协议、IP协议及路由表、ARP协议及ARP缓存、二层交换网络的学习转发和过滤数据库等互联网架构的关键环节一一解析，并通过MenuOS实验系统进行代码跟踪分析。最终理解分析打开一个网页背后互联网的工作过程，其中重点分为三个抽象层次：一是便于人类理解的记忆的编址方式DNS Naming；二是便于全球定位编址和路由的IP Networking；三是便于局域网中实际完成数据交换传输的Layer 2 Switching；同时在理解互联网体系结构的基础上探寻它的历史演化渊源，乃至发现它背后的设计哲学，解读未来网络的演进方向。 互联网概述 1.1 课程内容简介1.2 网络协议基础1.3 上网浏览网页背后的网络通信过程1.4 实验环境安装配置1.5 网络相关命令 Socket网络编程 2.1 编译、构建和调试2.2 Socket接口2.3 UDP范例代码2.4 TCP范例代码 TCP协议 3.1 TCP协议概述3.2 Linux网络协议栈源代码简介3.3 Linux系统的编译、构建和调试3.4 TCP协议源代码分析 IP协议及路由表 IP协议基础路由表路由转发举例IP协议栈源代码解析路由协议简介网络层数据传输路径解析 ARP协议及ARP缓存 ARP协议基础ARP解析的过程ARP解析在网络传输过程中的作用ARP协议栈源代码解析 二层交换网络及转发过滤数据库 以太网基础交换机的学习、转发和过滤数据库常见二层协议数据链路层在Linux网络协议栈中的一些关键代码分析 DNS协议及域名存储与解析 DNS协议基础DNS域名的存储DNS域名解析过程分析 互联网架构设计背后的渊源 互联网架构设计的最初动机与核心目标互联网架构设计的具体目标及背后重要权衡",
    "C_course-v1:QLU+2018122607X+2019_T1": "1《装饰图案》会讲什么？ 从新石器时期的彩陶图案开始，装饰图案已经有六七千年的发展历史，既蕴含着中国的传统文化精神、又具有丰富的民族审美品格，更是涵盖着生活的方方面面。 当人类还处在衣不蔽体、食不果腹的蒙昧状态时，就不仅仅满足于工具的使用。在能够制造和使用工具之后，开始在工具上施加纹饰，并以浪漫的想象和奇异的图案装饰自身和环境。千万年来人类的这一装饰行为历经沧桑巨变而从未间断，并且演变发展、日臻完善，创造出浩如烟淼般的工艺品和丰富多彩的装饰图案。这是一部人类对美的恒久不变追求的历史，是从自然到社会，从模仿到创造的装饰美化的历史。可以说装饰图案是非语言所说明的世界观，独特而微妙的反映了着人类及其艺术的历史。  课程从“装饰图案”的概念入手详细讲解了装饰图案的功能、分类、艺术特征以及装饰图案的艺术演变，结合精美的实物案例，分析装饰图案的传统文化内涵、艺术美学价值以及装饰图案的构成规律。 通过装饰图案丰富的形式内容寻找所蕴含的形式美法则，从装饰图案的素材、写生、构图、造型、色彩，到工艺、材料，再到设计中的应用，由浅入深的带领大家认识、了解装饰图案创作的方法和步骤，引导大家学会设计和应用精美的装饰图案。 2《装饰图案》课程适合什么人学习？  《装饰图案》这门课程是面向艺术设计各个专业方向开设的一门专业基础课。艺术设计的本科生在入校之前和入校之后首先要进行写实性基础训练，学习的课程有素描、速写、色彩等，这些写实的基础训练如何转化为专业创作的能力呢？ 装饰图案课正是引领大家由“写实类的基础训练”向“装饰性的专业创作”过渡的桥梁课程。 在这门课程中从观摩、理解优秀的传统图案作品开始，带领大家积累设计创作的素材；以理解和建立原创的设计思维为核心，将自然、历史、文化、生活、设计、时尚等融入图案审美的感悟之中；逐渐揭示出美的创作规律和装饰的表达方法，从而建立起学习者正确的观察美的视角、欣赏美的品味、表现美的创意和创作美的能力。 在欣赏与训练之中让你的审美品味和艺术修养得到全面提升，为艺术设计的专业创作或者是生活中装饰之美的应用打下坚实的基础。  如果你不是艺术专业的学生，只要你喜爱美术、善于发现生活中的美，有表达美的创作欲望，同样可以加入《装饰图案》的学习。 《装饰图案》课程通俗易懂，知识点的讲解从案例入手，由图片代入，生动直观，即使没有设计基础的朋友们一样可以轻松接受，且有不同层面的收获。对于认识和理解装饰图案之美，了解图案背后的人文文化、传统文化，甚至是发现和运用生活中的装饰之美都具有现实意义。所以无论是中小学生的美育教育，还是对于提升审美有要求的朋友都来加入我们的课程学习吧。  综上所述，适合学习的人群包括：1.适合艺术设计专业的学生作为专业基础课程学习。2.适合热爱艺术、需要提升生活的审美以及艺术修养的人群学习。3.适合中小学生、大学生作为美育基础教育学习。 通过本课程的学习，你将获得： 1.系统的学习装饰图案的相关知识，并了解装饰图案的发展演变历史。 2.认识装饰图案的形式美法则，以及装饰图案的创作规律与创作方法。 3.发现生活中的装饰图案，通过图案美更加深刻的认识图案所传达的传统文化精神以及图案所蕴含的美学原理。 4.创作出符合时代审美需求的装饰图案，让图案之美为设计、为人们的生活增添光彩。 5.通过平台和老师、同学面对面探讨身边的装饰图案案例，从实践入手、从生活入手，分析装饰图案、提升设计创作的能力。 ",
    "C_course-v1:BFU+2018122709+2019_T1": "《风景园林艺术原理》主要内容包括：风景园林的概念，传统园林艺术概况，现代风景园林艺术概述，风景园林规划设计程序，风景园林空间构成，风景园林与自然系统，风景园林与人类社会。通过本课程中的学习，可以为后继的风景园林规划设计系列课程奠定必要的专业理论基础。",
    "C_course-v1:NEU+2018122401X+2019_T1": "无机化学主要教学内容包括：化学反应中的能量关系；化学反应的方向、速率和限度；酸碱反应和沉淀反应；氧化还原反应；原子结构与元素周期性；分子结构与性质；固体结构与性质；配位化合物结构基础理论知识。",
    "C_course-v1:SCUEC+2018112001X+2019_T1": "传统的民族手工艺术是我们民族文化的瑰宝，如何能够更好的传承并创新性的转化他们，首先我们要了解和学习这些手工艺，我们的民族手工艺术有编织，刺绣还有许多少数民族的特殊技艺，例如国家级非物质文化遗产土家族的西兰卡普编织技艺等，我们的课程团队还加入了非物质文化遗产南通彩锦绣大师王建华老师，她将为我们解读彩锦绣的魅力！我们将学习这些技艺的一些精髓，并在此基础之上和我们现代的时尚生活进行紧密的联系，让更多的人感受到传统手工艺的美，民族手工艺能够让我们在当今快速的生活节奏中驻留一个呼吸的场所，在这里留下时间的痕迹，发散技艺的温暖。  ",
    "C_course-v1:XJTU+2018112004X+2019_T1": "“家事、国事、天下事，事事关心”，中华文化熏陶下的读书人都怀抱更高层次的社会理想与人文关怀。随着我国国家利益的不断拓展，中国的国家安全已远远超出了守疆戍土的传统概念，其范围更加广泛，形式更加多样，虽然往往看不见硝烟，但较量无处不在。作为一个有社会责任感的大学生，无论将来从事何种专业领域，都应具备健全的国防通识知识。引导当代大学生对纷繁复杂的热点问题理性思考、辨明是非，树立总体国家安全观，培养战略思维，维护国家安全、保障国家利益是这门课程要达到的最终目的。",
    "C_course-v1:TsinghuaX+34100333+2019_T1": "本课程介绍形式语言、自动机、文法、可判定性问题及计算复杂性，内容包括：基础知识；确定性有限自动机、非确定性有限自动机；正则表示与语言；正则语言与正则文法；正则语言的性质、Pumping引理及应用；上下文无关文法与语言；下推自动机、确定性下推自动机；上下文无关语言的性质、上下文无关语言的Pumping 引理及应用；图灵机；不可判定问题、NP问题等。",
    "C_course-v1:CMU+2018122401X+2019_T1": "传染病学课程内容包括传染病学总论和各论。 总论主要介绍有关传染病的一些基本概念，如：感染、感染过程的表现、病原体的致病作用和机体的防御功能、传染过程后的结局、流行过程、传染病的基本特征和临床特征、传染病的诊断、治疗和预防、我国的传染病防治法",
    "C_course-v1:DUT+3412113011+2019_T1": "本课程是微积分课（高等数学课或数学分析课）的补充，旨在使学生熟练掌握与运用微积分知识，体会微积分中所蕴含的数学思想，同时培养学生运用微积分知识处理问题的思维方式，使学生更准确地使用微积分中的数学语言，提高学生将抽象的概念与定理应用到具体的问题中的能力。春季学期本课程主要分为级数，多元函数微积分，常微分方程。",
    "C_course-v1:nxu+2018122712+2019_T1": "《醉美葡萄酒》由澳大利亚阿德莱德大学留学归国博士、国家一级品酒师、国际葡萄酒大赛评委李茹一博士带领宁夏大学葡萄酒学院“品尝学教学团队”制作完成。本课程通过讲授葡萄酒的历史文化、酿酒葡萄品种和葡萄园风土等基础知识，结合实景演示葡萄酒品尝、餐酒搭配、葡萄酒礼仪以及酒庄酒窖等教学内容，向葡萄酒初学者提供一个清晰易懂且全面的知识体系与实践方法，使大家了解葡萄酒，爱上葡萄酒。",
    "C_course-v1:BSU+2018122404X+2019_T1": "本课程共八个教学单元，主要面向社会大众及在校学生，教学内容基础全面，动作全方位细致讲解，教学安排科学合理，向学习者全面讲授网球的基本技术、各项技术的练习方法及纠错。通过本课程的学习，可以使广大的网球爱好者熟练掌握基本技术，充分感受网球文化与乐趣，领略网球运动的魅力；是广大爱好者学习及了解网球运动的有效途径；也是培养学习者对网球的兴趣和爱好，培养网球爱好者勇于挑战自我，坚韧不拔的意志品质。课程成绩构成：课后习题成绩50%+期末考试成绩50%",
    "C_course-v1:nxu+2018122711+2019_T1": "西夏是由党项族建立的多民族政权，虽偏处西北，但却创造了我国历史上一系列辉煌，如世界上最早的活字印本，我国最早的图像版《西游记》，我国历史上第一次尊孔子为文宣帝，都是出自西夏。教育部“长江学者”特聘教授杜建录带领宁夏大学西夏学研究院的学术团队，为同学们解读诗一样的西夏。",
    "C_course-v1:BFU+2018122710+2019_T1": "《植物景观规划设计导论》是面向园林、风景园林与城市规划专业学生开设的专业核心课程之一，主要讲授植物景观相关的基本理论知识与规划设计内容。课程主要内容包括：植物景观的概念、植物景观的功能、中外古典园林植物景观特征、植物景观规划设计的基本原则、植物景观的空间特征及营造、植物与其他景观元素的组景、主要花卉景观、专类植物景观、植物景观规划的基本内容、植物景观种植设计的基本内容以及植物景观规划设计规范及成果表达等11个章节。总体上，课程对于培养学生的植物景观规划设计专业素养，提升规划设计能力，开拓视野，了解风景园林行业的前沿内容具有重要作用。",
    "C_course-v1:nxu+2018122713+2019_T1": "本课程是由宁夏大学生命科学学院“遗传学教学团队”倾力打造，面向各专业本科生开设的通识选修课，本课程分绪论，遗传病，外貌的遗传，生命从一个细胞开始，基因工程与人类健康，性别决定，长寿、智力的遗传，从细胞的分化看克隆问题，肿瘤的遗传，解密“天书”，血型遗传共十一讲全面揭示与人类健康密切相关的遗传学知识，力求从个体到群体、从细胞到分子、从形态到生理生化、从正常性状到病理性状等不同层面对与人类遗传有关的现象和规律进行了系统的介绍，既突出重点又注重基础知识，将实用性和趣味性融为一体。",
    "C_course-v1:jxust+2018122701X+2019_T1": "本课程为大学物理中光学的全部内容，包括几何光学、波动光学和光量子理论三大部分。对中学没有学过光学模块的也可在这里完成从入门到提高的全过程。另外本课程力求摆脱以应试来学习物理课程的不良学习习惯，在课程中贯穿科学史并尝试用人文色彩讲述光学课程。课程要点如下。第一章 光之初印象：简单介绍光给人们的主要印象，教育与光明和光学发展的主要过程。然后是光学成像的最初理论。第二章 光之色，光之速：光的颜色、日常生活中天空的色彩、彩虹、海市蜃楼、天空亮度的成因和光速测量等。第三章 揭开光的面纱—光的本性：光是波还是粒子？波动理论，电磁波理论； 第四章 光的干涉：介绍双缝干涉、薄膜干涉、等厚干涉等原理及应用。第五章 光的衍射：介绍光衍射的基本理论与光学仪器分辨率。第六章 光栅衍射：光栅衍射形成及其特点；第七章 光的偏振。介绍光偏振的现象及日常产生偏振的方法和偏振的应用。第八章 光的波粒二象性：介绍量子论的产生，爱因斯坦光量子理论和光的波粒二象性及玻尔的氢光谱理论。",
    "C_course-v1:TsinghuaX+30240332+2019_T1": "随着java技术的普及，学术界和工业界使用java语言的人数越来越多，涉及领域也越来越广，尤其是大数据和分布式系统的迅速普及，java技术得到前所未有的发展和流行。本课程在java基础编程的基础上针对java线程、网络编程、java虚拟机、垃圾回收机制、java集合类详解、java反射与代理以及java的字节码技术等做进一步的讲解和分析，使得学习该课程的同学能更加深入的理解和掌握java语言和相关技术。",
    "C_course-v1:TJUFE+2018122506X+2019_T1": "本课程主要面向物流专业的学生或对从事物流方向工作的初学者们。从物流活动的元素入手，对相关知识进行了简要叙述。内容如承运人、货代、物流公司等概念开始，对牛鞭效应、供应商选择与评价等供应链管理知识也从实践角度以访谈的形式讲述。课程选取部分案例——如“我们的一带一路”，从马尔代夫访谈入手，讲述HS归类、货物勘探等实践类知识。相关章节对海关等也作了简要描述。",
    "C_course-v1:TsinghuaX+20180919X+2019_T1": "经济学原理（上）主要是讲述经济学原理的微观部分，即微观经济学。微观经济学是有关人的行动和个人与社会合作的一种理论模型和思维方式。本课程将系统介绍微观经济学的基本原理及其在现实生活中的应用。   课程内容将特别关注以下问题：经济学如何分析人的有目的的行动；理性人如何做选择；市场如何协调个人的选择实现社会的合作共赢；如何衡量资源的有效配置；社会分工和市场竞争如何推动技术进步和创新；企业家如何发现市场和推动经济增长；国际贸易和全球化何以能改进全人类的幸福和和谐；什么是市场与政府之间的边界；政府干预如何影响个体行为和市场的有效运行。   通过学习本门课程，可以帮助你了解你生活的世界，可以用原理来指导自己的经济实践，启发自身对经济现象进行分析和判断，从而让你更精明地参与经济生活   从知识进阶的角度来看，本门课程还是进入经济学帝国最初路",
    "C_course-v1:NDU+2019042601X+2019_T2": "本课程由军事科学院、国防大学、空军指挥学院著名军事专家杜文龙、徐焰、孙旭、孟庆全、邵志平等人，遵照《普通高等学校军事课教学大纲》（教体艺〔2019〕1号）联袂推出、精心打造。共分8个专题，包括中国国防、国家安全、军事思想、现代战争、信息化装备五大板块的核心内容与重难点问题。本课程自成体系、内容新颖、解读权威，既可作为普通高等学校必修的精品军事理论课，也可供关心关注国防和军队建设人士自主学习。",
    "C_course-v1:CSU+2019043001X+2019_T1": " 医患沟通技能学”是将医学专业、交流技能及人文知识融合应用的一门课程，可以应用于 本科生、住院培训医师和医务工作者。 课程 从医患沟通概述、病史询问、医患沟通的各种技巧、门急诊医患沟通、病房医患沟通及各种特殊病人医患沟通等几个方面来介绍医患沟通的各种运用技能，最后还通过案例分析，介绍各种医患纠纷的预防和处理， 具有很强的实践性。课程根据知识点将学习内容分割成若干小课程进行，每节课5-10分钟。采用讲授与情景演示结合、案例与点评结合等多种形式，将临床工作中常见医患沟通技能和技巧全方位多角度展示给学生。本课程将帮助学生很好地掌握医患沟通所需要的基本技能，并运用于不同的工作场景，更好地取得患者及家属的理解、信任和配合，最终达到医患互惠双赢、人民健康状况普遍提升的目的。",
    "C_course-v1:CSMZXY+2018111301X+2019_T2": "习近平总书记在十九大报告中深刻阐明，“文化是一个国家、一个民族的灵魂。文化兴国运兴，文化强民族强”，继承并发展我国优秀传统文化，能夯实我们文化建设的根基，奠定我们文化自信的底气。作为一种文化现象，婚礼文化有其演进、沿革及发展的规律，本课程以历史、文学、经济、社会等作为婚礼文化研究的线索，将其看作是一个包含着婚姻礼仪、婚姻观、吉喜崇拜等多种因素、具有地域、民族、时代差异的综合文化体系，让学习者更好地认识并理解人类婚姻行为，更好地理解婚礼文化是民族文化的浓缩和精髓。   通过本课程的学习，学习者应理解，无论是传统还是现代的婚礼样式，核心和灵魂都离不开婚礼文化的滋养。作为一名现代婚礼人，无论身处哪一个岗位，都有必要提升对婚礼文化的认知和理解，让婚礼不失礼节、不犯忌讳，进而在此基础上追求审美和创新；理解婚礼作为一种文化现象，有其演进、沿革及发展的规律，在国内与国外、传统与现代、历史与现实的环境之下均有差异，应取其精华，弘扬民族优秀文化。",
    "C_course-v1:SYJU+030020406+2019_T1": "本课程是建筑环境与设备工程专业的一门主干专业课，主要阐述创造和维持建筑热、湿、空气品质环境的技术，即采暖、通风与空气调节技术，它涵盖了所培养的毕业生将来从事专业工作所需的主要专业知识。本课程于2007年获得校级精品课程，校内讲授时间为72学时的课堂理论学时，外加12学时的实验课程，是建环专业学时最多的专业课程，总学分达到5学分。授课对象为建筑环境与能源应用工程专业本科学生，每年学生数180人，总授课学生数达到3200余人。由于课程本身特点，受到师生的共同重视，本课程师资队伍一直是最为雄厚的，长期由2名资深教授担任主讲，3名副教授协助授课，参与课程设计和实习的人数达到14人。授课效果良好，学生学习积极性很高。学生就业后能很快适应专业需求，注册设备工程师通过率逐年提高。在线课程对《暖通空调》教材进行了有机调整和组合，共分7讲，分别为：绪论、</span><span>暖通空调负荷、供暖系统、空气调节系统、建筑通风、民用建筑火灾烟气控制、室内气流分布。本课程的教学目的是使学生了解和掌握建筑冷热负荷和湿负荷的计算，各种采暖、通风与空调系统的组成、功能、特点和调节方法，系统中主要设备、构件的构造、工作原理、特性和选用方法，并使学生对建筑节能、暖通空调自动控制、暖通空调领域的新进展和新技术有一定了解。初步掌握供暖、通风和空调系统和设备的测试方法和运行管理的基本知识，对暖通空调技术的新理论、新技术和新设备有所了解。使学生在学完本课程并辅以一定的实践环节后，掌握室内环境控制理论与技术，培养学生具有一般民用和工业建筑暖通空调系统的设计基本能力。",
    "C_course-v1:HBNU+2019051509X+2019_T1": "《5G与人工智能》是面向所有本科生的公共选修课，想了解未来的工作、对新技术的出现与发展有兴趣的同学，特别将来有意从事5G、人工智能或者相关领域相关工作的文科、理工科的学生都可以听。学生不仅能了解当今热门的科学技术需要的基础、5G和人工智能的基本知识，还能了解对于未来现在要做什么准备。课程优势在于与国家战略结合紧、视角新、通俗易懂又有部分深入引导，所有专业学生都能听懂，紧扣当今科技经济发展趋势，极大提高学生的兴趣和动力。",
    "C_course-v1:TCIS+2019032101X+2019_T2": "十九大报告凸显文化自信的重要意义，强调引导人们树立正确的历史观、民族观、国家观、文化观。中央社会主义学院设置核心课程《中国古代思想文化史》，就是要使学员认识到中国特色社会主义道路是中华民族悠久历史的延续，通过文化共识达成政治共识。与通常的中国古代思想史、哲学史、文化史相比，本课程最大的特色，在于以“大一统”为主线，串起中国思想文化历史演变的各大关节。课程不追求大而全的平铺直叙，而是选择了几个关键的时间节点，集中回答有关“大一统”的核心问题：通过“殷周之变：从尊神到敬德”，讲清楚“大一统”的道义基础，回答“凭什么大一统”的问题；通过“周秦之变：从封建到郡县”，讲清楚“大一统”的政治和文化整合方式，回答“靠什么大一统”的问题；通过“唐宋之变：从门阀到科举”，讲清楚“大一统”的人才基础，回答“靠谁大一统”的问题；通过梳理由元至清的民族整合，回答“大一统怎么大”的问题。在清代以来的“古今之变”中，“大一统”经历了从传统到现代的巨大转变，需要回答好“大一统向何处去”的问题。最后，在清代以来的“古今之变”中，“大一统”经历了从传统到现代的巨大转变，课程以简要回答“大一统向何处去”作为结尾，点出中国共产党使中华文明以现代国家的形式得以更新和重建，完成“大一统”的升级版本。作为中央社会主义学院“五史合一”的首门课程，该课程得到有关中央领导的高度肯定，并深受广大学员的欢迎。他们认为，必须在新的历史条件下坚持和完善中华“大一统”格局，坚持中国不可分裂、中华民族共同体不可离散、中华文化不可消解。作为中华儿女的一份子，要自觉维护国家统一和民族独立，致力于中华民族的伟大复兴。",
    "C_course-v1:TCIS+2019032501X+2019_T2": "本课程立足于中华儒商文化传统，以案例为基础，通过古今比较、中西对比，深刻阐释了以人为本是中华商道的本质，全面分析了中华商道的历史发展及其丰富内涵，深入剖析了中华商道是企业文化兴起的直接原因,是现代企业管理的根本。在此基础上明确指出，弘扬以人为本的中华商道，要根据新时代的实践要求，以近代儒商为榜样，实现中华商道创造性转化和创新性发展，成为培育为当代企业家精神的源头活水和构建亲清政商关系的深厚基础。本课程是中央社会主义院教学改革“如何给非公有制经济人士讲授中华文化”的核心课程，两年来已给中央社会主义学院各个干部班次以及校外授课50余次，受到学员一致好评。",
    "C_course-v1:TCIS+2019032502X+2019_T2": "本课程从国家建构的新视角，采用点线结合、经纬交织的方法，立体地呈现中国共产党近百年的苦难与辉煌，在“求历史之实”的基础上，“求历史之是”。主要从中西方文明、历史与现实、国共两党等多个角度进行比较，重点分析中华民族的危机与中国共产党的创立、国共竞争与民族复兴的选择、建国执政与中华民族走向复兴、中华民族伟大复兴的新时代等问题，深入阐述为什么没有共产党就没有新中国，为什么只有社会主义才能救中国，为什么只有中国特色社会主义才能发展中国。本课程是中央社会主义学院教学改革“五史合一”模块的核心课程，两年来已给中央社会主义学院各个干部班次授课百余次，受到学员一致好评。学员评价说：“这堂课刷新了我们以前的认识，党史原来可以这样讲!”       ",
    "C_course-v1:CSU+82150112201+2019_T2": "循证医学是一门以解决临床问题为出发点，培养学生的批判性思维，树立循证医学理念，掌握循证医学方法，在临床实践中发现问题、寻找现有最佳证据、评价和综合分析所得证据，结合临床经验，充分考虑患者的意愿和价值观，做出正确的疾病诊治方案能力的课程。慕课以其大规模、自主性和开放性的优势打破了现有的“教室型”教学模式，学习者可以根据自身实际，自主安排时间到网上自由地选择课程进行学习，不受任何人为的、时空的限制。因此，循证医学的慕课课程将大大提高学生的学习兴趣和自主学习能力，提高教师的教学能力，改变教师在教学中的地位。    课程教学对象包括医学各专业硕士研究生，每年开课人数近500人。教学依照学生的学习特点在教学内容和方法上进行调整和增订，在学生中受到良好的反应。课程内容包括：1）循证医学总论；2）临床指南的制定与应用；3）临床科研方法学；4）临床研究证据的评价标准；5）临床实践中发现和提出问题等内容。   本课程的特色是：在强调医学研究生必须掌握扎实的医学理论基础和基本技能的基础上，提出现代医学要求的、最新的、科学的循证医学理念，让医学研究生在成为临床医师之际，懂得临床医学和临床科研的最新理念，使我校培养的临床医学研究生能更快的适应现代医学的要求。目前在国内各院校的临床医学研究生课程中还没有普及《循证医学》的专设课程教学，同时，在临床科研实践中进行循证医学理念的科研设计、实施更是未见报道和开启，我院率先开启和完善《循证医学》课程的学习并应用于临床科研中，力争建立临床科研的循证医学模式，其国内外影响力不容小觑。考核方式：在课程视频学习的基础上，完成期末考试，满分100分，60分合格，85分优秀。",
    "C_course-v1:TW+2018052501X+2019_T3": "《STEM课程设计与案例分析》课程，它是：1.国内领先针对STEM教育系统设计的第一门STEM mooc课程。2.结合国内外实际案例系统介绍STEM课程。3.生动有趣、易于理解，将多媒体动画设计融入理论知识。4.提供全球STEM相关工具、网站、期刊等信息资源。课程目标：了解STEM基础知识，掌握STEM教学法，利用全球STEM工具进行STEM教学设计 主要受众：对STEM教育感兴趣的本科生、研究生、职前与在职教师 主要内容：STEM教学理论知识、STEM教学教法、STEM案例分析、STEM相关资源等。考核方式：除课程视频学习外，章节作业和期末考试各占课程总成绩的40%、60%，满分100分，60分合格，85分优秀。 ",
    "C_course-v1:TsinghuaX+60700052X+2019_T2": "本课程作为数据科学的先导课和认知类课程，致力于以形象生动的教学模式为学生普及数据挖掘、大数据相关的基础知识、核心概念和思维模式，从工程技术、法律规范、应用实践等不同角度描绘数据科学的美好蓝图。",
    "C_course-v1:TsinghuaX+80515182X+2019_sp": "脱胎于清华经管学院与麦肯锡公司联合开设的线下金牌课程，麦肯锡全球领导力在线课程共包含六个模块，每一个模块深度探讨全球视野、投资、技术、转型、运营和组织中的一个方面，并提供系统分析框架和实例，模块之间相互独立又从不同侧面反映出全球领导者的个性和共性。本课程由麦肯锡董事长鲍达民领衔，主授课人为来自全球顶级企业的CXO，在麦肯锡资深咨询管理专家的配合下，通过真实案例的分享，帮助参学者建立前瞻性视野和全球领导者的思维模式，理解组织变革、促进创新、危机管理等具体情境下的领导力问题，并构建解决问题的核心能力。Gathering the world-class business leadersinto the Tsinghua SEM classroo",
    "C_course-v1:NEU+2019012201X+2019_T2": "物理化学（上）是一门运用物理学手段和技术研究化学问题的学科，被誉为化学学科的“大脑”。本课程将系统讲授物理化学的知识体系，内容涉及热力学基本定律、多组分溶液系统、化学平衡和相平衡等基础理论知识。本课程是东北大学校级精品资源共享课和精品骨干课，由具有丰富教学经验的教师主讲，通过生动形象的启发讲解，使你系统、快捷地学习物理化学知识点，了解重点难点，掌握分析和处理物理化学问题的方式方法，形成良好的科学素养。本课程不但适用做化学、化工、生物、制药、环境、冶金、材料、加工、铸造和选矿等专业学生的基础课，亦可作为研究生考研课程物理化学的复习课程。相信通过本课程的学习，无论对于后续专业课程的继续学习，还是对于考研复习，你一定都会收获颇多！",
    "C_course-v1:NEU+2019012202X+2019_T2": "物理化学（下）是一门运用物理学手段和技术研究化学问题的学科，被誉为化学学科的“大脑”。本课程将系统讲授物理化学的知识体系，内容涉及电化学、化学动力学、界面化学与胶体和统计热力学基础理论知识。本课程是东北大学校级精品资源共享课和精品骨干课，由具有丰富教学经验的教师主讲，通过生动形象的启发讲解，使你系统、快捷地学习物理化学知识点，了解重点难点，掌握分析和处理物理化学问题的方式方法，形成良好的科学素养。本课程不但适用做化学、化工、生物、制药、环境、冶金、材料、加工、铸造和选矿等专业学生的基础课，亦可作为研究生考研课程物理化学的复习课程。相信通过本课程的学习，无论对于后续专业课程的继续学习，还是对于考研复习，你一定都会收获颇多！"
}